; ModuleID = 'syrk.cu'
source_filename = "syrk.cu"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timezone = type { i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.cudaDeviceProp = type { [256 x i8], i64, i64, i32, i32, i64, i32, [3 x i32], [3 x i32], i32, i64, i32, i32, i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [2 x i32], [3 x i32], [2 x i32], [3 x i32], [3 x i32], i32, [2 x i32], [3 x i32], [2 x i32], i32, [2 x i32], [3 x i32], [2 x i32], [3 x i32], i32, [2 x i32], i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32 }
%struct.dim3 = type { i32, i32, i32 }
%struct.CUstream_st = type opaque

@.str = private unnamed_addr constant [35 x i8] c"Error return from gettimeofday: %d\00", align 1
@.str.1 = private unnamed_addr constant [74 x i8] c"Non-Matching CPU-GPU Outputs Beyond Error Threshold of %4.2f Percent: %d\0A\00", align 1
@.str.2 = private unnamed_addr constant [32 x i8] c"setting device %d with name %s\0A\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"%d, %d, %d, %d\0A\00", align 1

!231 = !DISubprogram(name: "atan2", scope: !223, file: !223, line: 60, type: !232, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!232 = !DISubroutineType(types: !233)
!233 = !{!171, !171, !171}
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !235, line: 180)
!235 = !DISubprogram(name: "ceil", scope: !223, file: !223, line: 178, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !237, line: 199)
!237 = !DISubprogram(name: "cos", scope: !223, file: !223, line: 63, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !239, line: 218)
!239 = !DISubprogram(name: "cosh", scope: !223, file: !223, line: 72, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !241, line: 237)
!241 = !DISubprogram(name: "exp", scope: !223, file: !223, line: 100, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !243, line: 256)
!243 = !DISubprogram(name: "fabs", scope: !223, file: !223, line: 181, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !245, line: 275)
!245 = !DISubprogram(name: "floor", scope: !223, file: !223, line: 184, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !247, line: 294)
!247 = !DISubprogram(name: "fmod", scope: !223, file: !223, line: 187, type: !232, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !249, line: 315)
!249 = !DISubprogram(name: "frexp", scope: !223, file: !223, line: 103, type: !250, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!250 = !DISubroutineType(types: !251)
!251 = !{!171, !171, !97}
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !253, line: 334)
!253 = !DISubprogram(name: "ldexp", scope: !223, file: !223, line: 106, type: !254, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!254 = !DISubroutineType(types: !255)
!255 = !{!171, !171, !92}
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !257, line: 353)
!257 = !DISubprogram(name: "log", scope: !223, file: !223, line: 109, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !259, line: 372)
!259 = !DISubprogram(name: "log10", scope: !223, file: !223, line: 112, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !261, line: 391)
!261 = !DISubprogram(name: "modf", scope: !223, file: !223, line: 115, type: !262, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!262 = !DISubroutineType(types: !263)
!263 = !{!171, !171, !264}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!265 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !266, line: 403)
!266 = !DISubprogram(name: "pow", scope: !223, file: !223, line: 153, type: !232, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !268, line: 440)
!268 = !DISubprogram(name: "sin", scope: !223, file: !223, line: 65, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !270, line: 459)
!270 = !DISubprogram(name: "sinh", scope: !223, file: !223, line: 74, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !272, line: 478)
!272 = !DISubprogram(name: "sqrt", scope: !223, file: !223, line: 156, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !274, line: 497)
!274 = !DISubprogram(name: "tan", scope: !223, file: !223, line: 67, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!275 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !276, line: 516)
!276 = !DISubprogram(name: "tanh", scope: !223, file: !223, line: 76, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !278, line: 118)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !279, line: 101, baseType: !280)
!279 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!280 = !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 97, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !282, line: 119)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !279, line: 109, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 105, size: 128, elements: !284, identifier: "_ZTS6ldiv_t")
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !283, file: !279, line: 107, baseType: !131, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !283, file: !279, line: 108, baseType: !131, size: 64, offset: 64)
!287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !288, line: 121)
!288 = !DISubprogram(name: "abort", scope: !279, file: !279, line: 515, type: !289, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!289 = !DISubroutineType(types: !290)
!290 = !{null}
!291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !292, line: 122)
!292 = !DISubprogram(name: "abs", scope: !279, file: !279, line: 775, type: !293, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!293 = !DISubroutineType(types: !294)
!294 = !{!92, !92}
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !296, line: 123)
!296 = !DISubprogram(name: "atexit", scope: !279, file: !279, line: 519, type: !297, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!297 = !DISubroutineType(types: !298)
!298 = !{!92, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !301, line: 129)
!301 = !DISubprogram(name: "atof", scope: !302, file: !302, line: 26, type: !169, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!302 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !304, line: 130)
!304 = !DISubprogram(name: "atoi", scope: !279, file: !279, line: 278, type: !305, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!305 = !DISubroutineType(types: !306)
!306 = !{!92, !172}
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !308, line: 131)
!308 = !DISubprogram(name: "atol", scope: !279, file: !279, line: 283, type: !309, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!309 = !DISubroutineType(types: !310)
!310 = !{!131, !172}
!311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !312, line: 132)
!312 = !DISubprogram(name: "bsearch", scope: !313, file: !313, line: 20, type: !314, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!313 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!314 = !DISubroutineType(types: !315)
!315 = !{!21, !316, !316, !22, !22, !318}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !279, line: 742, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!92, !316, !316}
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !323, line: 133)
!323 = !DISubprogram(name: "calloc", scope: !279, file: !279, line: 468, type: !324, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!324 = !DISubroutineType(types: !325)
!325 = !{!21, !22, !22}
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !327, line: 134)
!327 = !DISubprogram(name: "div", scope: !279, file: !279, line: 789, type: !328, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!328 = !DISubroutineType(types: !329)
!329 = !{!278, !92, !92}
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !331, line: 135)
!331 = !DISubprogram(name: "exit", scope: !279, file: !279, line: 543, type: !332, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !92}
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !335, line: 136)
!335 = !DISubprogram(name: "free", scope: !279, file: !279, line: 483, type: !336, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !21}
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !339, line: 137)
!339 = !DISubprogram(name: "getenv", scope: !279, file: !279, line: 564, type: !340, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !172}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !344, line: 138)
!344 = !DISubprogram(name: "labs", scope: !279, file: !279, line: 776, type: !129, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !346, line: 139)
!346 = !DISubprogram(name: "ldiv", scope: !279, file: !279, line: 791, type: !347, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!347 = !DISubroutineType(types: !348)
!348 = !{!282, !131, !131}
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !350, line: 140)
!350 = !DISubprogram(name: "malloc", scope: !279, file: !279, line: 466, type: !351, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!351 = !DISubroutineType(types: !352)
!352 = !{!21, !22}
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !354, line: 142)
!354 = !DISubprogram(name: "mblen", scope: !279, file: !279, line: 863, type: !355, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!355 = !DISubroutineType(types: !356)
!356 = !{!92, !172, !22}
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !358, line: 143)
!358 = !DISubprogram(name: "mbstowcs", scope: !279, file: !279, line: 874, type: !359, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!359 = !DISubroutineType(types: !360)
!360 = !{!22, !361, !364, !22}
!361 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!364 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !172)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !366, line: 144)
!366 = !DISubprogram(name: "mbtowc", scope: !279, file: !279, line: 866, type: !367, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!367 = !DISubroutineType(types: !368)
!368 = !{!92, !361, !364, !22}
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !370, line: 146)
!370 = !DISubprogram(name: "qsort", scope: !279, file: !279, line: 765, type: !371, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !21, !22, !22, !318}
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !374, line: 152)
!374 = !DISubprogram(name: "rand", scope: !279, file: !279, line: 374, type: !375, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!375 = !DISubroutineType(types: !376)
!376 = !{!92}
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !378, line: 153)
!378 = !DISubprogram(name: "realloc", scope: !279, file: !279, line: 480, type: !379, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{!21, !21, !22}
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !382, line: 154)
!382 = !DISubprogram(name: "srand", scope: !279, file: !279, line: 376, type: !383, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !385}
!385 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !387, line: 155)
!387 = !DISubprogram(name: "strtod", scope: !279, file: !279, line: 164, type: !388, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{!171, !364, !390}
!390 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !393, line: 156)
!393 = !DISubprogram(name: "strtol", scope: !279, file: !279, line: 183, type: !394, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!394 = !DISubroutineType(types: !395)
!395 = !{!131, !364, !390, !92}
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !397, line: 157)
!397 = !DISubprogram(name: "strtoul", scope: !279, file: !279, line: 187, type: !398, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!398 = !DISubroutineType(types: !399)
!399 = !{!24, !364, !390, !92}
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !401, line: 158)
!401 = !DISubprogram(name: "system", scope: !279, file: !279, line: 717, type: !305, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !403, line: 160)
!403 = !DISubprogram(name: "wcstombs", scope: !279, file: !279, line: 877, type: !404, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!404 = !DISubroutineType(types: !405)
!405 = !{!22, !406, !407, !22}
!406 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !342)
!407 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !411, line: 161)
!411 = !DISubprogram(name: "wctomb", scope: !279, file: !279, line: 870, type: !412, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!412 = !DISubroutineType(types: !413)
!413 = !{!92, !342, !363}
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !415, entity: !417, line: 201)
!415 = !DINamespace(name: "__gnu_cxx", scope: null, file: !416, line: 68)
!416 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/bits/cpp_type_traits.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !279, line: 121, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 117, size: 128, elements: !419, identifier: "_ZTS7lldiv_t")
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !418, file: !279, line: 119, baseType: !33, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !418, file: !279, line: 120, baseType: !33, size: 64, offset: 64)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !415, entity: !423, line: 207)
!423 = !DISubprogram(name: "_Exit", scope: !279, file: !279, line: 557, type: !332, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !415, entity: !425, line: 211)
!425 = !DISubprogram(name: "llabs", scope: !279, file: !279, line: 780, type: !31, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !415, entity: !427, line: 217)
!427 = !DISubprogram(name: "lldiv", scope: !279, file: !279, line: 797, type: !428, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!428 = !DISubroutineType(types: !429)
!429 = !{!417, !33, !33}
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !415, entity: !431, line: 228)
!431 = !DISubprogram(name: "atoll", scope: !279, file: !279, line: 292, type: !432, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!432 = !DISubroutineType(types: !433)
!433 = !{!33, !172}
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !415, entity: !435, line: 229)
!435 = !DISubprogram(name: "strtoll", scope: !279, file: !279, line: 209, type: !436, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!436 = !DISubroutineType(types: !437)
!437 = !{!33, !364, !390, !92}
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !415, entity: !439, line: 230)
!439 = !DISubprogram(name: "strtoull", scope: !279, file: !279, line: 214, type: !440, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!440 = !DISubroutineType(types: !441)
!441 = !{!442, !364, !390, !92}
!442 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !415, entity: !444, line: 232)
!444 = !DISubprogram(name: "strtof", scope: !279, file: !279, line: 172, type: !445, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!445 = !DISubroutineType(types: !446)
!446 = !{!19, !364, !390}
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !415, entity: !448, line: 233)
!448 = !DISubprogram(name: "strtold", scope: !279, file: !279, line: 175, type: !449, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!449 = !DISubroutineType(types: !450)
!450 = !{!451, !364, !390}
!451 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !417, line: 241)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !423, line: 243)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !425, line: 245)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !456, line: 246)
!456 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !415, file: !457, line: 214, type: !428, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!457 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/cstdlib", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !427, line: 247)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !431, line: 249)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !444, line: 250)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !435, line: 251)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !439, line: 252)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !448, line: 253)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !465, line: 418)
!465 = !DISubprogram(name: "acosf", linkageName: "_ZL5acosff", scope: !466, file: !466, line: 1126, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!466 = !DIFile(filename: "/usr/local/cuda/include/math_functions.hpp", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !468, line: 419)
!468 = !DISubprogram(name: "acoshf", linkageName: "_ZL6acoshff", scope: !466, file: !466, line: 1154, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !470, line: 420)
!470 = !DISubprogram(name: "asinf", linkageName: "_ZL5asinff", scope: !466, file: !466, line: 1121, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !472, line: 421)
!472 = !DISubprogram(name: "asinhf", linkageName: "_ZL6asinhff", scope: !466, file: !466, line: 1159, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !474, line: 422)
!474 = !DISubprogram(name: "atan2f", linkageName: "_ZL6atan2fff", scope: !466, file: !466, line: 1111, type: !48, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !476, line: 423)
!476 = !DISubprogram(name: "atanf", linkageName: "_ZL5atanff", scope: !466, file: !466, line: 1116, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !478, line: 424)
!478 = !DISubprogram(name: "atanhf", linkageName: "_ZL6atanhff", scope: !466, file: !466, line: 1164, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !480, line: 425)
!480 = !DISubprogram(name: "cbrtf", linkageName: "_ZL5cbrtff", scope: !466, file: !466, line: 1199, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !482, line: 426)
!482 = !DISubprogram(name: "ceilf", linkageName: "_ZL5ceilff", scope: !483, file: !483, line: 647, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!483 = !DIFile(filename: "/usr/local/cuda/include/device_functions.hpp", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !485, line: 427)
!485 = !DISubprogram(name: "copysignf", linkageName: "_ZL9copysignfff", scope: !466, file: !466, line: 973, type: !48, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !487, line: 428)
!487 = !DISubprogram(name: "cosf", linkageName: "_ZL4cosff", scope: !466, file: !466, line: 1027, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !489, line: 429)
!489 = !DISubprogram(name: "coshf", linkageName: "_ZL5coshff", scope: !466, file: !466, line: 1096, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !491, line: 430)
!491 = !DISubprogram(name: "erfcf", linkageName: "_ZL5erfcff", scope: !466, file: !466, line: 1259, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !493, line: 431)
!493 = !DISubprogram(name: "erff", linkageName: "_ZL4erfff", scope: !466, file: !466, line: 1249, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !495, line: 432)
!495 = !DISubprogram(name: "exp2f", linkageName: "_ZL5exp2ff", scope: !483, file: !483, line: 637, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !497, line: 433)
!497 = !DISubprogram(name: "expf", linkageName: "_ZL4expff", scope: !466, file: !466, line: 1078, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !499, line: 434)
!499 = !DISubprogram(name: "expm1f", linkageName: "_ZL6expm1ff", scope: !466, file: !466, line: 1169, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !501, line: 435)
!501 = !DISubprogram(name: "fabsf", linkageName: "_ZL5fabsff", scope: !483, file: !483, line: 582, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !503, line: 436)
!503 = !DISubprogram(name: "fdimf", linkageName: "_ZL5fdimfff", scope: !466, file: !466, line: 1385, type: !48, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !505, line: 437)
!505 = !DISubprogram(name: "floorf", linkageName: "_ZL6floorff", scope: !483, file: !483, line: 572, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !507, line: 438)
!507 = !DISubprogram(name: "fmaf", linkageName: "_ZL4fmaffff", scope: !466, file: !466, line: 1337, type: !80, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !509, line: 439)
!509 = !DISubprogram(name: "fmaxf", linkageName: "_ZL5fmaxfff", scope: !483, file: !483, line: 602, type: !48, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !511, line: 440)
!511 = !DISubprogram(name: "fminf", linkageName: "_ZL5fminfff", scope: !483, file: !483, line: 597, type: !48, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !513, line: 441)
!513 = !DISubprogram(name: "fmodf", linkageName: "_ZL5fmodfff", scope: !466, file: !466, line: 1322, type: !48, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !515, line: 442)
!515 = !DISubprogram(name: "frexpf", linkageName: "_ZL6frexpffPi", scope: !466, file: !466, line: 1312, type: !95, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !517, line: 443)
!517 = !DISubprogram(name: "hypotf", linkageName: "_ZL6hypotfff", scope: !466, file: !466, line: 1174, type: !48, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !519, line: 444)
!519 = !DISubprogram(name: "ilogbf", linkageName: "_ZL6ilogbff", scope: !466, file: !466, line: 1390, type: !90, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !521, line: 445)
!521 = !DISubprogram(name: "ldexpf", linkageName: "_ZL6ldexpffi", scope: !466, file: !466, line: 1289, type: !134, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !523, line: 446)
!523 = !DISubprogram(name: "lgammaf", linkageName: "_ZL7lgammaff", scope: !466, file: !466, line: 1284, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !525, line: 447)
!525 = !DISubprogram(name: "llrintf", linkageName: "_ZL7llrintff", scope: !466, file: !466, line: 933, type: !142, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !527, line: 448)
!527 = !DISubprogram(name: "llroundf", linkageName: "_ZL8llroundff", scope: !466, file: !466, line: 1371, type: !142, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !529, line: 449)
!529 = !DISubprogram(name: "log10f", linkageName: "_ZL6log10ff", scope: !466, file: !466, line: 1140, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !531, line: 450)
!531 = !DISubprogram(name: "log1pf", linkageName: "_ZL6log1pff", scope: !466, file: !466, line: 1149, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !533, line: 451)
!533 = !DISubprogram(name: "log2f", linkageName: "_ZL5log2ff", scope: !466, file: !466, line: 1069, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !535, line: 452)
!535 = !DISubprogram(name: "logbf", linkageName: "_ZL5logbff", scope: !466, file: !466, line: 1395, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !537, line: 453)
!537 = !DISubprogram(name: "logf", linkageName: "_ZL4logff", scope: !466, file: !466, line: 1131, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !539, line: 454)
!539 = !DISubprogram(name: "lrintf", linkageName: "_ZL6lrintff", scope: !466, file: !466, line: 924, type: !156, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !541, line: 455)
!541 = !DISubprogram(name: "lroundf", linkageName: "_ZL7lroundff", scope: !466, file: !466, line: 1376, type: !156, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !543, line: 456)
!543 = !DISubprogram(name: "modff", linkageName: "_ZL5modfffPf", scope: !466, file: !466, line: 1317, type: !164, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !545, line: 457)
!545 = !DISubprogram(name: "nearbyintf", linkageName: "_ZL10nearbyintff", scope: !466, file: !466, line: 938, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !547, line: 458)
!547 = !DISubprogram(name: "nextafterf", linkageName: "_ZL10nextafterfff", scope: !466, file: !466, line: 1002, type: !48, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !549, line: 459)
!549 = !DISubprogram(name: "nexttowardf", scope: !223, file: !223, line: 284, type: !550, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!550 = !DISubroutineType(types: !551)
!551 = !{!19, !19, !451}
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !549, line: 460)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !554, line: 461)
!554 = !DISubprogram(name: "powf", linkageName: "_ZL4powfff", scope: !466, file: !466, line: 1352, type: !48, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !556, line: 462)
!556 = !DISubprogram(name: "remainderf", linkageName: "_ZL10remainderfff", scope: !466, file: !466, line: 1327, type: !48, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !558, line: 463)
!558 = !DISubprogram(name: "remquof", linkageName: "_ZL7remquofffPi", scope: !466, file: !466, line: 1332, type: !193, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !560, line: 464)
!560 = !DISubprogram(name: "rintf", linkageName: "_ZL5rintff", scope: !466, file: !466, line: 919, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !562, line: 465)
!562 = !DISubprogram(name: "roundf", linkageName: "_ZL6roundff", scope: !466, file: !466, line: 1366, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !564, line: 466)
!564 = !DISubprogram(name: "scalblnf", linkageName: "_ZL8scalblnffl", scope: !466, file: !466, line: 1299, type: !201, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !566, line: 467)
!566 = !DISubprogram(name: "scalbnf", linkageName: "_ZL7scalbnffi", scope: !466, file: !466, line: 1294, type: !134, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !568, line: 468)
!568 = !DISubprogram(name: "sinf", linkageName: "_ZL4sinff", scope: !466, file: !466, line: 1018, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !570, line: 469)
!570 = !DISubprogram(name: "sinhf", linkageName: "_ZL5sinhff", scope: !466, file: !466, line: 1101, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !572, line: 470)
!572 = !DISubprogram(name: "sqrtf", linkageName: "_ZL5sqrtff", scope: !483, file: !483, line: 887, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !574, line: 471)
!574 = !DISubprogram(name: "tanf", linkageName: "_ZL4tanff", scope: !466, file: !466, line: 1060, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !576, line: 472)
!576 = !DISubprogram(name: "tanhf", linkageName: "_ZL5tanhff", scope: !466, file: !466, line: 1106, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !578, line: 473)
!578 = !DISubprogram(name: "tgammaf", linkageName: "_ZL7tgammaff", scope: !466, file: !466, line: 1361, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !580, line: 474)
!580 = !DISubprogram(name: "truncf", linkageName: "_ZL6truncff", scope: !483, file: !483, line: 642, type: !36, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!581 = !{i32 2, !"Dwarf Version", i32 4}
!582 = !{i32 2, !"Debug Info Version", i32 3}
!583 = !{!"clang version 5.0.0 (trunk 294196)"}
!584 = distinct !DISubprogram(name: "rtclock", linkageName: "_Z7rtclockv", scope: !585, file: !585, line: 11, type: !586, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !588)
!585 = !DIFile(filename: "./../../common/polybenchUtilFuncts.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!586 = !DISubroutineType(types: !587)
!587 = !{!171}
!588 = !{!589, !595, !604}
!589 = !DILocalVariable(name: "Tzp", scope: !584, file: !585, line: 13, type: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !591, line: 55, size: 64, elements: !592, identifier: "_ZTS8timezone")
!591 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/time.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !590, file: !591, line: 57, baseType: !92, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !590, file: !591, line: 58, baseType: !92, size: 32, offset: 32)
!595 = !DILocalVariable(name: "Tp", scope: !584, file: !585, line: 14, type: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !597, line: 30, size: 128, elements: !598, identifier: "_ZTS7timeval")
!597 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!598 = !{!599, !602}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !596, file: !597, line: 32, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !601, line: 139, baseType: !131)
!601 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!602 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !596, file: !597, line: 33, baseType: !603, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !601, line: 141, baseType: !131)
!604 = !DILocalVariable(name: "stat", scope: !584, file: !585, line: 15, type: !92)
!605 = !DILocation(line: 13, column: 5, scope: !584)
!606 = !DILocation(line: 14, column: 5, scope: !584)
!607 = !DIExpression(DW_OP_deref)
!608 = !DILocation(line: 13, column: 21, scope: !584)
!609 = !DILocation(line: 14, column: 20, scope: !584)
!610 = !DILocation(line: 16, column: 12, scope: !584)
!611 = !DIExpression()
!612 = !DILocation(line: 15, column: 9, scope: !584)
!613 = !DILocation(line: 17, column: 14, scope: !614)
!614 = distinct !DILexicalBlock(scope: !584, file: !585, line: 17, column: 9)
!615 = !DILocation(line: 17, column: 9, scope: !584)
!616 = !DILocation(line: 17, column: 20, scope: !617)
!617 = !DILexicalBlockFile(scope: !614, file: !585, discriminator: 1)
!618 = !DILocation(line: 18, column: 15, scope: !584)
!619 = !{!620, !621, i64 0}
!620 = !{!"_ZTS7timeval", !621, i64 0, !621, i64 8}
!621 = !{!"long", !622, i64 0}
!622 = !{!"omnipotent char", !623, i64 0}
!623 = !{!"Simple C++ TBAA"}
!624 = !DILocation(line: 18, column: 12, scope: !584)
!625 = !DILocation(line: 18, column: 27, scope: !584)
!626 = !{!620, !621, i64 8}
!627 = !DILocation(line: 18, column: 24, scope: !584)
!628 = !DILocation(line: 18, column: 34, scope: !584)
!629 = !DILocation(line: 18, column: 22, scope: !584)
!630 = !DILocation(line: 19, column: 1, scope: !584)
!631 = !DILocation(line: 18, column: 5, scope: !584)
!632 = distinct !DISubprogram(name: "absVal", linkageName: "_Z6absValf", scope: !585, file: !585, line: 22, type: !36, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !633)
!633 = !{!634}
!634 = !DILocalVariable(name: "a", arg: 1, scope: !632, file: !585, line: 22, type: !19)
!635 = !DILocation(line: 22, column: 20, scope: !632)
!636 = !DILocation(line: 24, column: 7, scope: !637)
!637 = distinct !DILexicalBlock(scope: !632, file: !585, line: 24, column: 5)
!638 = !DILocation(line: 26, column: 13, scope: !639)
!639 = distinct !DILexicalBlock(scope: !637, file: !585, line: 25, column: 2)
!640 = !DILocation(line: 24, column: 5, scope: !632)
!641 = !DILocation(line: 32, column: 1, scope: !632)
!642 = distinct !DISubprogram(name: "percentDiff", linkageName: "_Z11percentDiffdd", scope: !585, file: !585, line: 36, type: !643, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !645)
!643 = !DISubroutineType(types: !644)
!644 = !{!19, !171, !171}
!645 = !{!646, !647}
!646 = !DILocalVariable(name: "val1", arg: 1, scope: !642, file: !585, line: 36, type: !171)
!647 = !DILocalVariable(name: "val2", arg: 2, scope: !642, file: !585, line: 36, type: !171)
!648 = !DILocation(line: 36, column: 26, scope: !642)
!649 = !DILocation(line: 36, column: 39, scope: !642)
!650 = !DILocation(line: 38, column: 14, scope: !651)
!651 = distinct !DILexicalBlock(scope: !642, file: !585, line: 38, column: 6)
!652 = !DILocation(line: 22, column: 20, scope: !632, inlinedAt: !653)
!653 = distinct !DILocation(line: 38, column: 7, scope: !651)
!654 = !DILocation(line: 24, column: 7, scope: !637, inlinedAt: !653)
!655 = !DILocation(line: 26, column: 13, scope: !639, inlinedAt: !653)
!656 = !DILocation(line: 24, column: 5, scope: !632, inlinedAt: !653)
!657 = !DILocation(line: 38, column: 7, scope: !651)
!658 = !DILocation(line: 38, column: 20, scope: !651)
!659 = !DILocation(line: 38, column: 28, scope: !651)
!660 = !DILocation(line: 38, column: 39, scope: !661)
!661 = !DILexicalBlockFile(scope: !651, file: !585, discriminator: 1)
!662 = !DILocation(line: 22, column: 20, scope: !632, inlinedAt: !663)
!663 = distinct !DILocation(line: 38, column: 32, scope: !661)
!664 = !DILocation(line: 24, column: 7, scope: !637, inlinedAt: !663)
!665 = !DILocation(line: 26, column: 13, scope: !639, inlinedAt: !663)
!666 = !DILocation(line: 24, column: 5, scope: !632, inlinedAt: !663)
!667 = !DILocation(line: 38, column: 32, scope: !661)
!668 = !DILocation(line: 38, column: 45, scope: !661)
!669 = !DILocation(line: 38, column: 6, scope: !670)
!670 = !DILexicalBlockFile(scope: !642, file: !585, discriminator: 1)
!671 = !DILocation(line: 45, column: 43, scope: !672)
!672 = distinct !DILexicalBlock(scope: !651, file: !585, line: 44, column: 2)
!673 = !DILocation(line: 45, column: 38, scope: !672)
!674 = !DILocation(line: 22, column: 20, scope: !632, inlinedAt: !675)
!675 = distinct !DILocation(line: 45, column: 31, scope: !672)
!676 = !DILocation(line: 24, column: 7, scope: !637, inlinedAt: !675)
!677 = !DILocation(line: 26, column: 13, scope: !639, inlinedAt: !675)
!678 = !DILocation(line: 24, column: 5, scope: !632, inlinedAt: !675)
!679 = !DILocation(line: 45, column: 65, scope: !672)
!680 = !DILocation(line: 45, column: 60, scope: !672)
!681 = !DILocation(line: 22, column: 20, scope: !632, inlinedAt: !682)
!682 = distinct !DILocation(line: 45, column: 53, scope: !683)
!683 = !DILexicalBlockFile(scope: !672, file: !585, discriminator: 1)
!684 = !DILocation(line: 24, column: 7, scope: !637, inlinedAt: !682)
!685 = !DILocation(line: 26, column: 13, scope: !639, inlinedAt: !682)
!686 = !DILocation(line: 24, column: 5, scope: !632, inlinedAt: !682)
!687 = !DILocation(line: 45, column: 51, scope: !672)
!688 = !DILocation(line: 22, column: 20, scope: !632, inlinedAt: !689)
!689 = distinct !DILocation(line: 45, column: 24, scope: !690)
!690 = !DILexicalBlockFile(scope: !672, file: !585, discriminator: 2)
!691 = !DILocation(line: 24, column: 7, scope: !637, inlinedAt: !689)
!692 = !DILocation(line: 26, column: 13, scope: !639, inlinedAt: !689)
!693 = !DILocation(line: 24, column: 5, scope: !632, inlinedAt: !689)
!694 = !DILocation(line: 45, column: 21, scope: !672)
!695 = !DILocation(line: 45, column: 7, scope: !672)
!696 = !DILocation(line: 47, column: 1, scope: !642)
!697 = distinct !DISubprogram(name: "init_arrays", linkageName: "_Z11init_arraysPfS_", scope: !1, file: !1, line: 42, type: !698, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !700)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !25, !25}
!700 = !{!701, !702, !703, !704}
!701 = !DILocalVariable(name: "A", arg: 1, scope: !697, file: !1, line: 42, type: !25)
!702 = !DILocalVariable(name: "C", arg: 2, scope: !697, file: !1, line: 42, type: !25)
!703 = !DILocalVariable(name: "i", scope: !697, file: !1, line: 44, type: !92)
!704 = !DILocalVariable(name: "j", scope: !697, file: !1, line: 44, type: !92)
!705 = !DILocation(line: 42, column: 29, scope: !697)
!706 = !DILocation(line: 42, column: 43, scope: !697)
!707 = !DILocation(line: 44, column: 6, scope: !697)
!708 = !DILocation(line: 46, column: 2, scope: !709)
!709 = !DILexicalBlockFile(scope: !710, file: !1, discriminator: 1)
!710 = distinct !DILexicalBlock(scope: !697, file: !1, line: 46, column: 2)
!711 = !DILocation(line: 44, column: 9, scope: !697)
!712 = !DILocation(line: 48, column: 3, scope: !713)
!713 = !DILexicalBlockFile(scope: !714, file: !1, discriminator: 1)
!714 = distinct !DILexicalBlock(scope: !715, file: !1, line: 48, column: 3)
!715 = distinct !DILexicalBlock(scope: !716, file: !1, line: 47, column: 6)
!716 = distinct !DILexicalBlock(scope: !710, file: !1, line: 46, column: 2)
!717 = !DILocation(line: 48, column: 23, scope: !718)
!718 = !DILexicalBlockFile(scope: !719, file: !1, discriminator: 2)
!719 = distinct !DILexicalBlock(scope: !714, file: !1, line: 48, column: 3)
!720 = !DILocation(line: 50, column: 32, scope: !721)
!721 = distinct !DILexicalBlock(scope: !719, file: !1, line: 49, column: 3)
!722 = !DILocation(line: 50, column: 31, scope: !721)
!723 = !DILocation(line: 50, column: 35, scope: !721)
!724 = !DILocation(line: 50, column: 10, scope: !721)
!725 = !DILocation(line: 50, column: 4, scope: !721)
!726 = !DILocation(line: 50, column: 15, scope: !721)
!727 = !{!728, !728, i64 0}
!728 = !{!"float", !622, i64 0}
!729 = distinct !{!729, !730, !731, !732, !733}
!730 = !DILocation(line: 48, column: 3, scope: !714)
!731 = !DILocation(line: 51, column: 3, scope: !714)
!732 = !{!"llvm.loop.vectorize.width", i32 1}
!733 = !{!"llvm.loop.interleave.count", i32 1}
!734 = !DILocation(line: 55, column: 32, scope: !735)
!735 = distinct !DILexicalBlock(scope: !736, file: !1, line: 54, column: 3)
!736 = distinct !DILexicalBlock(scope: !737, file: !1, line: 53, column: 3)
!737 = distinct !DILexicalBlock(scope: !715, file: !1, line: 53, column: 3)
!738 = !DILocation(line: 53, column: 23, scope: !739)
!739 = !DILexicalBlockFile(scope: !736, file: !1, discriminator: 2)
!740 = !DILocation(line: 55, column: 31, scope: !735)
!741 = !DILocation(line: 55, column: 34, scope: !735)
!742 = !DILocation(line: 55, column: 39, scope: !735)
!743 = !DILocation(line: 55, column: 10, scope: !735)
!744 = !DILocation(line: 55, column: 4, scope: !735)
!745 = !DILocation(line: 55, column: 15, scope: !735)
!746 = distinct !{!746, !747, !748, !732, !733}
!747 = !DILocation(line: 53, column: 3, scope: !737)
!748 = !DILocation(line: 56, column: 3, scope: !737)
!749 = !DILocation(line: 46, column: 22, scope: !750)
!750 = !DILexicalBlockFile(scope: !716, file: !1, discriminator: 2)
!751 = !DILocation(line: 46, column: 16, scope: !752)
!752 = !DILexicalBlockFile(scope: !716, file: !1, discriminator: 1)
!753 = distinct !{!753, !754, !755}
!754 = !DILocation(line: 46, column: 2, scope: !710)
!755 = !DILocation(line: 57, column: 2, scope: !710)
!756 = !DILocation(line: 58, column: 1, scope: !697)
!757 = distinct !DISubprogram(name: "syrk", linkageName: "_Z4syrkPfS_", scope: !1, file: !1, line: 61, type: !698, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !758)
!758 = !{!759, !760, !761, !762, !763}
!759 = !DILocalVariable(name: "A", arg: 1, scope: !757, file: !1, line: 61, type: !25)
!760 = !DILocalVariable(name: "C", arg: 2, scope: !757, file: !1, line: 61, type: !25)
!761 = !DILocalVariable(name: "i", scope: !757, file: !1, line: 63, type: !92)
!762 = !DILocalVariable(name: "j", scope: !757, file: !1, line: 63, type: !92)
!763 = !DILocalVariable(name: "k", scope: !757, file: !1, line: 63, type: !92)
!764 = !DILocation(line: 61, column: 22, scope: !757)
!765 = !DILocation(line: 61, column: 36, scope: !757)
!766 = !DILocation(line: 63, column: 6, scope: !757)
!767 = !DILocation(line: 66, column: 2, scope: !768)
!768 = !DILexicalBlockFile(scope: !769, file: !1, discriminator: 1)
!769 = distinct !DILexicalBlock(scope: !757, file: !1, line: 66, column: 2)
!770 = !DILocation(line: 63, column: 9, scope: !757)
!771 = !DILocation(line: 68, column: 3, scope: !772)
!772 = !DILexicalBlockFile(scope: !773, file: !1, discriminator: 1)
!773 = distinct !DILexicalBlock(scope: !774, file: !1, line: 68, column: 3)
!774 = distinct !DILexicalBlock(scope: !775, file: !1, line: 67, column: 2)
!775 = distinct !DILexicalBlock(scope: !769, file: !1, line: 66, column: 2)
!776 = !DILocation(line: 68, column: 23, scope: !777)
!777 = !DILexicalBlockFile(scope: !778, file: !1, discriminator: 2)
!778 = distinct !DILexicalBlock(scope: !773, file: !1, line: 68, column: 3)
!779 = !DILocation(line: 70, column: 10, scope: !780)
!780 = distinct !DILexicalBlock(scope: !778, file: !1, line: 69, column: 3)
!781 = !DILocation(line: 70, column: 4, scope: !780)
!782 = !DILocation(line: 70, column: 15, scope: !780)
!783 = distinct !{!783, !784, !785, !732, !733}
!784 = !DILocation(line: 68, column: 3, scope: !773)
!785 = !DILocation(line: 71, column: 3, scope: !773)
!786 = !DILocation(line: 66, column: 22, scope: !787)
!787 = !DILexicalBlockFile(scope: !775, file: !1, discriminator: 2)
!788 = !DILocation(line: 66, column: 16, scope: !789)
!789 = !DILexicalBlockFile(scope: !775, file: !1, discriminator: 1)
!790 = distinct !{!790, !791, !792}
!791 = !DILocation(line: 66, column: 2, scope: !769)
!792 = !DILocation(line: 72, column: 2, scope: !769)
!793 = !DILocation(line: 76, column: 3, scope: !794)
!794 = !DILexicalBlockFile(scope: !795, file: !1, discriminator: 1)
!795 = distinct !DILexicalBlock(scope: !796, file: !1, line: 76, column: 3)
!796 = distinct !DILexicalBlock(scope: !797, file: !1, line: 75, column: 2)
!797 = distinct !DILexicalBlock(scope: !798, file: !1, line: 74, column: 2)
!798 = distinct !DILexicalBlock(scope: !757, file: !1, line: 74, column: 2)
!799 = !DILocation(line: 63, column: 12, scope: !757)
!800 = !DILocation(line: 78, column: 4, scope: !801)
!801 = !DILexicalBlockFile(scope: !802, file: !1, discriminator: 1)
!802 = distinct !DILexicalBlock(scope: !803, file: !1, line: 78, column: 4)
!803 = distinct !DILexicalBlock(scope: !804, file: !1, line: 77, column: 3)
!804 = distinct !DILexicalBlock(scope: !795, file: !1, line: 76, column: 3)
!805 = !DILocation(line: 80, column: 16, scope: !806)
!806 = distinct !DILexicalBlock(scope: !807, file: !1, line: 79, column: 4)
!807 = distinct !DILexicalBlock(scope: !802, file: !1, line: 78, column: 4)
!808 = !DILocation(line: 80, column: 33, scope: !806)
!809 = !DILocation(line: 80, column: 27, scope: !806)
!810 = !DILocation(line: 80, column: 25, scope: !806)
!811 = !DILocation(line: 80, column: 46, scope: !806)
!812 = !DILocation(line: 80, column: 40, scope: !806)
!813 = !DILocation(line: 80, column: 38, scope: !806)
!814 = !DILocation(line: 78, column: 24, scope: !815)
!815 = !DILexicalBlockFile(scope: !807, file: !1, discriminator: 2)
!816 = !DILocation(line: 78, column: 18, scope: !817)
!817 = !DILexicalBlockFile(scope: !807, file: !1, discriminator: 1)
!818 = distinct !{!818, !819, !820}
!819 = !DILocation(line: 78, column: 4, scope: !802)
!820 = !DILocation(line: 81, column: 4, scope: !802)
!821 = !DILocation(line: 76, column: 23, scope: !822)
!822 = !DILexicalBlockFile(scope: !804, file: !1, discriminator: 2)
!823 = !DILocation(line: 76, column: 17, scope: !824)
!824 = !DILexicalBlockFile(scope: !804, file: !1, discriminator: 1)
!825 = distinct !{!825, !826, !827}
!826 = !DILocation(line: 76, column: 3, scope: !795)
!827 = !DILocation(line: 82, column: 3, scope: !795)
!828 = !DILocation(line: 74, column: 22, scope: !829)
!829 = !DILexicalBlockFile(scope: !797, file: !1, discriminator: 2)
!830 = !DILocation(line: 74, column: 16, scope: !831)
!831 = !DILexicalBlockFile(scope: !797, file: !1, discriminator: 1)
!832 = !DILocation(line: 74, column: 2, scope: !833)
!833 = !DILexicalBlockFile(scope: !798, file: !1, discriminator: 1)
!834 = distinct !{!834, !835, !836}
!835 = !DILocation(line: 74, column: 2, scope: !798)
!836 = !DILocation(line: 83, column: 2, scope: !798)
!837 = !DILocation(line: 84, column: 1, scope: !757)
!838 = distinct !DISubprogram(name: "compareResults", linkageName: "_Z14compareResultsPfS_", scope: !1, file: !1, line: 87, type: !698, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !839)
!839 = !{!840, !841, !842, !843, !844}
!840 = !DILocalVariable(name: "C", arg: 1, scope: !838, file: !1, line: 87, type: !25)
!841 = !DILocalVariable(name: "C_outputFromGpu", arg: 2, scope: !838, file: !1, line: 87, type: !25)
!842 = !DILocalVariable(name: "i", scope: !838, file: !1, line: 89, type: !92)
!843 = !DILocalVariable(name: "j", scope: !838, file: !1, line: 89, type: !92)
!844 = !DILocalVariable(name: "fail", scope: !838, file: !1, line: 89, type: !92)
!845 = !DILocation(line: 87, column: 32, scope: !838)
!846 = !DILocation(line: 87, column: 46, scope: !838)
!847 = !DILocation(line: 89, column: 10, scope: !838)
!848 = !DILocation(line: 89, column: 6, scope: !838)
!849 = !DILocation(line: 93, column: 2, scope: !850)
!850 = !DILexicalBlockFile(scope: !851, file: !1, discriminator: 1)
!851 = distinct !DILexicalBlock(scope: !838, file: !1, line: 93, column: 2)
!852 = !DILocation(line: 89, column: 8, scope: !838)
!853 = !DILocation(line: 95, column: 3, scope: !854)
!854 = !DILexicalBlockFile(scope: !855, file: !1, discriminator: 1)
!855 = distinct !DILexicalBlock(scope: !856, file: !1, line: 95, column: 3)
!856 = distinct !DILexicalBlock(scope: !857, file: !1, line: 94, column: 2)
!857 = distinct !DILexicalBlock(scope: !851, file: !1, line: 93, column: 2)
!858 = !DILocation(line: 95, column: 19, scope: !859)
!859 = !DILexicalBlockFile(scope: !860, file: !1, discriminator: 2)
!860 = distinct !DILexicalBlock(scope: !855, file: !1, line: 95, column: 3)
!861 = !DILocation(line: 97, column: 26, scope: !862)
!862 = distinct !DILexicalBlock(scope: !863, file: !1, line: 97, column: 8)
!863 = distinct !DILexicalBlock(scope: !860, file: !1, line: 96, column: 3)
!864 = !DILocation(line: 97, column: 20, scope: !862)
!865 = !DILocation(line: 97, column: 32, scope: !862)
!866 = !DILocation(line: 24, column: 7, scope: !637, inlinedAt: !867)
!867 = distinct !DILocation(line: 38, column: 7, scope: !651, inlinedAt: !868)
!868 = distinct !DILocation(line: 97, column: 8, scope: !862)
!869 = !DILocation(line: 26, column: 13, scope: !639, inlinedAt: !867)
!870 = !DILocation(line: 24, column: 5, scope: !632, inlinedAt: !867)
!871 = !DILocation(line: 38, column: 7, scope: !651, inlinedAt: !868)
!872 = !DILocation(line: 38, column: 20, scope: !651, inlinedAt: !868)
!873 = !DILocation(line: 24, column: 7, scope: !637, inlinedAt: !874)
!874 = distinct !DILocation(line: 38, column: 32, scope: !661, inlinedAt: !868)
!875 = !DILocation(line: 26, column: 13, scope: !639, inlinedAt: !874)
!876 = !DILocation(line: 24, column: 5, scope: !632, inlinedAt: !874)
!877 = !DILocation(line: 38, column: 32, scope: !661, inlinedAt: !868)
!878 = !DILocation(line: 38, column: 45, scope: !661, inlinedAt: !868)
!879 = !DILocation(line: 45, column: 38, scope: !672, inlinedAt: !868)
!880 = !DILocation(line: 24, column: 7, scope: !637, inlinedAt: !881)
!881 = distinct !DILocation(line: 45, column: 31, scope: !672, inlinedAt: !868)
!882 = !DILocation(line: 26, column: 13, scope: !639, inlinedAt: !881)
!883 = !DILocation(line: 24, column: 5, scope: !632, inlinedAt: !881)
!884 = !DILocation(line: 45, column: 60, scope: !672, inlinedAt: !868)
!885 = !DILocation(line: 24, column: 7, scope: !637, inlinedAt: !886)
!886 = distinct !DILocation(line: 45, column: 53, scope: !683, inlinedAt: !868)
!887 = !DILocation(line: 26, column: 13, scope: !639, inlinedAt: !886)
!888 = !DILocation(line: 24, column: 5, scope: !632, inlinedAt: !886)
!889 = !DILocation(line: 45, column: 51, scope: !672, inlinedAt: !868)
!890 = !DILocation(line: 24, column: 7, scope: !637, inlinedAt: !891)
!891 = distinct !DILocation(line: 45, column: 24, scope: !690, inlinedAt: !868)
!892 = !DILocation(line: 26, column: 13, scope: !639, inlinedAt: !891)
!893 = !DILocation(line: 24, column: 5, scope: !632, inlinedAt: !891)
!894 = !DILocation(line: 45, column: 21, scope: !672, inlinedAt: !868)
!895 = !DILocation(line: 97, column: 8, scope: !862)
!896 = !DILocation(line: 97, column: 58, scope: !862)
!897 = !DILocation(line: 97, column: 8, scope: !863)
!898 = distinct !{!898, !899, !900, !732, !733}
!899 = !DILocation(line: 95, column: 3, scope: !855)
!900 = !DILocation(line: 101, column: 3, scope: !855)
!901 = !DILocation(line: 93, column: 18, scope: !902)
!902 = !DILexicalBlockFile(scope: !857, file: !1, discriminator: 2)
!903 = !DILocation(line: 93, column: 13, scope: !904)
!904 = !DILexicalBlockFile(scope: !857, file: !1, discriminator: 1)
!905 = distinct !{!905, !906, !907}
!906 = !DILocation(line: 93, column: 2, scope: !851)
!907 = !DILocation(line: 102, column: 2, scope: !851)
!908 = !DILocation(line: 105, column: 2, scope: !838)
!909 = !DILocation(line: 106, column: 1, scope: !838)
!910 = distinct !DISubprogram(name: "GPU_argv_init", linkageName: "_Z13GPU_argv_initv", scope: !1, file: !1, line: 109, type: !289, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !911)
!911 = !{!912}
!912 = !DILocalVariable(name: "deviceProp", scope: !910, file: !1, line: 111, type: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cudaDeviceProp", file: !4, line: 1257, size: 5056, elements: !914, identifier: "_ZTS14cudaDeviceProp")
!914 = !{!915, !919, !920, !921, !922, !923, !924, !925, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !913, file: !4, line: 1259, baseType: !916, size: 2048)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 2048, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "totalGlobalMem", scope: !913, file: !4, line: 1260, baseType: !22, size: 64, offset: 2048)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerBlock", scope: !913, file: !4, line: 1261, baseType: !22, size: 64, offset: 2112)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerBlock", scope: !913, file: !4, line: 1262, baseType: !92, size: 32, offset: 2176)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "warpSize", scope: !913, file: !4, line: 1263, baseType: !92, size: 32, offset: 2208)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "memPitch", scope: !913, file: !4, line: 1264, baseType: !22, size: 64, offset: 2240)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerBlock", scope: !913, file: !4, line: 1265, baseType: !92, size: 32, offset: 2304)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsDim", scope: !913, file: !4, line: 1266, baseType: !926, size: 96, offset: 2336)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 96, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 3)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "maxGridSize", scope: !913, file: !4, line: 1267, baseType: !926, size: 96, offset: 2432)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "clockRate", scope: !913, file: !4, line: 1268, baseType: !92, size: 32, offset: 2528)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "totalConstMem", scope: !913, file: !4, line: 1269, baseType: !22, size: 64, offset: 2560)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !913, file: !4, line: 1270, baseType: !92, size: 32, offset: 2624)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !913, file: !4, line: 1271, baseType: !92, size: 32, offset: 2656)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "textureAlignment", scope: !913, file: !4, line: 1272, baseType: !22, size: 64, offset: 2688)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "texturePitchAlignment", scope: !913, file: !4, line: 1273, baseType: !22, size: 64, offset: 2752)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "deviceOverlap", scope: !913, file: !4, line: 1274, baseType: !92, size: 32, offset: 2816)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "multiProcessorCount", scope: !913, file: !4, line: 1275, baseType: !92, size: 32, offset: 2848)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "kernelExecTimeoutEnabled", scope: !913, file: !4, line: 1276, baseType: !92, size: 32, offset: 2880)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "integrated", scope: !913, file: !4, line: 1277, baseType: !92, size: 32, offset: 2912)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "canMapHostMemory", scope: !913, file: !4, line: 1278, baseType: !92, size: 32, offset: 2944)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "computeMode", scope: !913, file: !4, line: 1279, baseType: !92, size: 32, offset: 2976)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1D", scope: !913, file: !4, line: 1280, baseType: !92, size: 32, offset: 3008)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DMipmap", scope: !913, file: !4, line: 1281, baseType: !92, size: 32, offset: 3040)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLinear", scope: !913, file: !4, line: 1282, baseType: !92, size: 32, offset: 3072)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2D", scope: !913, file: !4, line: 1283, baseType: !946, size: 64, offset: 3104)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 64, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 2)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DMipmap", scope: !913, file: !4, line: 1284, baseType: !946, size: 64, offset: 3168)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLinear", scope: !913, file: !4, line: 1285, baseType: !926, size: 96, offset: 3232)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DGather", scope: !913, file: !4, line: 1286, baseType: !946, size: 64, offset: 3328)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3D", scope: !913, file: !4, line: 1287, baseType: !926, size: 96, offset: 3392)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3DAlt", scope: !913, file: !4, line: 1288, baseType: !926, size: 96, offset: 3488)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemap", scope: !913, file: !4, line: 1289, baseType: !92, size: 32, offset: 3584)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLayered", scope: !913, file: !4, line: 1290, baseType: !946, size: 64, offset: 3616)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLayered", scope: !913, file: !4, line: 1291, baseType: !926, size: 96, offset: 3680)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemapLayered", scope: !913, file: !4, line: 1292, baseType: !946, size: 64, offset: 3776)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1D", scope: !913, file: !4, line: 1293, baseType: !92, size: 32, offset: 3840)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2D", scope: !913, file: !4, line: 1294, baseType: !946, size: 64, offset: 3872)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface3D", scope: !913, file: !4, line: 1295, baseType: !926, size: 96, offset: 3936)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1DLayered", scope: !913, file: !4, line: 1296, baseType: !946, size: 64, offset: 4032)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2DLayered", scope: !913, file: !4, line: 1297, baseType: !926, size: 96, offset: 4096)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemap", scope: !913, file: !4, line: 1298, baseType: !92, size: 32, offset: 4192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemapLayered", scope: !913, file: !4, line: 1299, baseType: !946, size: 64, offset: 4224)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceAlignment", scope: !913, file: !4, line: 1300, baseType: !22, size: 64, offset: 4288)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "concurrentKernels", scope: !913, file: !4, line: 1301, baseType: !92, size: 32, offset: 4352)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ECCEnabled", scope: !913, file: !4, line: 1302, baseType: !92, size: 32, offset: 4384)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pciBusID", scope: !913, file: !4, line: 1303, baseType: !92, size: 32, offset: 4416)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pciDeviceID", scope: !913, file: !4, line: 1304, baseType: !92, size: 32, offset: 4448)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "pciDomainID", scope: !913, file: !4, line: 1305, baseType: !92, size: 32, offset: 4480)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "tccDriver", scope: !913, file: !4, line: 1306, baseType: !92, size: 32, offset: 4512)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "asyncEngineCount", scope: !913, file: !4, line: 1307, baseType: !92, size: 32, offset: 4544)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "unifiedAddressing", scope: !913, file: !4, line: 1308, baseType: !92, size: 32, offset: 4576)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "memoryClockRate", scope: !913, file: !4, line: 1309, baseType: !92, size: 32, offset: 4608)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "memoryBusWidth", scope: !913, file: !4, line: 1310, baseType: !92, size: 32, offset: 4640)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "l2CacheSize", scope: !913, file: !4, line: 1311, baseType: !92, size: 32, offset: 4672)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerMultiProcessor", scope: !913, file: !4, line: 1312, baseType: !92, size: 32, offset: 4704)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "streamPrioritiesSupported", scope: !913, file: !4, line: 1313, baseType: !92, size: 32, offset: 4736)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "globalL1CacheSupported", scope: !913, file: !4, line: 1314, baseType: !92, size: 32, offset: 4768)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "localL1CacheSupported", scope: !913, file: !4, line: 1315, baseType: !92, size: 32, offset: 4800)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerMultiprocessor", scope: !913, file: !4, line: 1316, baseType: !22, size: 64, offset: 4864)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerMultiprocessor", scope: !913, file: !4, line: 1317, baseType: !92, size: 32, offset: 4928)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "managedMemory", scope: !913, file: !4, line: 1318, baseType: !92, size: 32, offset: 4960)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "isMultiGpuBoard", scope: !913, file: !4, line: 1319, baseType: !92, size: 32, offset: 4992)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "multiGpuBoardGroupID", scope: !913, file: !4, line: 1320, baseType: !92, size: 32, offset: 5024)
!986 = !DILocation(line: 111, column: 2, scope: !910)
!987 = !DILocation(line: 111, column: 17, scope: !910)
!988 = !DILocation(line: 112, column: 2, scope: !910)
!989 = !DILocation(line: 113, column: 2, scope: !910)
!990 = !DILocation(line: 114, column: 2, scope: !910)
!991 = !DILocation(line: 117, column: 1, scope: !910)
!992 = distinct !DISubprogram(name: "syrk_kernel", linkageName: "_Z11syrk_kernelffPfS_", scope: !1, file: !1, line: 120, type: !993, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !995)
!993 = !DISubroutineType(types: !994)
!994 = !{null, !18, !18, !25, !25}
!995 = !{!996, !997, !998, !999}
!996 = !DILocalVariable(name: "ALPHA", arg: 1, scope: !992, file: !1, line: 120, type: !18)
!997 = !DILocalVariable(name: "BETA", arg: 2, scope: !992, file: !1, line: 120, type: !18)
!998 = !DILocalVariable(name: "a", arg: 3, scope: !992, file: !1, line: 120, type: !25)
!999 = !DILocalVariable(name: "c", arg: 4, scope: !992, file: !1, line: 120, type: !25)
!1000 = !DILocation(line: 120, column: 39, scope: !992)
!1001 = !DILocation(line: 120, column: 56, scope: !992)
!1002 = !DILocation(line: 120, column: 73, scope: !992)
!1003 = !{!1004, !1004, i64 0}
!1004 = !{!"any pointer", !622, i64 0}
!1005 = !DILocation(line: 120, column: 87, scope: !992)
!1006 = !DILocation(line: 121, column: 1, scope: !992)
!1007 = !DILocation(line: 121, column: 1, scope: !1008)
!1008 = !DILexicalBlockFile(scope: !992, file: !1, discriminator: 1)
!1009 = !DILocation(line: 121, column: 1, scope: !1010)
!1010 = !DILexicalBlockFile(scope: !992, file: !1, discriminator: 2)
!1011 = !DILocation(line: 121, column: 1, scope: !1012)
!1012 = !DILexicalBlockFile(scope: !992, file: !1, discriminator: 3)
!1013 = !DILocation(line: 121, column: 1, scope: !1014)
!1014 = !DILexicalBlockFile(scope: !992, file: !1, discriminator: 4)
!1015 = !DILocation(line: 135, column: 1, scope: !992)
!1016 = distinct !DISubprogram(name: "syrkCuda", linkageName: "_Z8syrkCudaPfS_S_", scope: !1, file: !1, line: 138, type: !1017, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1019)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !25, !25, !25}
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1051}
!1020 = !DILocalVariable(name: "A", arg: 1, scope: !1016, file: !1, line: 138, type: !25)
!1021 = !DILocalVariable(name: "C", arg: 2, scope: !1016, file: !1, line: 138, type: !25)
!1022 = !DILocalVariable(name: "C_outputFromGpu", arg: 3, scope: !1016, file: !1, line: 138, type: !25)
!1023 = !DILocalVariable(name: "t_start", scope: !1016, file: !1, line: 140, type: !171)
!1024 = !DILocalVariable(name: "t_end", scope: !1016, file: !1, line: 140, type: !171)
!1025 = !DILocalVariable(name: "A_gpu", scope: !1016, file: !1, line: 142, type: !25)
!1026 = !DILocalVariable(name: "C_gpu", scope: !1016, file: !1, line: 143, type: !25)
!1027 = !DILocalVariable(name: "block", scope: !1016, file: !1, line: 150, type: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "dim3", file: !1029, line: 427, baseType: !1030)
!1029 = !DIFile(filename: "/usr/local/cuda/include/vector_types.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syrkllvm")
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dim3", file: !1029, line: 417, size: 96, elements: !1031, identifier: "_ZTS4dim3")
!1031 = !{!1032, !1033, !1034, !1035, !1039, !1048}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1030, file: !1029, line: 419, baseType: !385, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1030, file: !1029, line: 419, baseType: !385, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !1030, file: !1029, line: 419, baseType: !385, size: 32, offset: 64)
!1035 = !DISubprogram(name: "dim3", scope: !1030, file: !1029, line: 421, type: !1036, isLocal: false, isDefinition: false, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{null, !1038, !385, !385, !385}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1039 = !DISubprogram(name: "dim3", scope: !1030, file: !1029, line: 422, type: !1040, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{null, !1038, !1042}
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1029, line: 383, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uint3", file: !1029, line: 190, size: 96, elements: !1044, identifier: "_ZTS5uint3")
!1044 = !{!1045, !1046, !1047}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1043, file: !1029, line: 192, baseType: !385, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1043, file: !1029, line: 192, baseType: !385, size: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !1043, file: !1029, line: 192, baseType: !385, size: 32, offset: 64)
!1048 = !DISubprogram(name: "operator uint3", linkageName: "_ZN4dim3cv5uint3Ev", scope: !1030, file: !1029, line: 423, type: !1049, isLocal: false, isDefinition: false, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!1042, !1038}
!1051 = !DILocalVariable(name: "grid", scope: !1016, file: !1, line: 151, type: !1028)
!1052 = !DILocation(line: 138, column: 26, scope: !1016)
!1053 = !DILocation(line: 138, column: 40, scope: !1016)
!1054 = !DILocation(line: 138, column: 54, scope: !1016)
!1055 = !DILocation(line: 142, column: 2, scope: !1016)
!1056 = !DILocation(line: 143, column: 2, scope: !1016)
!1057 = !DILocation(line: 145, column: 13, scope: !1016)
!1058 = !DILocation(line: 145, column: 2, scope: !1016)
!1059 = !DILocation(line: 146, column: 13, scope: !1016)
!1060 = !DILocation(line: 146, column: 2, scope: !1016)
!1061 = !DILocation(line: 147, column: 13, scope: !1016)
!1062 = !DILocation(line: 147, column: 20, scope: !1016)
!1063 = !DILocation(line: 147, column: 2, scope: !1016)
!1064 = !DILocation(line: 148, column: 13, scope: !1016)
!1065 = !DILocation(line: 148, column: 20, scope: !1016)
!1066 = !DILocation(line: 148, column: 2, scope: !1016)
!1067 = !DILocation(line: 150, column: 7, scope: !1016)
!1068 = !DILocation(line: 151, column: 7, scope: !1016)
!1069 = !DILocation(line: 153, column: 2, scope: !1016)
!1070 = !DILocation(line: 155, column: 9, scope: !1016)
!1071 = !DILocation(line: 158, column: 2, scope: !1016)
!1072 = !DILocation(line: 13, column: 5, scope: !584, inlinedAt: !1073)
!1073 = distinct !DILocation(line: 159, column: 12, scope: !1016)
!1074 = !DILocation(line: 14, column: 5, scope: !584, inlinedAt: !1073)
!1075 = !DILocation(line: 13, column: 21, scope: !584, inlinedAt: !1073)
!1076 = !DILocation(line: 14, column: 20, scope: !584, inlinedAt: !1073)
!1077 = !DILocation(line: 16, column: 12, scope: !584, inlinedAt: !1073)
!1078 = !DILocation(line: 15, column: 9, scope: !584, inlinedAt: !1073)
!1079 = !DILocation(line: 17, column: 14, scope: !614, inlinedAt: !1073)
!1080 = !DILocation(line: 17, column: 9, scope: !584, inlinedAt: !1073)
!1081 = !DILocation(line: 17, column: 20, scope: !617, inlinedAt: !1073)
!1082 = !DILocation(line: 18, column: 15, scope: !584, inlinedAt: !1073)
!1083 = !DILocation(line: 18, column: 12, scope: !584, inlinedAt: !1073)
!1084 = !DILocation(line: 18, column: 27, scope: !584, inlinedAt: !1073)
!1085 = !DILocation(line: 18, column: 24, scope: !584, inlinedAt: !1073)
!1086 = !DILocation(line: 18, column: 34, scope: !584, inlinedAt: !1073)
!1087 = !DILocation(line: 18, column: 22, scope: !584, inlinedAt: !1073)
!1088 = !DILocation(line: 19, column: 1, scope: !584, inlinedAt: !1073)
!1089 = !DILocation(line: 140, column: 9, scope: !1016)
!1090 = !DILocation(line: 160, column: 13, scope: !1016)
!1091 = !DILocation(line: 160, column: 2, scope: !1016)
!1092 = !DILocation(line: 160, column: 43, scope: !1093)
!1093 = !DILexicalBlockFile(scope: !1016, file: !1, discriminator: 1)
!1094 = !DILocation(line: 142, column: 13, scope: !1016)
!1095 = !DILocation(line: 160, column: 49, scope: !1093)
!1096 = !DILocation(line: 143, column: 13, scope: !1016)
!1097 = !DILocation(line: 160, column: 2, scope: !1093)
!1098 = !DILocation(line: 161, column: 2, scope: !1016)
!1099 = !DILocation(line: 13, column: 5, scope: !584, inlinedAt: !1100)
!1100 = distinct !DILocation(line: 162, column: 10, scope: !1016)
!1101 = !DILocation(line: 14, column: 5, scope: !584, inlinedAt: !1100)
!1102 = !DILocation(line: 13, column: 21, scope: !584, inlinedAt: !1100)
!1103 = !DILocation(line: 14, column: 20, scope: !584, inlinedAt: !1100)
!1104 = !DILocation(line: 16, column: 12, scope: !584, inlinedAt: !1100)
!1105 = !DILocation(line: 15, column: 9, scope: !584, inlinedAt: !1100)
!1106 = !DILocation(line: 17, column: 14, scope: !614, inlinedAt: !1100)
