; ModuleID = '<stdin>'
source_filename = "main.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.dim_str = type { i32, i32, i32, i32, i64, i64, i64, i64, i64 }
%struct.par_str = type { double }
%struct.box_str = type { i32, i32, i32, i32, i64, i32, [26 x %struct.nei_str] }
%struct.nei_str = type { i32, i32, i32, i32, i64 }
%struct.FOUR_VECTOR = type { double, double, double, double }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [35 x i8] c"thread block size of kernel = %d \0A\00", align 1
@.str.1 = private unnamed_addr constant [9 x i8] c"-boxes1d\00", align 1
@.str.6 = private unnamed_addr constant [34 x i8] c"Configuration used: boxes1d = %d\0A\00", align 1
@.str.7 = private unnamed_addr constant [11 x i8] c"result.txt\00", align 1
@.str.8 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.9 = private unnamed_addr constant [16 x i8] c"%f, %f, %f, %f\0A\00", align 1
@str = private unnamed_addr constant [25 x i8] c"ERROR: Unknown parameter\00"
@str.11 = private unnamed_addr constant [51 x i8] c"ERROR: Value to -boxes1d parameter in not a number\00"

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 5.0.0 (trunk 294196)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "main.c", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/lavaMDllvm")
!2 = !{}
!3 = !{!4, !7, !9, !12, !15, !40, !49, !21, !50, !52}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !5, line: 62, baseType: !6)
!5 = !DIFile(filename: "/home/dshen/llvm/build/bin/../lib/clang/5.0.0/include/stddef.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/lavaMDllvm")
!6 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!11 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "box_str", file: !17, line: 64, baseType: !18)
!17 = !DIFile(filename: "././main.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/lavaMDllvm")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "box_str", file: !17, line: 52, size: 5248, elements: !19)
!19 = !{!20, !22, !23, !24, !25, !27, !28}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !18, file: !17, line: 56, baseType: !21, size: 32)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !18, file: !17, line: 56, baseType: !21, size: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !18, file: !17, line: 56, baseType: !21, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !18, file: !17, line: 57, baseType: !21, size: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !18, file: !17, line: 58, baseType: !26, size: 64, offset: 128)
!26 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "nn", scope: !18, file: !17, line: 61, baseType: !21, size: 32, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "nei", scope: !18, file: !17, line: 62, baseType: !29, size: 4992, offset: 256)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 4992, elements: !38)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "nei_str", file: !17, line: 50, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nei_str", file: !17, line: 42, size: 192, elements: !32)
!32 = !{!33, !34, !35, !36, !37}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !17, line: 46, baseType: !21, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !17, line: 46, baseType: !21, size: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !31, file: !17, line: 46, baseType: !21, size: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !31, file: !17, line: 47, baseType: !21, size: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !31, file: !17, line: 48, baseType: !26, size: 64, offset: 128)
!38 = !{!39}
!39 = !DISubrange(count: 26)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "FOUR_VECTOR", file: !17, line: 40, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 36, size: 256, elements: !43)
!43 = !{!44, !46, !47, !48}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !42, file: !17, line: 38, baseType: !45, size: 64)
!45 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !42, file: !17, line: 38, baseType: !45, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !42, file: !17, line: 38, baseType: !45, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !42, file: !17, line: 38, baseType: !45, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!53 = !{i32 2, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{!"clang version 5.0.0 (trunk 294196)"}
!56 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 49, type: !57, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !59)
!57 = !DISubroutineType(types: !58)
!58 = !{!21, !21, !50}
!59 = !{!60, !61, !62, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !82, !95, !96, !97, !98, !99, !100, !106, !107, !109, !110}
!60 = !DILocalVariable(name: "argc", arg: 1, scope: !56, file: !1, line: 49, type: !21)
!61 = !DILocalVariable(name: "argv", arg: 2, scope: !56, file: !1, line: 50, type: !50)
!62 = !DILocalVariable(name: "time0", scope: !56, file: !1, line: 59, type: !63)
!63 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!64 = !DILocalVariable(name: "time1", scope: !56, file: !1, line: 64, type: !63)
!65 = !DILocalVariable(name: "time2", scope: !56, file: !1, line: 65, type: !63)
!66 = !DILocalVariable(name: "time3", scope: !56, file: !1, line: 66, type: !63)
!67 = !DILocalVariable(name: "time4", scope: !56, file: !1, line: 67, type: !63)
!68 = !DILocalVariable(name: "time5", scope: !56, file: !1, line: 68, type: !63)
!69 = !DILocalVariable(name: "time6", scope: !56, file: !1, line: 69, type: !63)
!70 = !DILocalVariable(name: "time7", scope: !56, file: !1, line: 70, type: !63)
!71 = !DILocalVariable(name: "i", scope: !56, file: !1, line: 73, type: !21)
!72 = !DILocalVariable(name: "j", scope: !56, file: !1, line: 73, type: !21)
!73 = !DILocalVariable(name: "k", scope: !56, file: !1, line: 73, type: !21)
!74 = !DILocalVariable(name: "l", scope: !56, file: !1, line: 73, type: !21)
!75 = !DILocalVariable(name: "m", scope: !56, file: !1, line: 73, type: !21)
!76 = !DILocalVariable(name: "n", scope: !56, file: !1, line: 73, type: !21)
!77 = !DILocalVariable(name: "par_cpu", scope: !56, file: !1, line: 76, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "par_str", file: !17, line: 71, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "par_str", file: !17, line: 66, size: 64, elements: !80)
!80 = !{!81}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !79, file: !17, line: 69, baseType: !45, size: 64)
!82 = !DILocalVariable(name: "dim_cpu", scope: !56, file: !1, line: 77, type: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "dim_str", file: !17, line: 89, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dim_str", file: !17, line: 73, size: 448, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cur_arg", scope: !84, file: !17, line: 77, baseType: !21, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "arch_arg", scope: !84, file: !17, line: 78, baseType: !21, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "cores_arg", scope: !84, file: !17, line: 79, baseType: !21, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "boxes1d_arg", scope: !84, file: !17, line: 80, baseType: !21, size: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "number_boxes", scope: !84, file: !17, line: 83, baseType: !26, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "box_mem", scope: !84, file: !17, line: 84, baseType: !26, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "space_elem", scope: !84, file: !17, line: 85, baseType: !26, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "space_mem", scope: !84, file: !17, line: 86, baseType: !26, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "space_mem2", scope: !84, file: !17, line: 87, baseType: !26, size: 64, offset: 384)
!95 = !DILocalVariable(name: "box_cpu", scope: !56, file: !1, line: 78, type: !15)
!96 = !DILocalVariable(name: "rv_cpu", scope: !56, file: !1, line: 79, type: !40)
!97 = !DILocalVariable(name: "qv_cpu", scope: !56, file: !1, line: 80, type: !49)
!98 = !DILocalVariable(name: "fv_cpu", scope: !56, file: !1, line: 81, type: !40)
!99 = !DILocalVariable(name: "nh", scope: !56, file: !1, line: 82, type: !21)
!100 = !DILocalVariable(name: "__s1_len", scope: !101, file: !1, line: 96, type: !4)
!101 = distinct !DILexicalBlock(scope: !102, file: !1, line: 96, column: 6)
!102 = distinct !DILexicalBlock(scope: !103, file: !1, line: 96, column: 6)
!103 = distinct !DILexicalBlock(scope: !104, file: !1, line: 94, column: 65)
!104 = distinct !DILexicalBlock(scope: !105, file: !1, line: 94, column: 2)
!105 = distinct !DILexicalBlock(scope: !56, file: !1, line: 94, column: 2)
!106 = !DILocalVariable(name: "__s2_len", scope: !101, file: !1, line: 96, type: !4)
!107 = !DILocalVariable(name: "__s2", scope: !108, file: !1, line: 96, type: !9)
!108 = distinct !DILexicalBlock(scope: !101, file: !1, line: 96, column: 6)
!109 = !DILocalVariable(name: "__result", scope: !108, file: !1, line: 96, type: !21)
!110 = !DILocalVariable(name: "fptr", scope: !56, file: !1, line: 281, type: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !113, line: 48, baseType: !114)
!113 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/lavaMDllvm")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !115, line: 245, size: 1728, elements: !116)
!115 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/lavaMDllvm")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !137, !138, !139, !140, !143, !145, !147, !151, !154, !156, !157, !158, !159, !160, !161, !162}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !114, file: !115, line: 246, baseType: !21, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !114, file: !115, line: 251, baseType: !51, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !114, file: !115, line: 252, baseType: !51, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !114, file: !115, line: 253, baseType: !51, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !114, file: !115, line: 254, baseType: !51, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !114, file: !115, line: 255, baseType: !51, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !114, file: !115, line: 256, baseType: !51, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !114, file: !115, line: 257, baseType: !51, size: 64, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !114, file: !115, line: 258, baseType: !51, size: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !114, file: !115, line: 260, baseType: !51, size: 64, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !114, file: !115, line: 261, baseType: !51, size: 64, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !114, file: !115, line: 262, baseType: !51, size: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !114, file: !115, line: 264, baseType: !130, size: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !115, line: 160, size: 192, elements: !132)
!132 = !{!133, !134, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !131, file: !115, line: 161, baseType: !130, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !131, file: !115, line: 162, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !131, file: !115, line: 166, baseType: !21, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !114, file: !115, line: 266, baseType: !135, size: 64, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !114, file: !115, line: 268, baseType: !21, size: 32, offset: 896)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !114, file: !115, line: 272, baseType: !21, size: 32, offset: 928)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !114, file: !115, line: 274, baseType: !141, size: 64, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !142, line: 131, baseType: !26)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/lavaMDllvm")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !114, file: !115, line: 278, baseType: !144, size: 16, offset: 1024)
!144 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !114, file: !115, line: 279, baseType: !146, size: 8, offset: 1040)
!146 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !114, file: !115, line: 280, baseType: !148, size: 8, offset: 1048)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 1)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !114, file: !115, line: 284, baseType: !152, size: 64, offset: 1088)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !115, line: 154, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !114, file: !115, line: 293, baseType: !155, size: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !142, line: 132, baseType: !26)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !114, file: !115, line: 302, baseType: !52, size: 64, offset: 1216)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !114, file: !115, line: 303, baseType: !52, size: 64, offset: 1280)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !114, file: !115, line: 304, baseType: !52, size: 64, offset: 1344)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !114, file: !115, line: 305, baseType: !52, size: 64, offset: 1408)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !114, file: !115, line: 306, baseType: !4, size: 64, offset: 1472)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !114, file: !115, line: 308, baseType: !21, size: 32, offset: 1536)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !114, file: !115, line: 310, baseType: !163, size: 160, offset: 1568)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 20)
!166 = !DIExpression()
!167 = !DILocation(line: 49, column: 11, scope: !56)
!168 = !DILocation(line: 50, column: 9, scope: !56)
!169 = !DILocation(line: 53, column: 2, scope: !56)
!170 = !DILocation(line: 61, column: 10, scope: !56)
!171 = !DILocation(line: 59, column: 12, scope: !56)
!172 = !DILocation(line: 76, column: 10, scope: !56)
!173 = !DILocation(line: 77, column: 2, scope: !56)
!174 = !DILocation(line: 84, column: 10, scope: !56)
!175 = !DILocation(line: 64, column: 12, scope: !56)
!176 = !DILocation(line: 91, column: 10, scope: !56)
!177 = !DILocation(line: 91, column: 22, scope: !56)
!178 = !{!179, !180, i64 12}
!179 = !{!"dim_str", !180, i64 0, !180, i64 4, !180, i64 8, !180, i64 12, !183, i64 16, !183, i64 24, !183, i64 32, !183, i64 40, !183, i64 48}
!180 = !{!"int", !181, i64 0}
!181 = !{!"omnipotent char", !182, i64 0}
!182 = !{!"Simple C/C++ TBAA"}
!183 = !{!"long", !181, i64 0}
!184 = !DILocation(line: 94, column: 14, scope: !105)
!185 = !DILocation(line: 94, column: 62, scope: !186)
!186 = !DILexicalBlockFile(scope: !104, file: !1, discriminator: 2)
!187 = !{!179, !180, i64 0}
!188 = !DILocation(line: 94, column: 40, scope: !189)
!189 = !DILexicalBlockFile(scope: !104, file: !1, discriminator: 1)
!190 = !DILocation(line: 94, column: 2, scope: !191)
!191 = !DILexicalBlockFile(scope: !105, file: !1, discriminator: 1)
!192 = !DILocation(line: 96, column: 6, scope: !101)
!193 = distinct !{!193, !194, !195}
!194 = !DILocation(line: 94, column: 2, scope: !105)
!195 = !DILocation(line: 125, column: 2, scope: !105)
!196 = !DILocation(line: 96, column: 6, scope: !197)
!197 = !DILexicalBlockFile(scope: !101, file: !1, discriminator: 12)
!198 = !{!199, !199, i64 0}
!199 = !{!"any pointer", !181, i64 0}
!200 = !DILocation(line: 96, column: 47, scope: !201)
!201 = !DILexicalBlockFile(scope: !102, file: !1, discriminator: 13)
!202 = !DILocation(line: 96, column: 6, scope: !203)
!203 = !DILexicalBlockFile(scope: !103, file: !1, discriminator: 13)
!204 = !DILocation(line: 98, column: 28, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !1, line: 98, column: 7)
!206 = distinct !DILexicalBlock(scope: !102, file: !1, line: 96, column: 51)
!207 = !DILocation(line: 100, column: 18, scope: !208)
!208 = distinct !DILexicalBlock(scope: !209, file: !1, line: 100, column: 8)
!209 = distinct !DILexicalBlock(scope: !205, file: !1, line: 98, column: 31)
!210 = !DILocation(line: 100, column: 8, scope: !208)
!211 = !DILocation(line: 100, column: 42, scope: !208)
!212 = !DILocation(line: 100, column: 8, scope: !209)
!213 = !DILocation(line: 101, column: 33, scope: !214)
!214 = distinct !DILexicalBlock(scope: !208, file: !1, line: 100, column: 46)
!215 = !DILocalVariable(name: "__nptr", arg: 1, scope: !216, file: !217, line: 278, type: !12)
!216 = distinct !DISubprogram(name: "atoi", scope: !217, file: !217, line: 278, type: !218, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !220)
!217 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/lavaMDllvm")
!218 = !DISubroutineType(types: !219)
!219 = !{!21, !12}
!220 = !{!215}
!221 = !DILocation(line: 278, column: 1, scope: !216, inlinedAt: !222)
!222 = distinct !DILocation(line: 101, column: 28, scope: !214)
!223 = !DILocation(line: 280, column: 16, scope: !216, inlinedAt: !222)
!224 = !DILocation(line: 280, column: 10, scope: !216, inlinedAt: !222)
!225 = !DILocation(line: 101, column: 26, scope: !214)
!226 = !DILocation(line: 102, column: 28, scope: !227)
!227 = distinct !DILexicalBlock(scope: !214, file: !1, line: 102, column: 9)
!228 = !DILocation(line: 102, column: 9, scope: !214)
