; ModuleID = 'needle.cu'
source_filename = "needle.cu"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }
%struct.dim3 = type { i32, i32, i32 }
%struct.CUstream_st = type opaque


!232 = !DISubprogram(name: "atan2", scope: !224, file: !224, line: 60, type: !233, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!233 = !DISubroutineType(types: !234)
!234 = !{!21, !21, !21}
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !236, line: 180)
!236 = !DISubprogram(name: "ceil", scope: !224, file: !224, line: 178, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !238, line: 199)
!238 = !DISubprogram(name: "cos", scope: !224, file: !224, line: 63, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !240, line: 218)
!240 = !DISubprogram(name: "cosh", scope: !224, file: !224, line: 72, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !242, line: 237)
!242 = !DISubprogram(name: "exp", scope: !224, file: !224, line: 100, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !244, line: 256)
!244 = !DISubprogram(name: "fabs", scope: !224, file: !224, line: 181, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !246, line: 275)
!246 = !DISubprogram(name: "floor", scope: !224, file: !224, line: 184, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !248, line: 294)
!248 = !DISubprogram(name: "fmod", scope: !224, file: !224, line: 187, type: !233, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !250, line: 315)
!250 = !DISubprogram(name: "frexp", scope: !224, file: !224, line: 103, type: !251, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{!21, !21, !22}
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !254, line: 334)
!254 = !DISubprogram(name: "ldexp", scope: !224, file: !224, line: 106, type: !255, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!255 = !DISubroutineType(types: !256)
!256 = !{!21, !21, !23}
!257 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !258, line: 353)
!258 = !DISubprogram(name: "log", scope: !224, file: !224, line: 109, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !260, line: 372)
!260 = !DISubprogram(name: "log10", scope: !224, file: !224, line: 112, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!261 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !262, line: 391)
!262 = !DISubprogram(name: "modf", scope: !224, file: !224, line: 115, type: !263, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!263 = !DISubroutineType(types: !264)
!264 = !{!21, !21, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !267, line: 403)
!267 = !DISubprogram(name: "pow", scope: !224, file: !224, line: 153, type: !233, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !269, line: 440)
!269 = !DISubprogram(name: "sin", scope: !224, file: !224, line: 65, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !271, line: 459)
!271 = !DISubprogram(name: "sinh", scope: !224, file: !224, line: 74, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !273, line: 478)
!273 = !DISubprogram(name: "sqrt", scope: !224, file: !224, line: 156, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !275, line: 497)
!275 = !DISubprogram(name: "tan", scope: !224, file: !224, line: 67, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !277, line: 516)
!277 = !DISubprogram(name: "tanh", scope: !224, file: !224, line: 76, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !279, line: 118)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !280, line: 101, baseType: !281)
!280 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!281 = !DICompositeType(tag: DW_TAG_structure_type, file: !280, line: 97, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !283, line: 119)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !280, line: 109, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !280, line: 105, size: 128, elements: !285, identifier: "_ZTS6ldiv_t")
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !284, file: !280, line: 107, baseType: !134, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !284, file: !280, line: 108, baseType: !134, size: 64, offset: 64)
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !289, line: 121)
!289 = !DISubprogram(name: "abort", scope: !280, file: !280, line: 515, type: !290, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!290 = !DISubroutineType(types: !291)
!291 = !{null}
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !293, line: 122)
!293 = !DISubprogram(name: "abs", scope: !280, file: !280, line: 775, type: !294, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!294 = !DISubroutineType(types: !295)
!295 = !{!23, !23}
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !297, line: 123)
!297 = !DISubprogram(name: "atexit", scope: !280, file: !280, line: 519, type: !298, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!298 = !DISubroutineType(types: !299)
!299 = !{!23, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !302, line: 129)
!302 = !DISubprogram(name: "atof", scope: !303, file: !303, line: 26, type: !172, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!303 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !305, line: 130)
!305 = distinct !DISubprogram(name: "atoi", scope: !280, file: !280, line: 278, type: !306, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{!23, !174}
!308 = !{!309}
!309 = !DILocalVariable(name: "__nptr", arg: 1, scope: !305, file: !280, line: 278, type: !174)
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !311, line: 131)
!311 = !DISubprogram(name: "atol", scope: !280, file: !280, line: 283, type: !312, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!312 = !DISubroutineType(types: !313)
!313 = !{!134, !174}
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !315, line: 132)
!315 = !DISubprogram(name: "bsearch", scope: !316, file: !316, line: 20, type: !317, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!317 = !DISubroutineType(types: !318)
!318 = !{!25, !319, !319, !321, !321, !324}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !322, line: 62, baseType: !323)
!322 = !DIFile(filename: "/home/dshen/llvm/build/bin/../lib/clang/5.0.0/include/stddef.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!323 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !280, line: 742, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!23, !319, !319}
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !329, line: 133)
!329 = !DISubprogram(name: "calloc", scope: !280, file: !280, line: 468, type: !330, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!330 = !DISubroutineType(types: !331)
!331 = !{!25, !321, !321}
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !333, line: 134)
!333 = !DISubprogram(name: "div", scope: !280, file: !280, line: 789, type: !334, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!334 = !DISubroutineType(types: !335)
!335 = !{!279, !23, !23}
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !337, line: 135)
!337 = !DISubprogram(name: "exit", scope: !280, file: !280, line: 543, type: !338, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !23}
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !341, line: 136)
!341 = !DISubprogram(name: "free", scope: !280, file: !280, line: 483, type: !342, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !25}
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !345, line: 137)
!345 = !DISubprogram(name: "getenv", scope: !280, file: !280, line: 564, type: !346, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!346 = !DISubroutineType(types: !347)
!347 = !{!27, !174}
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !349, line: 138)
!349 = !DISubprogram(name: "labs", scope: !280, file: !280, line: 776, type: !132, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !351, line: 139)
!351 = !DISubprogram(name: "ldiv", scope: !280, file: !280, line: 791, type: !352, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!352 = !DISubroutineType(types: !353)
!353 = !{!283, !134, !134}
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !355, line: 140)
!355 = !DISubprogram(name: "malloc", scope: !280, file: !280, line: 466, type: !356, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!356 = !DISubroutineType(types: !357)
!357 = !{!25, !321}
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !359, line: 142)
!359 = !DISubprogram(name: "mblen", scope: !280, file: !280, line: 863, type: !360, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!360 = !DISubroutineType(types: !361)
!361 = !{!23, !174, !321}
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !363, line: 143)
!363 = !DISubprogram(name: "mbstowcs", scope: !280, file: !280, line: 874, type: !364, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!364 = !DISubroutineType(types: !365)
!365 = !{!321, !366, !369, !321}
!366 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!369 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !174)
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !371, line: 144)
!371 = !DISubprogram(name: "mbtowc", scope: !280, file: !280, line: 866, type: !372, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!372 = !DISubroutineType(types: !373)
!373 = !{!23, !366, !369, !321}
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !375, line: 146)
!375 = !DISubprogram(name: "qsort", scope: !280, file: !280, line: 765, type: !376, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !25, !321, !321, !324}
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !379, line: 152)
!379 = !DISubprogram(name: "rand", scope: !280, file: !280, line: 374, type: !380, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!380 = !DISubroutineType(types: !381)
!381 = !{!23}
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !383, line: 153)
!383 = !DISubprogram(name: "realloc", scope: !280, file: !280, line: 480, type: !384, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!384 = !DISubroutineType(types: !385)
!385 = !{!25, !25, !321}
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !387, line: 154)
!387 = !DISubprogram(name: "srand", scope: !280, file: !280, line: 376, type: !388, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !390}
!390 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !392, line: 155)
!392 = !DISubprogram(name: "strtod", scope: !280, file: !280, line: 164, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!393 = !DISubroutineType(types: !394)
!394 = !{!21, !369, !395}
!395 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !26)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !397, line: 156)
!397 = !DISubprogram(name: "strtol", scope: !280, file: !280, line: 183, type: !398, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!398 = !DISubroutineType(types: !399)
!399 = !{!134, !369, !395, !23}
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !401, line: 157)
!401 = !DISubprogram(name: "strtoul", scope: !280, file: !280, line: 187, type: !402, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!402 = !DISubroutineType(types: !403)
!403 = !{!323, !369, !395, !23}
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !405, line: 158)
!405 = !DISubprogram(name: "system", scope: !280, file: !280, line: 717, type: !306, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !407, line: 160)
!407 = !DISubprogram(name: "wcstombs", scope: !280, file: !280, line: 877, type: !408, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!408 = !DISubroutineType(types: !409)
!409 = !{!321, !410, !411, !321}
!410 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !27)
!411 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !415, line: 161)
!415 = !DISubprogram(name: "wctomb", scope: !280, file: !280, line: 870, type: !416, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!416 = !DISubroutineType(types: !417)
!417 = !{!23, !27, !368}
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !421, line: 201)
!419 = !DINamespace(name: "__gnu_cxx", scope: null, file: !420, line: 68)
!420 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/bits/cpp_type_traits.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !280, line: 121, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !280, line: 117, size: 128, elements: !423, identifier: "_ZTS7lldiv_t")
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !422, file: !280, line: 119, baseType: !37, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !422, file: !280, line: 120, baseType: !37, size: 64, offset: 64)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !427, line: 207)
!427 = !DISubprogram(name: "_Exit", scope: !280, file: !280, line: 557, type: !338, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !429, line: 211)
!429 = !DISubprogram(name: "llabs", scope: !280, file: !280, line: 780, type: !35, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !431, line: 217)
!431 = !DISubprogram(name: "lldiv", scope: !280, file: !280, line: 797, type: !432, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!432 = !DISubroutineType(types: !433)
!433 = !{!421, !37, !37}
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !435, line: 228)
!435 = !DISubprogram(name: "atoll", scope: !280, file: !280, line: 292, type: !436, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!436 = !DISubroutineType(types: !437)
!437 = !{!37, !174}
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !439, line: 229)
!439 = !DISubprogram(name: "strtoll", scope: !280, file: !280, line: 209, type: !440, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!440 = !DISubroutineType(types: !441)
!441 = !{!37, !369, !395, !23}
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !443, line: 230)
!443 = !DISubprogram(name: "strtoull", scope: !280, file: !280, line: 214, type: !444, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !369, !395, !23}
!446 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !448, line: 232)
!448 = !DISubprogram(name: "strtof", scope: !280, file: !280, line: 172, type: !449, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!449 = !DISubroutineType(types: !450)
!450 = !{!42, !369, !395}
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !452, line: 233)
!452 = !DISubprogram(name: "strtold", scope: !280, file: !280, line: 175, type: !453, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!453 = !DISubroutineType(types: !454)
!454 = !{!455, !369, !395}
!455 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !421, line: 241)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !427, line: 243)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !429, line: 245)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !460, line: 246)
!460 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !419, file: !461, line: 214, type: !432, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!461 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/cstdlib", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !431, line: 247)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !435, line: 249)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !448, line: 250)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !439, line: 251)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !443, line: 252)
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !452, line: 253)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !469, line: 418)
!469 = !DISubprogram(name: "acosf", linkageName: "_ZL5acosff", scope: !470, file: !470, line: 1126, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!470 = !DIFile(filename: "/usr/local/cuda/include/math_functions.hpp", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !472, line: 419)
!472 = !DISubprogram(name: "acoshf", linkageName: "_ZL6acoshff", scope: !470, file: !470, line: 1154, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !474, line: 420)
!474 = !DISubprogram(name: "asinf", linkageName: "_ZL5asinff", scope: !470, file: !470, line: 1121, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !476, line: 421)
!476 = !DISubprogram(name: "asinhf", linkageName: "_ZL6asinhff", scope: !470, file: !470, line: 1159, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !478, line: 422)
!478 = !DISubprogram(name: "atan2f", linkageName: "_ZL6atan2fff", scope: !470, file: !470, line: 1111, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !480, line: 423)
!480 = !DISubprogram(name: "atanf", linkageName: "_ZL5atanff", scope: !470, file: !470, line: 1116, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !482, line: 424)
!482 = !DISubprogram(name: "atanhf", linkageName: "_ZL6atanhff", scope: !470, file: !470, line: 1164, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !484, line: 425)
!484 = !DISubprogram(name: "cbrtf", linkageName: "_ZL5cbrtff", scope: !470, file: !470, line: 1199, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !486, line: 426)
!486 = !DISubprogram(name: "ceilf", linkageName: "_ZL5ceilff", scope: !487, file: !487, line: 647, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!487 = !DIFile(filename: "/usr/local/cuda/include/device_functions.hpp", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !489, line: 427)
!489 = !DISubprogram(name: "copysignf", linkageName: "_ZL9copysignfff", scope: !470, file: !470, line: 973, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !491, line: 428)
!491 = !DISubprogram(name: "cosf", linkageName: "_ZL4cosff", scope: !470, file: !470, line: 1027, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !493, line: 429)
!493 = !DISubprogram(name: "coshf", linkageName: "_ZL5coshff", scope: !470, file: !470, line: 1096, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !495, line: 430)
!495 = !DISubprogram(name: "erfcf", linkageName: "_ZL5erfcff", scope: !470, file: !470, line: 1259, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !497, line: 431)
!497 = !DISubprogram(name: "erff", linkageName: "_ZL4erfff", scope: !470, file: !470, line: 1249, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !499, line: 432)
!499 = !DISubprogram(name: "exp2f", linkageName: "_ZL5exp2ff", scope: !487, file: !487, line: 637, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !501, line: 433)
!501 = !DISubprogram(name: "expf", linkageName: "_ZL4expff", scope: !470, file: !470, line: 1078, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !503, line: 434)
!503 = !DISubprogram(name: "expm1f", linkageName: "_ZL6expm1ff", scope: !470, file: !470, line: 1169, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !505, line: 435)
!505 = !DISubprogram(name: "fabsf", linkageName: "_ZL5fabsff", scope: !487, file: !487, line: 582, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !507, line: 436)
!507 = !DISubprogram(name: "fdimf", linkageName: "_ZL5fdimfff", scope: !470, file: !470, line: 1385, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !509, line: 437)
!509 = !DISubprogram(name: "floorf", linkageName: "_ZL6floorff", scope: !487, file: !487, line: 572, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !511, line: 438)
!511 = !DISubprogram(name: "fmaf", linkageName: "_ZL4fmaffff", scope: !470, file: !470, line: 1337, type: !85, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !513, line: 439)
!513 = !DISubprogram(name: "fmaxf", linkageName: "_ZL5fmaxfff", scope: !487, file: !487, line: 602, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !515, line: 440)
!515 = !DISubprogram(name: "fminf", linkageName: "_ZL5fminfff", scope: !487, file: !487, line: 597, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !517, line: 441)
!517 = !DISubprogram(name: "fmodf", linkageName: "_ZL5fmodfff", scope: !470, file: !470, line: 1322, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !519, line: 442)
!519 = !DISubprogram(name: "frexpf", linkageName: "_ZL6frexpffPi", scope: !470, file: !470, line: 1312, type: !99, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !521, line: 443)
!521 = !DISubprogram(name: "hypotf", linkageName: "_ZL6hypotfff", scope: !470, file: !470, line: 1174, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !523, line: 444)
!523 = !DISubprogram(name: "ilogbf", linkageName: "_ZL6ilogbff", scope: !470, file: !470, line: 1390, type: !95, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !525, line: 445)
!525 = !DISubprogram(name: "ldexpf", linkageName: "_ZL6ldexpffi", scope: !470, file: !470, line: 1289, type: !137, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !527, line: 446)
!527 = !DISubprogram(name: "lgammaf", linkageName: "_ZL7lgammaff", scope: !470, file: !470, line: 1284, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !529, line: 447)
!529 = !DISubprogram(name: "llrintf", linkageName: "_ZL7llrintff", scope: !470, file: !470, line: 933, type: !145, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !531, line: 448)
!531 = !DISubprogram(name: "llroundf", linkageName: "_ZL8llroundff", scope: !470, file: !470, line: 1371, type: !145, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !533, line: 449)
!533 = !DISubprogram(name: "log10f", linkageName: "_ZL6log10ff", scope: !470, file: !470, line: 1140, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !535, line: 450)
!535 = !DISubprogram(name: "log1pf", linkageName: "_ZL6log1pff", scope: !470, file: !470, line: 1149, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !537, line: 451)
!537 = !DISubprogram(name: "log2f", linkageName: "_ZL5log2ff", scope: !470, file: !470, line: 1069, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !539, line: 452)
!539 = !DISubprogram(name: "logbf", linkageName: "_ZL5logbff", scope: !470, file: !470, line: 1395, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !541, line: 453)
!541 = !DISubprogram(name: "logf", linkageName: "_ZL4logff", scope: !470, file: !470, line: 1131, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !543, line: 454)
!543 = !DISubprogram(name: "lrintf", linkageName: "_ZL6lrintff", scope: !470, file: !470, line: 924, type: !159, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !545, line: 455)
!545 = !DISubprogram(name: "lroundf", linkageName: "_ZL7lroundff", scope: !470, file: !470, line: 1376, type: !159, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !547, line: 456)
!547 = !DISubprogram(name: "modff", linkageName: "_ZL5modfffPf", scope: !470, file: !470, line: 1317, type: !167, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !549, line: 457)
!549 = !DISubprogram(name: "nearbyintf", linkageName: "_ZL10nearbyintff", scope: !470, file: !470, line: 938, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !551, line: 458)
!551 = !DISubprogram(name: "nextafterf", linkageName: "_ZL10nextafterfff", scope: !470, file: !470, line: 1002, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !553, line: 459)
!553 = !DISubprogram(name: "nexttowardf", scope: !224, file: !224, line: 284, type: !554, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!554 = !DISubroutineType(types: !555)
!555 = !{!42, !42, !455}
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !553, line: 460)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !558, line: 461)
!558 = !DISubprogram(name: "powf", linkageName: "_ZL4powfff", scope: !470, file: !470, line: 1352, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !560, line: 462)
!560 = !DISubprogram(name: "remainderf", linkageName: "_ZL10remainderfff", scope: !470, file: !470, line: 1327, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !562, line: 463)
!562 = !DISubprogram(name: "remquof", linkageName: "_ZL7remquofffPi", scope: !470, file: !470, line: 1332, type: !194, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !564, line: 464)
!564 = !DISubprogram(name: "rintf", linkageName: "_ZL5rintff", scope: !470, file: !470, line: 919, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !566, line: 465)
!566 = !DISubprogram(name: "roundf", linkageName: "_ZL6roundff", scope: !470, file: !470, line: 1366, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !568, line: 466)
!568 = !DISubprogram(name: "scalblnf", linkageName: "_ZL8scalblnffl", scope: !470, file: !470, line: 1299, type: !202, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !570, line: 467)
!570 = !DISubprogram(name: "scalbnf", linkageName: "_ZL7scalbnffi", scope: !470, file: !470, line: 1294, type: !137, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !572, line: 468)
!572 = !DISubprogram(name: "sinf", linkageName: "_ZL4sinff", scope: !470, file: !470, line: 1018, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !574, line: 469)
!574 = !DISubprogram(name: "sinhf", linkageName: "_ZL5sinhff", scope: !470, file: !470, line: 1101, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !576, line: 470)
!576 = !DISubprogram(name: "sqrtf", linkageName: "_ZL5sqrtff", scope: !487, file: !487, line: 887, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !578, line: 471)
!578 = !DISubprogram(name: "tanf", linkageName: "_ZL4tanff", scope: !470, file: !470, line: 1060, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !580, line: 472)
!580 = !DISubprogram(name: "tanhf", linkageName: "_ZL5tanhff", scope: !470, file: !470, line: 1106, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !582, line: 473)
!582 = !DISubprogram(name: "tgammaf", linkageName: "_ZL7tgammaff", scope: !470, file: !470, line: 1361, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !32, entity: !584, line: 474)
!584 = !DISubprogram(name: "truncf", linkageName: "_ZL6truncff", scope: !487, file: !487, line: 642, type: !40, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 18432, elements: !586)
!586 = !{!587, !587}
!587 = !DISubrange(count: 24)
!588 = !{i32 2, !"Dwarf Version", i32 4}
!589 = !{i32 2, !"Debug Info Version", i32 3}
!590 = !{!"clang version 5.0.0 (trunk 294196)"}
!591 = distinct !DISubprogram(name: "maximum", linkageName: "_Z7maximumiii", scope: !592, file: !592, line: 9, type: !593, isLocal: false, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !595)
!592 = !DIFile(filename: "./needle_kernel.cu", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!593 = !DISubroutineType(types: !594)
!594 = !{!23, !23, !23, !23}
!595 = !{!596, !597, !598, !599}
!596 = !DILocalVariable(name: "a", arg: 1, scope: !591, file: !592, line: 9, type: !23)
!597 = !DILocalVariable(name: "b", arg: 2, scope: !591, file: !592, line: 10, type: !23)
!598 = !DILocalVariable(name: "c", arg: 3, scope: !591, file: !592, line: 11, type: !23)
!599 = !DILocalVariable(name: "k", scope: !591, file: !592, line: 13, type: !23)
!600 = !DIExpression()
!601 = !DILocation(line: 9, column: 14, scope: !591)
!602 = !DILocation(line: 10, column: 8, scope: !591)
!603 = !DILocation(line: 11, column: 8, scope: !591)
!604 = !DILocation(line: 14, column: 7, scope: !605)
!605 = distinct !DILexicalBlock(scope: !591, file: !592, line: 14, column: 5)
!606 = !DILocation(line: 13, column: 5, scope: !591)
!607 = !DILocation(line: 19, column: 7, scope: !608)
!608 = distinct !DILexicalBlock(scope: !591, file: !592, line: 19, column: 5)
!609 = !DILocation(line: 19, column: 5, scope: !591)
!610 = !DILocation(line: 24, column: 1, scope: !591)
!611 = distinct !DISubprogram(name: "needle_cuda_shared_1", linkageName: "_Z20needle_cuda_shared_1PiS_iiii", scope: !592, file: !592, line: 27, type: !612, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !614)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !22, !22, !23, !23, !23, !23}
!614 = !{!615, !616, !617, !618, !619, !620}
!615 = !DILocalVariable(name: "referrence", arg: 1, scope: !611, file: !592, line: 27, type: !22)
!616 = !DILocalVariable(name: "matrix_cuda", arg: 2, scope: !611, file: !592, line: 28, type: !22)
!617 = !DILocalVariable(name: "cols", arg: 3, scope: !611, file: !592, line: 29, type: !23)
!618 = !DILocalVariable(name: "penalty", arg: 4, scope: !611, file: !592, line: 30, type: !23)
!619 = !DILocalVariable(name: "i", arg: 5, scope: !611, file: !592, line: 31, type: !23)
!620 = !DILocalVariable(name: "block_width", arg: 6, scope: !611, file: !592, line: 32, type: !23)
!621 = !DILocation(line: 27, column: 29, scope: !611)
!622 = !{!623, !623, i64 0}
!623 = !{!"any pointer", !624, i64 0}
!624 = !{!"omnipotent char", !625, i64 0}
!625 = !{!"Simple C++ TBAA"}
!626 = !DILocation(line: 28, column: 11, scope: !611)
!627 = !DILocation(line: 29, column: 10, scope: !611)
!628 = !{!629, !629, i64 0}
!629 = !{!"int", !624, i64 0}
!630 = !DILocation(line: 30, column: 10, scope: !611)
!631 = !DILocation(line: 31, column: 10, scope: !611)
!632 = !DILocation(line: 32, column: 10, scope: !611)
!633 = !DILocation(line: 33, column: 1, scope: !611)
!634 = !DILocation(line: 33, column: 1, scope: !635)
!635 = !DILexicalBlockFile(scope: !611, file: !592, discriminator: 1)
!636 = !DILocation(line: 33, column: 1, scope: !637)
!637 = !DILexicalBlockFile(scope: !611, file: !592, discriminator: 2)
!638 = !DILocation(line: 33, column: 1, scope: !639)
!639 = !DILexicalBlockFile(scope: !611, file: !592, discriminator: 3)
!640 = !DILocation(line: 33, column: 1, scope: !641)
!641 = !DILexicalBlockFile(scope: !611, file: !592, discriminator: 4)
!642 = !DILocation(line: 33, column: 1, scope: !643)
!643 = !DILexicalBlockFile(scope: !611, file: !592, discriminator: 5)
!644 = !DILocation(line: 33, column: 1, scope: !645)
!645 = !DILexicalBlockFile(scope: !611, file: !592, discriminator: 6)
!646 = !DILocation(line: 104, column: 1, scope: !611)
!647 = distinct !DISubprogram(name: "needle_cuda_shared_2", linkageName: "_Z20needle_cuda_shared_2PiS_iiii", scope: !592, file: !592, line: 108, type: !612, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !648)
!648 = !{!649, !650, !651, !652, !653, !654}
!649 = !DILocalVariable(name: "referrence", arg: 1, scope: !647, file: !592, line: 108, type: !22)
!650 = !DILocalVariable(name: "matrix_cuda", arg: 2, scope: !647, file: !592, line: 109, type: !22)
!651 = !DILocalVariable(name: "cols", arg: 3, scope: !647, file: !592, line: 111, type: !23)
!652 = !DILocalVariable(name: "penalty", arg: 4, scope: !647, file: !592, line: 112, type: !23)
!653 = !DILocalVariable(name: "i", arg: 5, scope: !647, file: !592, line: 113, type: !23)
!654 = !DILocalVariable(name: "block_width", arg: 6, scope: !647, file: !592, line: 114, type: !23)
!655 = !DILocation(line: 108, column: 29, scope: !647)
!656 = !DILocation(line: 109, column: 11, scope: !647)
!657 = !DILocation(line: 111, column: 10, scope: !647)
!658 = !DILocation(line: 112, column: 10, scope: !647)
!659 = !DILocation(line: 113, column: 10, scope: !647)
!660 = !DILocation(line: 114, column: 10, scope: !647)
!661 = !DILocation(line: 115, column: 1, scope: !647)
!662 = !DILocation(line: 115, column: 1, scope: !663)
!663 = !DILexicalBlockFile(scope: !647, file: !592, discriminator: 1)
!664 = !DILocation(line: 115, column: 1, scope: !665)
!665 = !DILexicalBlockFile(scope: !647, file: !592, discriminator: 2)
!666 = !DILocation(line: 115, column: 1, scope: !667)
!667 = !DILexicalBlockFile(scope: !647, file: !592, discriminator: 3)
!668 = !DILocation(line: 115, column: 1, scope: !669)
!669 = !DILexicalBlockFile(scope: !647, file: !592, discriminator: 4)
!670 = !DILocation(line: 115, column: 1, scope: !671)
!671 = !DILexicalBlockFile(scope: !647, file: !592, discriminator: 5)
!672 = !DILocation(line: 115, column: 1, scope: !673)
!673 = !DILexicalBlockFile(scope: !647, file: !592, discriminator: 6)
!674 = !DILocation(line: 188, column: 1, scope: !647)
!675 = distinct !DISubprogram(name: "get_time", linkageName: "_Z8get_timev", scope: !3, file: !3, line: 17, type: !676, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !678)
!676 = !DISubroutineType(types: !677)
!677 = !{!21}
!678 = !{!679}
!679 = !DILocalVariable(name: "time", scope: !675, file: !3, line: 18, type: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !681, line: 30, size: 128, elements: !682, identifier: "_ZTS7timeval")
!681 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!682 = !{!683, !686}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !680, file: !681, line: 32, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !685, line: 139, baseType: !134)
!685 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !680, file: !681, line: 33, baseType: !687, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !685, line: 141, baseType: !134)
!688 = !DILocation(line: 18, column: 5, scope: !675)
!689 = !DIExpression(DW_OP_deref)
!690 = !DILocation(line: 18, column: 20, scope: !675)
!691 = !DILocation(line: 19, column: 9, scope: !692)
!692 = distinct !DILexicalBlock(scope: !675, file: !3, line: 19, column: 9)
!693 = !DILocation(line: 19, column: 9, scope: !675)
!694 = !DILocation(line: 23, column: 25, scope: !675)
!695 = !{!696, !697, i64 0}
!696 = !{!"_ZTS7timeval", !697, i64 0, !697, i64 8}
!697 = !{!"long", !624, i64 0}
!698 = !DILocation(line: 23, column: 20, scope: !675)
!699 = !DILocation(line: 23, column: 47, scope: !675)
!700 = !{!696, !697, i64 8}
!701 = !DILocation(line: 23, column: 42, scope: !675)
!702 = !DILocation(line: 23, column: 55, scope: !675)
!703 = !DILocation(line: 23, column: 32, scope: !675)
!704 = !DILocation(line: 23, column: 5, scope: !675)
!705 = !DILocation(line: 24, column: 1, scope: !675)
!706 = distinct !DISubprogram(name: "gettime", linkageName: "_Z7gettimev", scope: !3, file: !3, line: 54, type: !676, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !707)
!707 = !{!708}
!708 = !DILocalVariable(name: "t", scope: !706, file: !3, line: 55, type: !680)
!709 = !DILocation(line: 55, column: 3, scope: !706)
!710 = !DILocation(line: 55, column: 18, scope: !706)
!711 = !DILocation(line: 56, column: 3, scope: !706)
!712 = !DILocation(line: 57, column: 12, scope: !706)
!713 = !DILocation(line: 57, column: 10, scope: !706)
!714 = !DILocation(line: 57, column: 21, scope: !706)
!715 = !DILocation(line: 57, column: 19, scope: !706)
!716 = !DILocation(line: 57, column: 28, scope: !706)
!717 = !DILocation(line: 57, column: 18, scope: !706)
!718 = !DILocation(line: 58, column: 1, scope: !706)
!719 = !DILocation(line: 57, column: 3, scope: !706)
!720 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 64, type: !721, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !723)
!721 = !DISubroutineType(types: !722)
!722 = !{!23, !23, !26}
!723 = !{!724, !725}
!724 = !DILocalVariable(name: "argc", arg: 1, scope: !720, file: !3, line: 64, type: !23)
!725 = !DILocalVariable(name: "argv", arg: 2, scope: !720, file: !3, line: 64, type: !26)
!726 = !DILocation(line: 64, column: 11, scope: !720)
!727 = !DILocation(line: 64, column: 24, scope: !720)
!728 = !DILocation(line: 67, column: 3, scope: !720)
!729 = !DILocation(line: 69, column: 5, scope: !720)
!730 = !DILocation(line: 71, column: 5, scope: !720)
!731 = distinct !DISubprogram(name: "runTest", linkageName: "_Z7runTestiPPc", scope: !3, file: !3, line: 82, type: !732, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !734)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !23, !26}
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !748, !752, !754, !756, !758, !762, !764, !766, !790, !791, !792, !793, !795, !797, !798, !800, !851, !853, !854, !857, !858, !859, !860, !861, !862}
!735 = !DILocalVariable(name: "argc", arg: 1, scope: !731, file: !3, line: 82, type: !23)
!736 = !DILocalVariable(name: "argv", arg: 2, scope: !731, file: !3, line: 82, type: !26)
!737 = !DILocalVariable(name: "max_rows", scope: !731, file: !3, line: 84, type: !23)
!738 = !DILocalVariable(name: "max_cols", scope: !731, file: !3, line: 84, type: !23)
!739 = !DILocalVariable(name: "penalty", scope: !731, file: !3, line: 84, type: !23)
!740 = !DILocalVariable(name: "input_itemsets", scope: !731, file: !3, line: 85, type: !22)
!741 = !DILocalVariable(name: "output_itemsets", scope: !731, file: !3, line: 85, type: !22)
!742 = !DILocalVariable(name: "referrence", scope: !731, file: !3, line: 85, type: !22)
!743 = !DILocalVariable(name: "matrix_cuda", scope: !731, file: !3, line: 86, type: !22)
!744 = !DILocalVariable(name: "referrence_cuda", scope: !731, file: !3, line: 86, type: !22)
!745 = !DILocalVariable(name: "size", scope: !731, file: !3, line: 87, type: !23)
!746 = !DILocalVariable(name: "i", scope: !747, file: !3, line: 122, type: !23)
!747 = distinct !DILexicalBlock(scope: !731, file: !3, line: 122, column: 5)
!748 = !DILocalVariable(name: "j", scope: !749, file: !3, line: 123, type: !23)
!749 = distinct !DILexicalBlock(scope: !750, file: !3, line: 123, column: 3)
!750 = distinct !DILexicalBlock(scope: !751, file: !3, line: 122, column: 40)
!751 = distinct !DILexicalBlock(scope: !747, file: !3, line: 122, column: 5)
!752 = !DILocalVariable(name: "i", scope: !753, file: !3, line: 130, type: !23)
!753 = distinct !DILexicalBlock(scope: !731, file: !3, line: 130, column: 2)
!754 = !DILocalVariable(name: "j", scope: !755, file: !3, line: 133, type: !23)
!755 = distinct !DILexicalBlock(scope: !731, file: !3, line: 133, column: 5)
!756 = !DILocalVariable(name: "i", scope: !757, file: !3, line: 138, type: !23)
!757 = distinct !DILexicalBlock(scope: !731, file: !3, line: 138, column: 2)
!758 = !DILocalVariable(name: "j", scope: !759, file: !3, line: 139, type: !23)
!759 = distinct !DILexicalBlock(scope: !760, file: !3, line: 139, column: 3)
!760 = distinct !DILexicalBlock(scope: !761, file: !3, line: 138, column: 37)
!761 = distinct !DILexicalBlock(scope: !757, file: !3, line: 138, column: 2)
!762 = !DILocalVariable(name: "i", scope: !763, file: !3, line: 144, type: !23)
!763 = distinct !DILexicalBlock(scope: !731, file: !3, line: 144, column: 5)
!764 = !DILocalVariable(name: "j", scope: !765, file: !3, line: 146, type: !23)
!765 = distinct !DILexicalBlock(scope: !731, file: !3, line: 146, column: 2)
!766 = !DILocalVariable(name: "dimGrid", scope: !731, file: !3, line: 157, type: !767)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "dim3", file: !768, line: 427, baseType: !769)
!768 = !DIFile(filename: "/usr/local/cuda/include/vector_types.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dim3", file: !768, line: 417, size: 96, elements: !770, identifier: "_ZTS4dim3")
!770 = !{!771, !772, !773, !774, !778, !787}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !769, file: !768, line: 419, baseType: !390, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !769, file: !768, line: 419, baseType: !390, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !769, file: !768, line: 419, baseType: !390, size: 32, offset: 64)
!774 = !DISubprogram(name: "dim3", scope: !769, file: !768, line: 421, type: !775, isLocal: false, isDefinition: false, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !777, !390, !390, !390}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!778 = !DISubprogram(name: "dim3", scope: !769, file: !768, line: 422, type: !779, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !777, !781}
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !768, line: 383, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uint3", file: !768, line: 190, size: 96, elements: !783, identifier: "_ZTS5uint3")
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !782, file: !768, line: 192, baseType: !390, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !782, file: !768, line: 192, baseType: !390, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !782, file: !768, line: 192, baseType: !390, size: 32, offset: 64)
!787 = !DISubprogram(name: "operator uint3", linkageName: "_ZN4dim3cv5uint3Ev", scope: !769, file: !768, line: 423, type: !788, isLocal: false, isDefinition: false, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true)
!788 = !DISubroutineType(types: !789)
!789 = !{!781, !777}
!790 = !DILocalVariable(name: "dimBlock", scope: !731, file: !3, line: 158, type: !767)
!791 = !DILocalVariable(name: "block_width", scope: !731, file: !3, line: 159, type: !23)
!792 = !DILocalVariable(name: "t0", scope: !731, file: !3, line: 166, type: !21)
!793 = !DILocalVariable(name: "i", scope: !794, file: !3, line: 167, type: !23)
!794 = distinct !DILexicalBlock(scope: !731, file: !3, line: 167, column: 2)
!795 = !DILocalVariable(name: "i", scope: !796, file: !3, line: 175, type: !23)
!796 = distinct !DILexicalBlock(scope: !731, file: !3, line: 175, column: 2)
!797 = !DILocalVariable(name: "t1", scope: !731, file: !3, line: 182, type: !21)
!798 = !DILocalVariable(name: "ii", scope: !799, file: !3, line: 188, type: !23)
!799 = distinct !DILexicalBlock(scope: !731, file: !3, line: 188, column: 2)
!800 = !DILocalVariable(name: "fpo", scope: !731, file: !3, line: 195, type: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !803, line: 48, baseType: !804)
!803 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !805, line: 245, size: 1728, elements: !806, identifier: "_ZTS8_IO_FILE")
!805 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/nwllvm")
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !822, !824, !825, !826, !828, !830, !832, !836, !839, !841, !842, !843, !844, !845, !846, !847}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !804, file: !805, line: 246, baseType: !23, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !804, file: !805, line: 251, baseType: !27, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !804, file: !805, line: 252, baseType: !27, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !804, file: !805, line: 253, baseType: !27, size: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !804, file: !805, line: 254, baseType: !27, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !804, file: !805, line: 255, baseType: !27, size: 64, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !804, file: !805, line: 256, baseType: !27, size: 64, offset: 384)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !804, file: !805, line: 257, baseType: !27, size: 64, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !804, file: !805, line: 258, baseType: !27, size: 64, offset: 512)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !804, file: !805, line: 260, baseType: !27, size: 64, offset: 576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !804, file: !805, line: 261, baseType: !27, size: 64, offset: 640)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !804, file: !805, line: 262, baseType: !27, size: 64, offset: 704)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !804, file: !805, line: 264, baseType: !820, size: 64, offset: 768)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !805, line: 160, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !804, file: !805, line: 266, baseType: !823, size: 64, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !804, file: !805, line: 268, baseType: !23, size: 32, offset: 896)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !804, file: !805, line: 272, baseType: !23, size: 32, offset: 928)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !804, file: !805, line: 274, baseType: !827, size: 64, offset: 960)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !685, line: 131, baseType: !134)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !804, file: !805, line: 278, baseType: !829, size: 16, offset: 1024)
!829 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !804, file: !805, line: 279, baseType: !831, size: 8, offset: 1040)
!831 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !804, file: !805, line: 280, baseType: !833, size: 8, offset: 1048)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 1)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !804, file: !805, line: 284, baseType: !837, size: 64, offset: 1088)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !805, line: 154, baseType: null)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !804, file: !805, line: 293, baseType: !840, size: 64, offset: 1152)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !685, line: 132, baseType: !134)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !804, file: !805, line: 302, baseType: !25, size: 64, offset: 1216)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !804, file: !805, line: 303, baseType: !25, size: 64, offset: 1280)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !804, file: !805, line: 304, baseType: !25, size: 64, offset: 1344)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !804, file: !805, line: 305, baseType: !25, size: 64, offset: 1408)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !804, file: !805, line: 306, baseType: !321, size: 64, offset: 1472)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !804, file: !805, line: 308, baseType: !23, size: 32, offset: 1536)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !804, file: !805, line: 310, baseType: !848, size: 160, offset: 1568)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 160, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 20)
!851 = !DILocalVariable(name: "i", scope: !852, file: !3, line: 198, type: !23)
!852 = distinct !DILexicalBlock(scope: !731, file: !3, line: 198, column: 2)
!853 = !DILocalVariable(name: "j", scope: !852, file: !3, line: 198, type: !23)
!854 = !DILocalVariable(name: "nw", scope: !855, file: !3, line: 199, type: !23)
!855 = distinct !DILexicalBlock(scope: !856, file: !3, line: 198, column: 60)
!856 = distinct !DILexicalBlock(scope: !852, file: !3, line: 198, column: 2)
!857 = !DILocalVariable(name: "n", scope: !855, file: !3, line: 199, type: !23)
!858 = !DILocalVariable(name: "w", scope: !855, file: !3, line: 199, type: !23)
!859 = !DILocalVariable(name: "traceback", scope: !855, file: !3, line: 199, type: !23)
!860 = !DILocalVariable(name: "new_nw", scope: !855, file: !3, line: 221, type: !23)
!861 = !DILocalVariable(name: "new_w", scope: !855, file: !3, line: 221, type: !23)
!862 = !DILocalVariable(name: "new_n", scope: !855, file: !3, line: 221, type: !23)
!863 = !DILocation(line: 82, column: 19, scope: !731)
!864 = !DILocation(line: 82, column: 32, scope: !731)
!865 = !DILocation(line: 86, column: 2, scope: !731)
!866 = !DILocation(line: 89, column: 9, scope: !731)
!867 = !DILocation(line: 93, column: 11, scope: !868)
!868 = distinct !DILexicalBlock(scope: !731, file: !3, line: 93, column: 6)
!869 = !DILocation(line: 93, column: 6, scope: !731)
!870 = !DILocation(line: 100, column: 2, scope: !871)
!871 = distinct !DILexicalBlock(scope: !868, file: !3, line: 99, column: 9)
!872 = !DILocation(line: 95, column: 19, scope: !873)
!873 = distinct !DILexicalBlock(scope: !868, file: !3, line: 94, column: 2)
!874 = !DILocation(line: 278, column: 1, scope: !305, inlinedAt: !875)
!875 = distinct !DILocation(line: 95, column: 14, scope: !873)
!876 = !DILocation(line: 280, column: 16, scope: !305, inlinedAt: !875)
!877 = !DILocation(line: 84, column: 9, scope: !731)
!878 = !DILocation(line: 84, column: 19, scope: !731)
!879 = !DILocation(line: 97, column: 18, scope: !873)
!880 = !DILocation(line: 278, column: 1, scope: !305, inlinedAt: !881)
!881 = distinct !DILocation(line: 97, column: 13, scope: !873)
!882 = !DILocation(line: 280, column: 16, scope: !305, inlinedAt: !881)
!883 = !DILocation(line: 84, column: 29, scope: !731)
!884 = !DILocation(line: 103, column: 10, scope: !885)
!885 = distinct !DILexicalBlock(scope: !731, file: !3, line: 103, column: 5)
!886 = !DILocation(line: 278, column: 1, scope: !305, inlinedAt: !887)
!887 = distinct !DILocation(line: 103, column: 5, scope: !885)
!888 = !DILocation(line: 280, column: 16, scope: !305, inlinedAt: !887)
!889 = !DILocation(line: 103, column: 21, scope: !885)
!890 = !DILocation(line: 103, column: 5, scope: !731)
!891 = !DILocation(line: 104, column: 10, scope: !892)
!892 = distinct !DILexicalBlock(scope: !885, file: !3, line: 103, column: 25)
!893 = !DILocation(line: 104, column: 2, scope: !892)
!894 = !DILocation(line: 105, column: 2, scope: !892)
!895 = !DILocation(line: 109, column: 22, scope: !731)
!896 = !DILocation(line: 111, column: 39, scope: !731)
!897 = !DILocation(line: 111, column: 30, scope: !731)
!898 = !DILocation(line: 111, column: 50, scope: !731)
!899 = !DILocation(line: 111, column: 22, scope: !731)
!900 = !DILocation(line: 111, column: 15, scope: !731)
!901 = !DILocation(line: 85, column: 45, scope: !731)
!902 = !DILocation(line: 112, column: 29, scope: !731)
!903 = !DILocation(line: 112, column: 22, scope: !731)
!904 = !DILocation(line: 85, column: 10, scope: !731)
!905 = !DILocation(line: 113, column: 27, scope: !731)
!906 = !DILocation(line: 113, column: 20, scope: !731)
!907 = !DILocation(line: 85, column: 27, scope: !731)
!908 = !DILocation(line: 116, column: 7, scope: !909)
