; ModuleID = 'bicg.cu'
source_filename = "bicg.cu"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timezone = type { i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.cudaDeviceProp = type { [256 x i8], i64, i64, i32, i32, i64, i32, [3 x i32], [3 x i32], i32, i64, i32, i32, i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [2 x i32], [3 x i32], [2 x i32], [3 x i32], [3 x i32], i32, [2 x i32], [3 x i32], [2 x i32], i32, [2 x i32], [3 x i32], [2 x i32], [3 x i32], i32, [2 x i32], i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32 }
%struct.dim3 = type { i32, i32, i32 }
%struct.CUstream_st = type opaque

@.str = private unnamed_addr constant [35 x i8] c"Error return from gettimeofday: %d\00", align 1
@NX = local_unnamed_addr global i32 -1, align 4, !dbg !0
@NY = local_unnamed_addr global i32 -1, align 4, !dbg !27
@.str.1 = private unnamed_addr constant [74 x i8] c"Non-Matching CPU-GPU Outputs Beyond Error Threshold of %4.2f Percent: %d\0A\00", align 1
@.str.2 = private unnamed_addr constant [32 x i8] c"setting device %d with name %s\0A\00", align 1

!232 = !DISubprogram(name: "atan2", scope: !224, file: !224, line: 60, type: !233, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!233 = !DISubroutineType(types: !234)
!234 = !{!173, !173, !173}
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !236, line: 180)
!236 = !DISubprogram(name: "ceil", scope: !224, file: !224, line: 178, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !238, line: 199)
!238 = !DISubprogram(name: "cos", scope: !224, file: !224, line: 63, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !240, line: 218)
!240 = !DISubprogram(name: "cosh", scope: !224, file: !224, line: 72, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !242, line: 237)
!242 = !DISubprogram(name: "exp", scope: !224, file: !224, line: 100, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !244, line: 256)
!244 = !DISubprogram(name: "fabs", scope: !224, file: !224, line: 181, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !246, line: 275)
!246 = !DISubprogram(name: "floor", scope: !224, file: !224, line: 184, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !248, line: 294)
!248 = !DISubprogram(name: "fmod", scope: !224, file: !224, line: 187, type: !233, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !250, line: 315)
!250 = !DISubprogram(name: "frexp", scope: !224, file: !224, line: 103, type: !251, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!251 = !DISubroutineType(types: !252)
!252 = !{!173, !173, !99}
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !254, line: 334)
!254 = !DISubprogram(name: "ldexp", scope: !224, file: !224, line: 106, type: !255, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!255 = !DISubroutineType(types: !256)
!256 = !{!173, !173, !22}
!257 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !258, line: 353)
!258 = !DISubprogram(name: "log", scope: !224, file: !224, line: 109, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !260, line: 372)
!260 = !DISubprogram(name: "log10", scope: !224, file: !224, line: 112, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!261 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !262, line: 391)
!262 = !DISubprogram(name: "modf", scope: !224, file: !224, line: 115, type: !263, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!263 = !DISubroutineType(types: !264)
!264 = !{!173, !173, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !267, line: 403)
!267 = !DISubprogram(name: "pow", scope: !224, file: !224, line: 153, type: !233, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !269, line: 440)
!269 = !DISubprogram(name: "sin", scope: !224, file: !224, line: 65, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !271, line: 459)
!271 = !DISubprogram(name: "sinh", scope: !224, file: !224, line: 74, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !273, line: 478)
!273 = !DISubprogram(name: "sqrt", scope: !224, file: !224, line: 156, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !275, line: 497)
!275 = !DISubprogram(name: "tan", scope: !224, file: !224, line: 67, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !277, line: 516)
!277 = !DISubprogram(name: "tanh", scope: !224, file: !224, line: 76, type: !225, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !279, line: 118)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !280, line: 101, baseType: !281)
!280 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!281 = !DICompositeType(tag: DW_TAG_structure_type, file: !280, line: 97, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !283, line: 119)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !280, line: 109, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !280, line: 105, size: 128, elements: !285, identifier: "_ZTS6ldiv_t")
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !284, file: !280, line: 107, baseType: !133, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !284, file: !280, line: 108, baseType: !133, size: 64, offset: 64)
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !289, line: 121)
!289 = !DISubprogram(name: "abort", scope: !280, file: !280, line: 515, type: !290, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!290 = !DISubroutineType(types: !291)
!291 = !{null}
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !293, line: 122)
!293 = !DISubprogram(name: "abs", scope: !280, file: !280, line: 775, type: !294, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!294 = !DISubroutineType(types: !295)
!295 = !{!22, !22}
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !297, line: 123)
!297 = !DISubprogram(name: "atexit", scope: !280, file: !280, line: 519, type: !298, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!298 = !DISubroutineType(types: !299)
!299 = !{!22, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !302, line: 129)
!302 = !DISubprogram(name: "atof", scope: !303, file: !303, line: 26, type: !171, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!303 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !305, line: 130)
!305 = distinct !DISubprogram(name: "atoi", scope: !280, file: !280, line: 278, type: !306, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{!22, !174}
!308 = !{!309}
!309 = !DILocalVariable(name: "__nptr", arg: 1, scope: !305, file: !280, line: 278, type: !174)
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !311, line: 131)
!311 = !DISubprogram(name: "atol", scope: !280, file: !280, line: 283, type: !312, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!312 = !DISubroutineType(types: !313)
!313 = !{!133, !174}
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !315, line: 132)
!315 = !DISubprogram(name: "bsearch", scope: !316, file: !316, line: 20, type: !317, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!317 = !DISubroutineType(types: !318)
!318 = !{!17, !319, !319, !18, !18, !321}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !280, line: 742, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!22, !319, !319}
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !326, line: 133)
!326 = !DISubprogram(name: "calloc", scope: !280, file: !280, line: 468, type: !327, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!327 = !DISubroutineType(types: !328)
!328 = !{!17, !18, !18}
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !330, line: 134)
!330 = !DISubprogram(name: "div", scope: !280, file: !280, line: 789, type: !331, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{!279, !22, !22}
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !334, line: 135)
!334 = !DISubprogram(name: "exit", scope: !280, file: !280, line: 543, type: !335, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !22}
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !338, line: 136)
!338 = !DISubprogram(name: "free", scope: !280, file: !280, line: 483, type: !339, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !17}
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !342, line: 137)
!342 = !DISubprogram(name: "getenv", scope: !280, file: !280, line: 564, type: !343, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!343 = !DISubroutineType(types: !344)
!344 = !{!24, !174}
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !346, line: 138)
!346 = !DISubprogram(name: "labs", scope: !280, file: !280, line: 776, type: !131, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !348, line: 139)
!348 = !DISubprogram(name: "ldiv", scope: !280, file: !280, line: 791, type: !349, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!349 = !DISubroutineType(types: !350)
!350 = !{!283, !133, !133}
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !352, line: 140)
!352 = !DISubprogram(name: "malloc", scope: !280, file: !280, line: 466, type: !353, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{!17, !18}
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !356, line: 142)
!356 = !DISubprogram(name: "mblen", scope: !280, file: !280, line: 863, type: !357, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!357 = !DISubroutineType(types: !358)
!358 = !{!22, !174, !18}
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !360, line: 143)
!360 = !DISubprogram(name: "mbstowcs", scope: !280, file: !280, line: 874, type: !361, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!361 = !DISubroutineType(types: !362)
!362 = !{!18, !363, !366, !18}
!363 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!366 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !174)
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !368, line: 144)
!368 = !DISubprogram(name: "mbtowc", scope: !280, file: !280, line: 866, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!369 = !DISubroutineType(types: !370)
!370 = !{!22, !363, !366, !18}
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !372, line: 146)
!372 = !DISubprogram(name: "qsort", scope: !280, file: !280, line: 765, type: !373, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !17, !18, !18, !321}
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !376, line: 152)
!376 = !DISubprogram(name: "rand", scope: !280, file: !280, line: 374, type: !377, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!377 = !DISubroutineType(types: !378)
!378 = !{!22}
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !380, line: 153)
!380 = !DISubprogram(name: "realloc", scope: !280, file: !280, line: 480, type: !381, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!381 = !DISubroutineType(types: !382)
!382 = !{!17, !17, !18}
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !384, line: 154)
!384 = !DISubprogram(name: "srand", scope: !280, file: !280, line: 376, type: !385, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !387}
!387 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !389, line: 155)
!389 = !DISubprogram(name: "strtod", scope: !280, file: !280, line: 164, type: !390, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!390 = !DISubroutineType(types: !391)
!391 = !{!173, !366, !392}
!392 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !23)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !394, line: 156)
!394 = !DISubprogram(name: "strtol", scope: !280, file: !280, line: 183, type: !395, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!395 = !DISubroutineType(types: !396)
!396 = !{!133, !366, !392, !22}
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !398, line: 157)
!398 = !DISubprogram(name: "strtoul", scope: !280, file: !280, line: 187, type: !399, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!399 = !DISubroutineType(types: !400)
!400 = !{!20, !366, !392, !22}
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !402, line: 158)
!402 = !DISubprogram(name: "system", scope: !280, file: !280, line: 717, type: !306, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !404, line: 160)
!404 = !DISubprogram(name: "wcstombs", scope: !280, file: !280, line: 877, type: !405, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!405 = !DISubroutineType(types: !406)
!406 = !{!18, !407, !408, !18}
!407 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !24)
!408 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !412, line: 161)
!412 = !DISubprogram(name: "wctomb", scope: !280, file: !280, line: 870, type: !413, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!413 = !DISubroutineType(types: !414)
!414 = !{!22, !24, !365}
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !416, entity: !418, line: 201)
!416 = !DINamespace(name: "__gnu_cxx", scope: null, file: !417, line: 68)
!417 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/bits/cpp_type_traits.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !280, line: 121, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !280, line: 117, size: 128, elements: !420, identifier: "_ZTS7lldiv_t")
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !419, file: !280, line: 119, baseType: !36, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !419, file: !280, line: 120, baseType: !36, size: 64, offset: 64)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !416, entity: !424, line: 207)
!424 = !DISubprogram(name: "_Exit", scope: !280, file: !280, line: 557, type: !335, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !416, entity: !426, line: 211)
!426 = !DISubprogram(name: "llabs", scope: !280, file: !280, line: 780, type: !34, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !416, entity: !428, line: 217)
!428 = !DISubprogram(name: "lldiv", scope: !280, file: !280, line: 797, type: !429, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!429 = !DISubroutineType(types: !430)
!430 = !{!418, !36, !36}
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !416, entity: !432, line: 228)
!432 = !DISubprogram(name: "atoll", scope: !280, file: !280, line: 292, type: !433, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!433 = !DISubroutineType(types: !434)
!434 = !{!36, !174}
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !416, entity: !436, line: 229)
!436 = !DISubprogram(name: "strtoll", scope: !280, file: !280, line: 209, type: !437, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!437 = !DISubroutineType(types: !438)
!438 = !{!36, !366, !392, !22}
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !416, entity: !440, line: 230)
!440 = !DISubprogram(name: "strtoull", scope: !280, file: !280, line: 214, type: !441, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!441 = !DISubroutineType(types: !442)
!442 = !{!443, !366, !392, !22}
!443 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !416, entity: !445, line: 232)
!445 = !DISubprogram(name: "strtof", scope: !280, file: !280, line: 172, type: !446, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!446 = !DISubroutineType(types: !447)
!447 = !{!15, !366, !392}
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !416, entity: !449, line: 233)
!449 = !DISubprogram(name: "strtold", scope: !280, file: !280, line: 175, type: !450, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!450 = !DISubroutineType(types: !451)
!451 = !{!452, !366, !392}
!452 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !418, line: 241)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !424, line: 243)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !426, line: 245)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !457, line: 246)
!457 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !416, file: !458, line: 214, type: !429, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!458 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/cstdlib", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !428, line: 247)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !432, line: 249)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !445, line: 250)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !436, line: 251)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !440, line: 252)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !449, line: 253)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !466, line: 418)
!466 = !DISubprogram(name: "acosf", linkageName: "_ZL5acosff", scope: !467, file: !467, line: 1126, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!467 = !DIFile(filename: "/usr/local/cuda/include/math_functions.hpp", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !469, line: 419)
!469 = !DISubprogram(name: "acoshf", linkageName: "_ZL6acoshff", scope: !467, file: !467, line: 1154, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !471, line: 420)
!471 = !DISubprogram(name: "asinf", linkageName: "_ZL5asinff", scope: !467, file: !467, line: 1121, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !473, line: 421)
!473 = !DISubprogram(name: "asinhf", linkageName: "_ZL6asinhff", scope: !467, file: !467, line: 1159, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !475, line: 422)
!475 = !DISubprogram(name: "atan2f", linkageName: "_ZL6atan2fff", scope: !467, file: !467, line: 1111, type: !51, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !477, line: 423)
!477 = !DISubprogram(name: "atanf", linkageName: "_ZL5atanff", scope: !467, file: !467, line: 1116, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !479, line: 424)
!479 = !DISubprogram(name: "atanhf", linkageName: "_ZL6atanhff", scope: !467, file: !467, line: 1164, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !481, line: 425)
!481 = !DISubprogram(name: "cbrtf", linkageName: "_ZL5cbrtff", scope: !467, file: !467, line: 1199, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !483, line: 426)
!483 = !DISubprogram(name: "ceilf", linkageName: "_ZL5ceilff", scope: !484, file: !484, line: 647, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!484 = !DIFile(filename: "/usr/local/cuda/include/device_functions.hpp", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !486, line: 427)
!486 = !DISubprogram(name: "copysignf", linkageName: "_ZL9copysignfff", scope: !467, file: !467, line: 973, type: !51, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !488, line: 428)
!488 = !DISubprogram(name: "cosf", linkageName: "_ZL4cosff", scope: !467, file: !467, line: 1027, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !490, line: 429)
!490 = !DISubprogram(name: "coshf", linkageName: "_ZL5coshff", scope: !467, file: !467, line: 1096, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !492, line: 430)
!492 = !DISubprogram(name: "erfcf", linkageName: "_ZL5erfcff", scope: !467, file: !467, line: 1259, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !494, line: 431)
!494 = !DISubprogram(name: "erff", linkageName: "_ZL4erfff", scope: !467, file: !467, line: 1249, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !496, line: 432)
!496 = !DISubprogram(name: "exp2f", linkageName: "_ZL5exp2ff", scope: !484, file: !484, line: 637, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !498, line: 433)
!498 = !DISubprogram(name: "expf", linkageName: "_ZL4expff", scope: !467, file: !467, line: 1078, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !500, line: 434)
!500 = !DISubprogram(name: "expm1f", linkageName: "_ZL6expm1ff", scope: !467, file: !467, line: 1169, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !502, line: 435)
!502 = !DISubprogram(name: "fabsf", linkageName: "_ZL5fabsff", scope: !484, file: !484, line: 582, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !504, line: 436)
!504 = !DISubprogram(name: "fdimf", linkageName: "_ZL5fdimfff", scope: !467, file: !467, line: 1385, type: !51, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !506, line: 437)
!506 = !DISubprogram(name: "floorf", linkageName: "_ZL6floorff", scope: !484, file: !484, line: 572, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !508, line: 438)
!508 = !DISubprogram(name: "fmaf", linkageName: "_ZL4fmaffff", scope: !467, file: !467, line: 1337, type: !83, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !510, line: 439)
!510 = !DISubprogram(name: "fmaxf", linkageName: "_ZL5fmaxfff", scope: !484, file: !484, line: 602, type: !51, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !512, line: 440)
!512 = !DISubprogram(name: "fminf", linkageName: "_ZL5fminfff", scope: !484, file: !484, line: 597, type: !51, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !514, line: 441)
!514 = !DISubprogram(name: "fmodf", linkageName: "_ZL5fmodfff", scope: !467, file: !467, line: 1322, type: !51, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !516, line: 442)
!516 = !DISubprogram(name: "frexpf", linkageName: "_ZL6frexpffPi", scope: !467, file: !467, line: 1312, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !518, line: 443)
!518 = !DISubprogram(name: "hypotf", linkageName: "_ZL6hypotfff", scope: !467, file: !467, line: 1174, type: !51, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !520, line: 444)
!520 = !DISubprogram(name: "ilogbf", linkageName: "_ZL6ilogbff", scope: !467, file: !467, line: 1390, type: !93, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !522, line: 445)
!522 = !DISubprogram(name: "ldexpf", linkageName: "_ZL6ldexpffi", scope: !467, file: !467, line: 1289, type: !136, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !524, line: 446)
!524 = !DISubprogram(name: "lgammaf", linkageName: "_ZL7lgammaff", scope: !467, file: !467, line: 1284, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !526, line: 447)
!526 = !DISubprogram(name: "llrintf", linkageName: "_ZL7llrintff", scope: !467, file: !467, line: 933, type: !144, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !528, line: 448)
!528 = !DISubprogram(name: "llroundf", linkageName: "_ZL8llroundff", scope: !467, file: !467, line: 1371, type: !144, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !530, line: 449)
!530 = !DISubprogram(name: "log10f", linkageName: "_ZL6log10ff", scope: !467, file: !467, line: 1140, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !532, line: 450)
!532 = !DISubprogram(name: "log1pf", linkageName: "_ZL6log1pff", scope: !467, file: !467, line: 1149, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !534, line: 451)
!534 = !DISubprogram(name: "log2f", linkageName: "_ZL5log2ff", scope: !467, file: !467, line: 1069, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !536, line: 452)
!536 = !DISubprogram(name: "logbf", linkageName: "_ZL5logbff", scope: !467, file: !467, line: 1395, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !538, line: 453)
!538 = !DISubprogram(name: "logf", linkageName: "_ZL4logff", scope: !467, file: !467, line: 1131, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !540, line: 454)
!540 = !DISubprogram(name: "lrintf", linkageName: "_ZL6lrintff", scope: !467, file: !467, line: 924, type: !158, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !542, line: 455)
!542 = !DISubprogram(name: "lroundf", linkageName: "_ZL7lroundff", scope: !467, file: !467, line: 1376, type: !158, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !544, line: 456)
!544 = !DISubprogram(name: "modff", linkageName: "_ZL5modfffPf", scope: !467, file: !467, line: 1317, type: !166, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !546, line: 457)
!546 = !DISubprogram(name: "nearbyintf", linkageName: "_ZL10nearbyintff", scope: !467, file: !467, line: 938, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !548, line: 458)
!548 = !DISubprogram(name: "nextafterf", linkageName: "_ZL10nextafterfff", scope: !467, file: !467, line: 1002, type: !51, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !550, line: 459)
!550 = !DISubprogram(name: "nexttowardf", scope: !224, file: !224, line: 284, type: !551, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!551 = !DISubroutineType(types: !552)
!552 = !{!15, !15, !452}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !550, line: 460)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !555, line: 461)
!555 = !DISubprogram(name: "powf", linkageName: "_ZL4powfff", scope: !467, file: !467, line: 1352, type: !51, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !557, line: 462)
!557 = !DISubprogram(name: "remainderf", linkageName: "_ZL10remainderfff", scope: !467, file: !467, line: 1327, type: !51, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !559, line: 463)
!559 = !DISubprogram(name: "remquof", linkageName: "_ZL7remquofffPi", scope: !467, file: !467, line: 1332, type: !194, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !561, line: 464)
!561 = !DISubprogram(name: "rintf", linkageName: "_ZL5rintff", scope: !467, file: !467, line: 919, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !563, line: 465)
!563 = !DISubprogram(name: "roundf", linkageName: "_ZL6roundff", scope: !467, file: !467, line: 1366, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !565, line: 466)
!565 = !DISubprogram(name: "scalblnf", linkageName: "_ZL8scalblnffl", scope: !467, file: !467, line: 1299, type: !202, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !567, line: 467)
!567 = !DISubprogram(name: "scalbnf", linkageName: "_ZL7scalbnffi", scope: !467, file: !467, line: 1294, type: !136, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !569, line: 468)
!569 = !DISubprogram(name: "sinf", linkageName: "_ZL4sinff", scope: !467, file: !467, line: 1018, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !571, line: 469)
!571 = !DISubprogram(name: "sinhf", linkageName: "_ZL5sinhff", scope: !467, file: !467, line: 1101, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !573, line: 470)
!573 = !DISubprogram(name: "sqrtf", linkageName: "_ZL5sqrtff", scope: !484, file: !484, line: 887, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !575, line: 471)
!575 = !DISubprogram(name: "tanf", linkageName: "_ZL4tanff", scope: !467, file: !467, line: 1060, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !577, line: 472)
!577 = !DISubprogram(name: "tanhf", linkageName: "_ZL5tanhff", scope: !467, file: !467, line: 1106, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !579, line: 473)
!579 = !DISubprogram(name: "tgammaf", linkageName: "_ZL7tgammaff", scope: !467, file: !467, line: 1361, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !31, entity: !581, line: 474)
!581 = !DISubprogram(name: "truncf", linkageName: "_ZL6truncff", scope: !484, file: !484, line: 642, type: !39, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!582 = !{i32 2, !"Dwarf Version", i32 4}
!583 = !{i32 2, !"Debug Info Version", i32 3}
!584 = !{!"clang version 5.0.0 (trunk 294196)"}
!585 = distinct !DISubprogram(name: "rtclock", linkageName: "_Z7rtclockv", scope: !586, file: !586, line: 11, type: !587, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !589)
!586 = !DIFile(filename: "./../../common/polybenchUtilFuncts.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!587 = !DISubroutineType(types: !588)
!588 = !{!173}
!589 = !{!590, !596, !605}
!590 = !DILocalVariable(name: "Tzp", scope: !585, file: !586, line: 13, type: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !592, line: 55, size: 64, elements: !593, identifier: "_ZTS8timezone")
!592 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/time.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !591, file: !592, line: 57, baseType: !22, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !591, file: !592, line: 58, baseType: !22, size: 32, offset: 32)
!596 = !DILocalVariable(name: "Tp", scope: !585, file: !586, line: 14, type: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !598, line: 30, size: 128, elements: !599, identifier: "_ZTS7timeval")
!598 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!599 = !{!600, !603}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !597, file: !598, line: 32, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !602, line: 139, baseType: !133)
!602 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !597, file: !598, line: 33, baseType: !604, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !602, line: 141, baseType: !133)
!605 = !DILocalVariable(name: "stat", scope: !585, file: !586, line: 15, type: !22)
!606 = !DILocation(line: 13, column: 5, scope: !585)
!607 = !DILocation(line: 14, column: 5, scope: !585)
!608 = !DIExpression(DW_OP_deref)
!609 = !DILocation(line: 13, column: 21, scope: !585)
!610 = !DILocation(line: 14, column: 20, scope: !585)
!611 = !DILocation(line: 16, column: 12, scope: !585)
!612 = !DIExpression()
!613 = !DILocation(line: 15, column: 9, scope: !585)
!614 = !DILocation(line: 17, column: 14, scope: !615)
!615 = distinct !DILexicalBlock(scope: !585, file: !586, line: 17, column: 9)
!616 = !DILocation(line: 17, column: 9, scope: !585)
!617 = !DILocation(line: 17, column: 20, scope: !618)
!618 = !DILexicalBlockFile(scope: !615, file: !586, discriminator: 1)
!619 = !DILocation(line: 18, column: 15, scope: !585)
!620 = !{!621, !622, i64 0}
!621 = !{!"_ZTS7timeval", !622, i64 0, !622, i64 8}
!622 = !{!"long", !623, i64 0}
!623 = !{!"omnipotent char", !624, i64 0}
!624 = !{!"Simple C++ TBAA"}
!625 = !DILocation(line: 18, column: 12, scope: !585)
!626 = !DILocation(line: 18, column: 27, scope: !585)
!627 = !{!621, !622, i64 8}
!628 = !DILocation(line: 18, column: 24, scope: !585)
!629 = !DILocation(line: 18, column: 34, scope: !585)
!630 = !DILocation(line: 18, column: 22, scope: !585)
!631 = !DILocation(line: 19, column: 1, scope: !585)
!632 = !DILocation(line: 18, column: 5, scope: !585)
!633 = distinct !DISubprogram(name: "absVal", linkageName: "_Z6absValf", scope: !586, file: !586, line: 22, type: !39, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !634)
!634 = !{!635}
!635 = !DILocalVariable(name: "a", arg: 1, scope: !633, file: !586, line: 22, type: !15)
!636 = !DILocation(line: 22, column: 20, scope: !633)
!637 = !DILocation(line: 24, column: 7, scope: !638)
!638 = distinct !DILexicalBlock(scope: !633, file: !586, line: 24, column: 5)
!639 = !DILocation(line: 26, column: 13, scope: !640)
!640 = distinct !DILexicalBlock(scope: !638, file: !586, line: 25, column: 2)
!641 = !DILocation(line: 24, column: 5, scope: !633)
!642 = !DILocation(line: 32, column: 1, scope: !633)
!643 = distinct !DISubprogram(name: "percentDiff", linkageName: "_Z11percentDiffdd", scope: !586, file: !586, line: 36, type: !644, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !646)
!644 = !DISubroutineType(types: !645)
!645 = !{!15, !173, !173}
!646 = !{!647, !648}
!647 = !DILocalVariable(name: "val1", arg: 1, scope: !643, file: !586, line: 36, type: !173)
!648 = !DILocalVariable(name: "val2", arg: 2, scope: !643, file: !586, line: 36, type: !173)
!649 = !DILocation(line: 36, column: 26, scope: !643)
!650 = !DILocation(line: 36, column: 39, scope: !643)
!651 = !DILocation(line: 38, column: 14, scope: !652)
!652 = distinct !DILexicalBlock(scope: !643, file: !586, line: 38, column: 6)
!653 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !654)
!654 = distinct !DILocation(line: 38, column: 7, scope: !652)
!655 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !654)
!656 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !654)
!657 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !654)
!658 = !DILocation(line: 38, column: 7, scope: !652)
!659 = !DILocation(line: 38, column: 20, scope: !652)
!660 = !DILocation(line: 38, column: 28, scope: !652)
!661 = !DILocation(line: 38, column: 39, scope: !662)
!662 = !DILexicalBlockFile(scope: !652, file: !586, discriminator: 1)
!663 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !664)
!664 = distinct !DILocation(line: 38, column: 32, scope: !662)
!665 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !664)
!666 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !664)
!667 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !664)
!668 = !DILocation(line: 38, column: 32, scope: !662)
!669 = !DILocation(line: 38, column: 45, scope: !662)
!670 = !DILocation(line: 38, column: 6, scope: !671)
!671 = !DILexicalBlockFile(scope: !643, file: !586, discriminator: 1)
!672 = !DILocation(line: 45, column: 43, scope: !673)
!673 = distinct !DILexicalBlock(scope: !652, file: !586, line: 44, column: 2)
!674 = !DILocation(line: 45, column: 38, scope: !673)
!675 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !676)
!676 = distinct !DILocation(line: 45, column: 31, scope: !673)
!677 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !676)
!678 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !676)
!679 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !676)
!680 = !DILocation(line: 45, column: 65, scope: !673)
!681 = !DILocation(line: 45, column: 60, scope: !673)
!682 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !683)
!683 = distinct !DILocation(line: 45, column: 53, scope: !684)
!684 = !DILexicalBlockFile(scope: !673, file: !586, discriminator: 1)
!685 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !683)
!686 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !683)
!687 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !683)
!688 = !DILocation(line: 45, column: 51, scope: !673)
!689 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !690)
!690 = distinct !DILocation(line: 45, column: 24, scope: !691)
!691 = !DILexicalBlockFile(scope: !673, file: !586, discriminator: 2)
!692 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !690)
!693 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !690)
!694 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !690)
!695 = !DILocation(line: 45, column: 21, scope: !673)
!696 = !DILocation(line: 45, column: 7, scope: !673)
!697 = !DILocation(line: 47, column: 1, scope: !643)
!698 = distinct !DISubprogram(name: "init_array", linkageName: "_Z10init_arrayPfS_S_", scope: !3, file: !3, line: 46, type: !699, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !701)
!699 = !DISubroutineType(types: !700)
!700 = !{null, !21, !21, !21}
!701 = !{!702, !703, !704, !705, !706}
!702 = !DILocalVariable(name: "A", arg: 1, scope: !698, file: !3, line: 46, type: !21)
!703 = !DILocalVariable(name: "p", arg: 2, scope: !698, file: !3, line: 46, type: !21)
!704 = !DILocalVariable(name: "r", arg: 3, scope: !698, file: !3, line: 46, type: !21)
!705 = !DILocalVariable(name: "i", scope: !698, file: !3, line: 48, type: !22)
!706 = !DILocalVariable(name: "j", scope: !698, file: !3, line: 48, type: !22)
!707 = !DILocation(line: 46, column: 28, scope: !698)
!708 = !DILocation(line: 46, column: 42, scope: !698)
!709 = !DILocation(line: 46, column: 56, scope: !698)
!710 = !DILocation(line: 48, column: 6, scope: !698)
!711 = !DILocation(line: 50, column: 20, scope: !712)
!712 = !DILexicalBlockFile(scope: !713, file: !3, discriminator: 1)
!713 = distinct !DILexicalBlock(scope: !714, file: !3, line: 50, column: 4)
!714 = distinct !DILexicalBlock(scope: !698, file: !3, line: 50, column: 4)
!715 = !{!716, !716, i64 0}
!716 = !{!"int", !623, i64 0}
!717 = !DILocation(line: 50, column: 18, scope: !712)
!718 = !DILocation(line: 50, column: 4, scope: !719)
!719 = !DILexicalBlockFile(scope: !714, file: !3, discriminator: 1)
!720 = !DILocation(line: 60, column: 18, scope: !721)
!721 = !DILexicalBlockFile(scope: !722, file: !3, discriminator: 1)
!722 = distinct !DILexicalBlock(scope: !723, file: !3, line: 60, column: 2)
!723 = distinct !DILexicalBlock(scope: !698, file: !3, line: 60, column: 2)
!724 = !DILocation(line: 60, column: 16, scope: !721)
!725 = !DILocation(line: 60, column: 2, scope: !726)
!726 = !DILexicalBlockFile(scope: !723, file: !3, discriminator: 1)
!727 = !DILocation(line: 62, column: 14, scope: !728)
!728 = distinct !DILexicalBlock(scope: !722, file: !3, line: 61, column: 2)
!729 = !DILocation(line: 62, column: 16, scope: !728)
!730 = !DILocation(line: 62, column: 7, scope: !728)
!731 = !DILocation(line: 62, column: 12, scope: !728)
!732 = !{!733, !733, i64 0}
!733 = !{!"float", !623, i64 0}
!734 = !DILocation(line: 60, column: 23, scope: !735)
!735 = !DILexicalBlockFile(scope: !722, file: !3, discriminator: 2)
!736 = distinct !{!736, !737}
!737 = !{!"llvm.loop.unroll.disable"}
!738 = !DILocation(line: 52, column: 14, scope: !739)
!739 = distinct !DILexicalBlock(scope: !713, file: !3, line: 51, column: 2)
!740 = !DILocation(line: 52, column: 16, scope: !739)
!741 = !DILocation(line: 52, column: 7, scope: !739)
!742 = !DILocation(line: 52, column: 12, scope: !739)
!743 = !DILocation(line: 48, column: 9, scope: !698)
!744 = !DILocation(line: 54, column: 7, scope: !745)
!745 = !DILexicalBlockFile(scope: !746, file: !3, discriminator: 1)
!746 = distinct !DILexicalBlock(scope: !739, file: !3, line: 54, column: 7)
!747 = !DILocation(line: 54, column: 28, scope: !748)
!748 = !DILexicalBlockFile(scope: !749, file: !3, discriminator: 2)
!749 = distinct !DILexicalBlock(scope: !746, file: !3, line: 54, column: 7)
!750 = !DILocation(line: 56, column: 39, scope: !751)
!751 = distinct !DILexicalBlock(scope: !749, file: !3, line: 55, column: 3)
!752 = !DILocation(line: 56, column: 38, scope: !751)
!753 = !DILocation(line: 56, column: 42, scope: !751)
!754 = !DILocation(line: 56, column: 17, scope: !751)
!755 = !DILocation(line: 56, column: 10, scope: !751)
!756 = !DILocation(line: 56, column: 22, scope: !751)
!757 = distinct !{!757, !758, !759, !760, !761}
!758 = !DILocation(line: 54, column: 7, scope: !746)
!759 = !DILocation(line: 57, column: 3, scope: !746)
!760 = !{!"llvm.loop.vectorize.width", i32 1}
!761 = !{!"llvm.loop.interleave.count", i32 1}
!762 = !DILocation(line: 54, column: 21, scope: !763)
!763 = !DILexicalBlockFile(scope: !749, file: !3, discriminator: 1)
!764 = distinct !{!764, !758, !759, !765, !760, !761}
!765 = !{!"llvm.loop.unroll.runtime.disable"}
!766 = !DILocation(line: 50, column: 25, scope: !767)
!767 = !DILexicalBlockFile(scope: !713, file: !3, discriminator: 2)
!768 = distinct !{!768, !769, !770}
!769 = !DILocation(line: 50, column: 4, scope: !714)
!770 = !DILocation(line: 58, column: 3, scope: !714)
!771 = distinct !{!771, !772, !773}
!772 = !DILocation(line: 60, column: 2, scope: !723)
!773 = !DILocation(line: 63, column: 2, scope: !723)
!774 = !DILocation(line: 64, column: 1, scope: !698)
!775 = distinct !DISubprogram(name: "compareResults", linkageName: "_Z14compareResultsPfS_S_S_", scope: !3, file: !3, line: 67, type: !776, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !778)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !21, !21, !21, !21}
!778 = !{!779, !780, !781, !782, !783, !784}
!779 = !DILocalVariable(name: "s", arg: 1, scope: !775, file: !3, line: 67, type: !21)
!780 = !DILocalVariable(name: "s_outputFromGpu", arg: 2, scope: !775, file: !3, line: 67, type: !21)
!781 = !DILocalVariable(name: "q", arg: 3, scope: !775, file: !3, line: 67, type: !21)
!782 = !DILocalVariable(name: "q_outputFromGpu", arg: 4, scope: !775, file: !3, line: 67, type: !21)
!783 = !DILocalVariable(name: "i", scope: !775, file: !3, line: 69, type: !22)
!784 = !DILocalVariable(name: "fail", scope: !775, file: !3, line: 69, type: !22)
!785 = !DILocation(line: 67, column: 32, scope: !775)
!786 = !DILocation(line: 67, column: 46, scope: !775)
!787 = !DILocation(line: 67, column: 74, scope: !775)
!788 = !DILocation(line: 67, column: 88, scope: !775)
!789 = !DILocation(line: 69, column: 8, scope: !775)
!790 = !DILocation(line: 69, column: 6, scope: !775)
!791 = !DILocation(line: 73, column: 14, scope: !792)
!792 = !DILexicalBlockFile(scope: !793, file: !3, discriminator: 1)
!793 = distinct !DILexicalBlock(scope: !794, file: !3, line: 73, column: 2)
!794 = distinct !DILexicalBlock(scope: !775, file: !3, line: 73, column: 2)
!795 = !DILocation(line: 73, column: 13, scope: !792)
!796 = !DILocation(line: 73, column: 2, scope: !797)
!797 = !DILexicalBlockFile(scope: !794, file: !3, discriminator: 1)
!798 = !DILocation(line: 75, column: 19, scope: !799)
!799 = distinct !DILexicalBlock(scope: !800, file: !3, line: 75, column: 7)
!800 = distinct !DILexicalBlock(scope: !793, file: !3, line: 74, column: 2)
!801 = !DILocation(line: 73, column: 19, scope: !802)
!802 = !DILexicalBlockFile(scope: !793, file: !3, discriminator: 2)
!803 = !DILocation(line: 75, column: 25, scope: !799)
!804 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !805)
!805 = distinct !DILocation(line: 38, column: 7, scope: !652, inlinedAt: !806)
!806 = distinct !DILocation(line: 75, column: 7, scope: !799)
!807 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !805)
!808 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !805)
!809 = !DILocation(line: 38, column: 7, scope: !652, inlinedAt: !806)
!810 = !DILocation(line: 38, column: 20, scope: !652, inlinedAt: !806)
!811 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !812)
!812 = distinct !DILocation(line: 38, column: 32, scope: !662, inlinedAt: !806)
!813 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !812)
!814 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !812)
!815 = !DILocation(line: 38, column: 32, scope: !662, inlinedAt: !806)
!816 = !DILocation(line: 38, column: 45, scope: !662, inlinedAt: !806)
!817 = !DILocation(line: 45, column: 38, scope: !673, inlinedAt: !806)
!818 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !819)
!819 = distinct !DILocation(line: 45, column: 31, scope: !673, inlinedAt: !806)
!820 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !819)
!821 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !819)
!822 = !DILocation(line: 45, column: 60, scope: !673, inlinedAt: !806)
!823 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !824)
!824 = distinct !DILocation(line: 45, column: 53, scope: !684, inlinedAt: !806)
!825 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !824)
!826 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !824)
!827 = !DILocation(line: 45, column: 51, scope: !673, inlinedAt: !806)
!828 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !829)
!829 = distinct !DILocation(line: 45, column: 24, scope: !691, inlinedAt: !806)
!830 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !829)
!831 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !829)
!832 = !DILocation(line: 45, column: 21, scope: !673, inlinedAt: !806)
!833 = !DILocation(line: 75, column: 7, scope: !799)
!834 = !DILocation(line: 75, column: 45, scope: !799)
!835 = !DILocation(line: 75, column: 7, scope: !800)
!836 = distinct !{!836, !837, !838, !760, !761}
!837 = !DILocation(line: 73, column: 2, scope: !794)
!838 = !DILocation(line: 79, column: 2, scope: !794)
!839 = !DILocation(line: 81, column: 14, scope: !840)
!840 = !DILexicalBlockFile(scope: !841, file: !3, discriminator: 1)
!841 = distinct !DILexicalBlock(scope: !842, file: !3, line: 81, column: 2)
!842 = distinct !DILexicalBlock(scope: !775, file: !3, line: 81, column: 2)
!843 = !DILocation(line: 81, column: 13, scope: !840)
!844 = !DILocation(line: 81, column: 2, scope: !845)
!845 = !DILexicalBlockFile(scope: !842, file: !3, discriminator: 1)
!846 = !DILocation(line: 83, column: 19, scope: !847)
!847 = distinct !DILexicalBlock(scope: !848, file: !3, line: 83, column: 7)
!848 = distinct !DILexicalBlock(scope: !841, file: !3, line: 82, column: 2)
!849 = !DILocation(line: 81, column: 19, scope: !850)
!850 = !DILexicalBlockFile(scope: !841, file: !3, discriminator: 2)
!851 = !DILocation(line: 83, column: 25, scope: !847)
!852 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !853)
!853 = distinct !DILocation(line: 38, column: 7, scope: !652, inlinedAt: !854)
!854 = distinct !DILocation(line: 83, column: 7, scope: !847)
!855 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !853)
!856 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !853)
!857 = !DILocation(line: 38, column: 7, scope: !652, inlinedAt: !854)
!858 = !DILocation(line: 38, column: 20, scope: !652, inlinedAt: !854)
!859 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !860)
!860 = distinct !DILocation(line: 38, column: 32, scope: !662, inlinedAt: !854)
!861 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !860)
!862 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !860)
!863 = !DILocation(line: 38, column: 32, scope: !662, inlinedAt: !854)
!864 = !DILocation(line: 38, column: 45, scope: !662, inlinedAt: !854)
!865 = !DILocation(line: 45, column: 38, scope: !673, inlinedAt: !854)
!866 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !867)
!867 = distinct !DILocation(line: 45, column: 31, scope: !673, inlinedAt: !854)
!868 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !867)
!869 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !867)
!870 = !DILocation(line: 45, column: 60, scope: !673, inlinedAt: !854)
!871 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !872)
!872 = distinct !DILocation(line: 45, column: 53, scope: !684, inlinedAt: !854)
!873 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !872)
!874 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !872)
!875 = !DILocation(line: 45, column: 51, scope: !673, inlinedAt: !854)
!876 = !DILocation(line: 24, column: 7, scope: !638, inlinedAt: !877)
!877 = distinct !DILocation(line: 45, column: 24, scope: !691, inlinedAt: !854)
!878 = !DILocation(line: 26, column: 13, scope: !640, inlinedAt: !877)
!879 = !DILocation(line: 24, column: 5, scope: !633, inlinedAt: !877)
!880 = !DILocation(line: 45, column: 21, scope: !673, inlinedAt: !854)
!881 = !DILocation(line: 83, column: 7, scope: !847)
!882 = !DILocation(line: 83, column: 45, scope: !847)
!883 = !DILocation(line: 83, column: 7, scope: !848)
!884 = distinct !{!884, !885, !886, !760, !761}
!885 = !DILocation(line: 81, column: 2, scope: !842)
!886 = !DILocation(line: 87, column: 2, scope: !842)
!887 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !805)
!888 = !DILocation(line: 38, column: 28, scope: !652, inlinedAt: !806)
!889 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !812)
!890 = !DILocation(line: 38, column: 6, scope: !671, inlinedAt: !806)
!891 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !819)
!892 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !824)
!893 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !829)
!894 = !DILocation(line: 45, column: 7, scope: !673, inlinedAt: !806)
!895 = distinct !{!895, !837, !838, !765, !760, !761}
!896 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !853)
!897 = !DILocation(line: 38, column: 28, scope: !652, inlinedAt: !854)
!898 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !860)
!899 = !DILocation(line: 38, column: 6, scope: !671, inlinedAt: !854)
!900 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !867)
!901 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !872)
!902 = !DILocation(line: 22, column: 20, scope: !633, inlinedAt: !877)
!903 = !DILocation(line: 45, column: 7, scope: !673, inlinedAt: !854)
!904 = distinct !{!904, !885, !886, !765, !760, !761}
!905 = !DILocation(line: 90, column: 2, scope: !775)
!906 = !DILocation(line: 91, column: 1, scope: !775)
!907 = distinct !DISubprogram(name: "GPU_argv_init", linkageName: "_Z13GPU_argv_initv", scope: !3, file: !3, line: 94, type: !290, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !908)
!908 = !{!909}
!909 = !DILocalVariable(name: "deviceProp", scope: !907, file: !3, line: 96, type: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cudaDeviceProp", file: !6, line: 1257, size: 5056, elements: !911, identifier: "_ZTS14cudaDeviceProp")
!911 = !{!912, !916, !917, !918, !919, !920, !921, !922, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !910, file: !6, line: 1259, baseType: !913, size: 2048)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 2048, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "totalGlobalMem", scope: !910, file: !6, line: 1260, baseType: !18, size: 64, offset: 2048)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerBlock", scope: !910, file: !6, line: 1261, baseType: !18, size: 64, offset: 2112)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerBlock", scope: !910, file: !6, line: 1262, baseType: !22, size: 32, offset: 2176)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "warpSize", scope: !910, file: !6, line: 1263, baseType: !22, size: 32, offset: 2208)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "memPitch", scope: !910, file: !6, line: 1264, baseType: !18, size: 64, offset: 2240)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerBlock", scope: !910, file: !6, line: 1265, baseType: !22, size: 32, offset: 2304)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsDim", scope: !910, file: !6, line: 1266, baseType: !923, size: 96, offset: 2336)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 96, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 3)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "maxGridSize", scope: !910, file: !6, line: 1267, baseType: !923, size: 96, offset: 2432)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "clockRate", scope: !910, file: !6, line: 1268, baseType: !22, size: 32, offset: 2528)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "totalConstMem", scope: !910, file: !6, line: 1269, baseType: !18, size: 64, offset: 2560)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !910, file: !6, line: 1270, baseType: !22, size: 32, offset: 2624)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !910, file: !6, line: 1271, baseType: !22, size: 32, offset: 2656)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "textureAlignment", scope: !910, file: !6, line: 1272, baseType: !18, size: 64, offset: 2688)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "texturePitchAlignment", scope: !910, file: !6, line: 1273, baseType: !18, size: 64, offset: 2752)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "deviceOverlap", scope: !910, file: !6, line: 1274, baseType: !22, size: 32, offset: 2816)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "multiProcessorCount", scope: !910, file: !6, line: 1275, baseType: !22, size: 32, offset: 2848)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "kernelExecTimeoutEnabled", scope: !910, file: !6, line: 1276, baseType: !22, size: 32, offset: 2880)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "integrated", scope: !910, file: !6, line: 1277, baseType: !22, size: 32, offset: 2912)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "canMapHostMemory", scope: !910, file: !6, line: 1278, baseType: !22, size: 32, offset: 2944)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "computeMode", scope: !910, file: !6, line: 1279, baseType: !22, size: 32, offset: 2976)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1D", scope: !910, file: !6, line: 1280, baseType: !22, size: 32, offset: 3008)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DMipmap", scope: !910, file: !6, line: 1281, baseType: !22, size: 32, offset: 3040)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLinear", scope: !910, file: !6, line: 1282, baseType: !22, size: 32, offset: 3072)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2D", scope: !910, file: !6, line: 1283, baseType: !943, size: 64, offset: 3104)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 2)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DMipmap", scope: !910, file: !6, line: 1284, baseType: !943, size: 64, offset: 3168)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLinear", scope: !910, file: !6, line: 1285, baseType: !923, size: 96, offset: 3232)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DGather", scope: !910, file: !6, line: 1286, baseType: !943, size: 64, offset: 3328)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3D", scope: !910, file: !6, line: 1287, baseType: !923, size: 96, offset: 3392)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3DAlt", scope: !910, file: !6, line: 1288, baseType: !923, size: 96, offset: 3488)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemap", scope: !910, file: !6, line: 1289, baseType: !22, size: 32, offset: 3584)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLayered", scope: !910, file: !6, line: 1290, baseType: !943, size: 64, offset: 3616)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLayered", scope: !910, file: !6, line: 1291, baseType: !923, size: 96, offset: 3680)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemapLayered", scope: !910, file: !6, line: 1292, baseType: !943, size: 64, offset: 3776)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1D", scope: !910, file: !6, line: 1293, baseType: !22, size: 32, offset: 3840)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2D", scope: !910, file: !6, line: 1294, baseType: !943, size: 64, offset: 3872)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface3D", scope: !910, file: !6, line: 1295, baseType: !923, size: 96, offset: 3936)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1DLayered", scope: !910, file: !6, line: 1296, baseType: !943, size: 64, offset: 4032)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2DLayered", scope: !910, file: !6, line: 1297, baseType: !923, size: 96, offset: 4096)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemap", scope: !910, file: !6, line: 1298, baseType: !22, size: 32, offset: 4192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemapLayered", scope: !910, file: !6, line: 1299, baseType: !943, size: 64, offset: 4224)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceAlignment", scope: !910, file: !6, line: 1300, baseType: !18, size: 64, offset: 4288)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "concurrentKernels", scope: !910, file: !6, line: 1301, baseType: !22, size: 32, offset: 4352)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ECCEnabled", scope: !910, file: !6, line: 1302, baseType: !22, size: 32, offset: 4384)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pciBusID", scope: !910, file: !6, line: 1303, baseType: !22, size: 32, offset: 4416)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pciDeviceID", scope: !910, file: !6, line: 1304, baseType: !22, size: 32, offset: 4448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pciDomainID", scope: !910, file: !6, line: 1305, baseType: !22, size: 32, offset: 4480)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "tccDriver", scope: !910, file: !6, line: 1306, baseType: !22, size: 32, offset: 4512)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "asyncEngineCount", scope: !910, file: !6, line: 1307, baseType: !22, size: 32, offset: 4544)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "unifiedAddressing", scope: !910, file: !6, line: 1308, baseType: !22, size: 32, offset: 4576)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "memoryClockRate", scope: !910, file: !6, line: 1309, baseType: !22, size: 32, offset: 4608)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "memoryBusWidth", scope: !910, file: !6, line: 1310, baseType: !22, size: 32, offset: 4640)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "l2CacheSize", scope: !910, file: !6, line: 1311, baseType: !22, size: 32, offset: 4672)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerMultiProcessor", scope: !910, file: !6, line: 1312, baseType: !22, size: 32, offset: 4704)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "streamPrioritiesSupported", scope: !910, file: !6, line: 1313, baseType: !22, size: 32, offset: 4736)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "globalL1CacheSupported", scope: !910, file: !6, line: 1314, baseType: !22, size: 32, offset: 4768)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "localL1CacheSupported", scope: !910, file: !6, line: 1315, baseType: !22, size: 32, offset: 4800)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerMultiprocessor", scope: !910, file: !6, line: 1316, baseType: !18, size: 64, offset: 4864)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerMultiprocessor", scope: !910, file: !6, line: 1317, baseType: !22, size: 32, offset: 4928)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "managedMemory", scope: !910, file: !6, line: 1318, baseType: !22, size: 32, offset: 4960)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "isMultiGpuBoard", scope: !910, file: !6, line: 1319, baseType: !22, size: 32, offset: 4992)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "multiGpuBoardGroupID", scope: !910, file: !6, line: 1320, baseType: !22, size: 32, offset: 5024)
!983 = !DILocation(line: 96, column: 2, scope: !907)
!984 = !DILocation(line: 96, column: 17, scope: !907)
!985 = !DILocation(line: 97, column: 2, scope: !907)
!986 = !DILocation(line: 98, column: 2, scope: !907)
!987 = !DILocation(line: 99, column: 2, scope: !907)
!988 = !DILocation(line: 100, column: 1, scope: !907)
!989 = distinct !DISubprogram(name: "bicg_kernel1", linkageName: "_Z12bicg_kernel1PfS_S_ii", scope: !3, file: !3, line: 104, type: !990, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !992)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !21, !21, !21, !22, !22}
!992 = !{!993, !994, !995, !996, !997}
!993 = !DILocalVariable(name: "A", arg: 1, scope: !989, file: !3, line: 104, type: !21)
!994 = !DILocalVariable(name: "r", arg: 2, scope: !989, file: !3, line: 104, type: !21)
!995 = !DILocalVariable(name: "s", arg: 3, scope: !989, file: !3, line: 104, type: !21)
!996 = !DILocalVariable(name: "NX", arg: 4, scope: !989, file: !3, line: 104, type: !22)
!997 = !DILocalVariable(name: "NY", arg: 5, scope: !989, file: !3, line: 104, type: !22)
!998 = !DILocation(line: 104, column: 41, scope: !989)
!999 = !{!1000, !1000, i64 0}
!1000 = !{!"any pointer", !623, i64 0}
!1001 = !DILocation(line: 104, column: 55, scope: !989)
!1002 = !DILocation(line: 104, column: 69, scope: !989)
!1003 = !DILocation(line: 104, column: 76, scope: !989)
!1004 = !DILocation(line: 104, column: 84, scope: !989)
!1005 = !DILocation(line: 105, column: 1, scope: !989)
!1006 = !DILocation(line: 105, column: 1, scope: !1007)
!1007 = !DILexicalBlockFile(scope: !989, file: !3, discriminator: 1)
!1008 = !DILocation(line: 105, column: 1, scope: !1009)
!1009 = !DILexicalBlockFile(scope: !989, file: !3, discriminator: 2)
!1010 = !DILocation(line: 105, column: 1, scope: !1011)
!1011 = !DILexicalBlockFile(scope: !989, file: !3, discriminator: 3)
!1012 = !DILocation(line: 105, column: 1, scope: !1013)
!1013 = !DILexicalBlockFile(scope: !989, file: !3, discriminator: 4)
!1014 = !DILocation(line: 105, column: 1, scope: !1015)
!1015 = !DILexicalBlockFile(scope: !989, file: !3, discriminator: 5)
!1016 = !DILocation(line: 118, column: 1, scope: !989)
!1017 = distinct !DISubprogram(name: "bicg_kernel2", linkageName: "_Z12bicg_kernel2PfS_S_ii", scope: !3, file: !3, line: 122, type: !990, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023}
!1019 = !DILocalVariable(name: "A", arg: 1, scope: !1017, file: !3, line: 122, type: !21)
!1020 = !DILocalVariable(name: "p", arg: 2, scope: !1017, file: !3, line: 122, type: !21)
!1021 = !DILocalVariable(name: "q", arg: 3, scope: !1017, file: !3, line: 122, type: !21)
!1022 = !DILocalVariable(name: "NX", arg: 4, scope: !1017, file: !3, line: 122, type: !22)
!1023 = !DILocalVariable(name: "NY", arg: 5, scope: !1017, file: !3, line: 122, type: !22)
!1024 = !DILocation(line: 122, column: 41, scope: !1017)
!1025 = !DILocation(line: 122, column: 55, scope: !1017)
!1026 = !DILocation(line: 122, column: 69, scope: !1017)
!1027 = !DILocation(line: 122, column: 76, scope: !1017)
!1028 = !DILocation(line: 122, column: 84, scope: !1017)
!1029 = !DILocation(line: 123, column: 1, scope: !1017)
!1030 = !DILocation(line: 123, column: 1, scope: !1031)
!1031 = !DILexicalBlockFile(scope: !1017, file: !3, discriminator: 1)
!1032 = !DILocation(line: 123, column: 1, scope: !1033)
!1033 = !DILexicalBlockFile(scope: !1017, file: !3, discriminator: 2)
!1034 = !DILocation(line: 123, column: 1, scope: !1035)
!1035 = !DILexicalBlockFile(scope: !1017, file: !3, discriminator: 3)
!1036 = !DILocation(line: 123, column: 1, scope: !1037)
!1037 = !DILexicalBlockFile(scope: !1017, file: !3, discriminator: 4)
!1038 = !DILocation(line: 123, column: 1, scope: !1039)
!1039 = !DILexicalBlockFile(scope: !1017, file: !3, discriminator: 5)
!1040 = !DILocation(line: 136, column: 1, scope: !1017)
!1041 = distinct !DISubprogram(name: "bicg_cpu", linkageName: "_Z8bicg_cpuPfS_S_S_S_", scope: !3, file: !3, line: 139, type: !1042, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1044)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{null, !21, !21, !21, !21, !21}
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1050, !1051}
!1045 = !DILocalVariable(name: "A", arg: 1, scope: !1041, file: !3, line: 139, type: !21)
!1046 = !DILocalVariable(name: "r", arg: 2, scope: !1041, file: !3, line: 139, type: !21)
!1047 = !DILocalVariable(name: "s", arg: 3, scope: !1041, file: !3, line: 139, type: !21)
!1048 = !DILocalVariable(name: "p", arg: 4, scope: !1041, file: !3, line: 139, type: !21)
!1049 = !DILocalVariable(name: "q", arg: 5, scope: !1041, file: !3, line: 139, type: !21)
!1050 = !DILocalVariable(name: "i", scope: !1041, file: !3, line: 141, type: !22)
!1051 = !DILocalVariable(name: "j", scope: !1041, file: !3, line: 141, type: !22)
!1052 = !DILocation(line: 139, column: 26, scope: !1041)
!1053 = !DILocation(line: 139, column: 40, scope: !1041)
!1054 = !DILocation(line: 139, column: 54, scope: !1041)
!1055 = !DILocation(line: 139, column: 68, scope: !1041)
!1056 = !DILocation(line: 139, column: 82, scope: !1041)
!1057 = !DILocation(line: 141, column: 6, scope: !1041)
!1058 = !DILocation(line: 143, column: 20, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1060, file: !3, discriminator: 1)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 143, column: 4)
!1061 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 143, column: 4)
!1062 = !DILocation(line: 143, column: 18, scope: !1059)
!1063 = !DILocation(line: 143, column: 4, scope: !1064)
!1064 = !DILexicalBlockFile(scope: !1061, file: !3, discriminator: 1)
!1065 = !DILocation(line: 145, column: 8, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 144, column: 2)
!1067 = !DILocation(line: 148, column: 22, scope: !1068)
!1068 = !DILexicalBlockFile(scope: !1069, file: !3, discriminator: 1)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 148, column: 6)
!1070 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 148, column: 6)
!1071 = !DILocation(line: 148, column: 20, scope: !1068)
!1072 = !DILocation(line: 148, column: 6, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !1070, file: !3, discriminator: 1)
!1074 = !DILocation(line: 150, column: 3, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 149, column: 6)
!1076 = !DILocation(line: 150, column: 8, scope: !1075)
!1077 = !DILocation(line: 141, column: 8, scope: !1041)
!1078 = !DILocation(line: 151, column: 3, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !1080, file: !3, discriminator: 1)
!1080 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 151, column: 3)
!1081 = !DILocation(line: 153, column: 15, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !3, line: 152, column: 5)
!1083 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 151, column: 3)
!1084 = !DILocation(line: 153, column: 22, scope: !1082)
!1085 = !DILocation(line: 153, column: 36, scope: !1082)
!1086 = !DILocation(line: 153, column: 29, scope: !1082)
!1087 = !DILocation(line: 153, column: 27, scope: !1082)
!1088 = !DILocation(line: 153, column: 20, scope: !1082)
!1089 = !DILocation(line: 153, column: 13, scope: !1082)
!1090 = !DILocation(line: 154, column: 15, scope: !1082)
!1091 = !DILocation(line: 154, column: 22, scope: !1082)
!1092 = !DILocation(line: 154, column: 36, scope: !1082)
!1093 = !DILocation(line: 154, column: 34, scope: !1082)
!1094 = !DILocation(line: 154, column: 20, scope: !1082)
!1095 = !DILocation(line: 154, column: 13, scope: !1082)
!1096 = !DILocation(line: 151, column: 24, scope: !1097)
!1097 = !DILexicalBlockFile(scope: !1083, file: !3, discriminator: 2)
!1098 = !DILocation(line: 151, column: 17, scope: !1099)
!1099 = !DILexicalBlockFile(scope: !1083, file: !3, discriminator: 1)
!1100 = distinct !{!1100, !1101, !1102}
!1101 = !DILocation(line: 151, column: 3, scope: !1080)
!1102 = !DILocation(line: 155, column: 5, scope: !1080)
!1103 = !DILocation(line: 148, column: 27, scope: !1104)
!1104 = !DILexicalBlockFile(scope: !1069, file: !3, discriminator: 2)
!1105 = distinct !{!1105, !1106, !1107}
!1106 = !DILocation(line: 148, column: 6, scope: !1070)
!1107 = !DILocation(line: 156, column: 2, scope: !1070)
!1108 = !DILocation(line: 157, column: 1, scope: !1041)
!1109 = distinct !DISubprogram(name: "bicgCuda", linkageName: "_Z8bicgCudaPfS_S_S_S_S_S_", scope: !3, file: !3, line: 160, type: !1110, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !1112)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !21, !21, !21, !21, !21, !21, !21}
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1152, !1153}
!1113 = !DILocalVariable(name: "A", arg: 1, scope: !1109, file: !3, line: 160, type: !21)
!1114 = !DILocalVariable(name: "r", arg: 2, scope: !1109, file: !3, line: 160, type: !21)
!1115 = !DILocalVariable(name: "s", arg: 3, scope: !1109, file: !3, line: 160, type: !21)
!1116 = !DILocalVariable(name: "p", arg: 4, scope: !1109, file: !3, line: 160, type: !21)
!1117 = !DILocalVariable(name: "q", arg: 5, scope: !1109, file: !3, line: 160, type: !21)
!1118 = !DILocalVariable(name: "s_outputFromGpu", arg: 6, scope: !1109, file: !3, line: 161, type: !21)
!1119 = !DILocalVariable(name: "q_outputFromGpu", arg: 7, scope: !1109, file: !3, line: 161, type: !21)
!1120 = !DILocalVariable(name: "t_start", scope: !1109, file: !3, line: 163, type: !173)
!1121 = !DILocalVariable(name: "t_end", scope: !1109, file: !3, line: 163, type: !173)
!1122 = !DILocalVariable(name: "t_m", scope: !1109, file: !3, line: 163, type: !173)
!1123 = !DILocalVariable(name: "A_gpu", scope: !1109, file: !3, line: 165, type: !21)
!1124 = !DILocalVariable(name: "q_gpu", scope: !1109, file: !3, line: 166, type: !21)
!1125 = !DILocalVariable(name: "p_gpu", scope: !1109, file: !3, line: 167, type: !21)
!1126 = !DILocalVariable(name: "r_gpu", scope: !1109, file: !3, line: 168, type: !21)
!1127 = !DILocalVariable(name: "s_gpu", scope: !1109, file: !3, line: 169, type: !21)
!1128 = !DILocalVariable(name: "block", scope: !1109, file: !3, line: 182, type: !1129)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "dim3", file: !1130, line: 427, baseType: !1131)
!1130 = !DIFile(filename: "/usr/local/cuda/include/vector_types.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/bicgllvm")
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dim3", file: !1130, line: 417, size: 96, elements: !1132, identifier: "_ZTS4dim3")
!1132 = !{!1133, !1134, !1135, !1136, !1140, !1149}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1131, file: !1130, line: 419, baseType: !387, size: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1131, file: !1130, line: 419, baseType: !387, size: 32, offset: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !1131, file: !1130, line: 419, baseType: !387, size: 32, offset: 64)
!1136 = !DISubprogram(name: "dim3", scope: !1131, file: !1130, line: 421, type: !1137, isLocal: false, isDefinition: false, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{null, !1139, !387, !387, !387}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1140 = !DISubprogram(name: "dim3", scope: !1131, file: !1130, line: 422, type: !1141, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{null, !1139, !1143}
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1130, line: 383, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uint3", file: !1130, line: 190, size: 96, elements: !1145, identifier: "_ZTS5uint3")
!1145 = !{!1146, !1147, !1148}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1144, file: !1130, line: 192, baseType: !387, size: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1144, file: !1130, line: 192, baseType: !387, size: 32, offset: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !1144, file: !1130, line: 192, baseType: !387, size: 32, offset: 64)
!1149 = !DISubprogram(name: "operator uint3", linkageName: "_ZN4dim3cv5uint3Ev", scope: !1131, file: !1130, line: 423, type: !1150, isLocal: false, isDefinition: false, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!1143, !1139}
!1152 = !DILocalVariable(name: "grid1", scope: !1109, file: !3, line: 183, type: !1129)
!1153 = !DILocalVariable(name: "grid2", scope: !1109, file: !3, line: 184, type: !1129)
!1154 = !DILocation(line: 160, column: 26, scope: !1109)
!1155 = !DILocation(line: 160, column: 40, scope: !1109)
!1156 = !DILocation(line: 160, column: 54, scope: !1109)
!1157 = !DILocation(line: 160, column: 68, scope: !1109)
!1158 = !DILocation(line: 160, column: 82, scope: !1109)
!1159 = !DILocation(line: 161, column: 15, scope: !1109)
!1160 = !DILocation(line: 161, column: 43, scope: !1109)
!1161 = !DILocation(line: 165, column: 2, scope: !1109)
!1162 = !DILocation(line: 166, column: 2, scope: !1109)
!1163 = !DILocation(line: 167, column: 2, scope: !1109)
!1164 = !DILocation(line: 168, column: 2, scope: !1109)
!1165 = !DILocation(line: 169, column: 2, scope: !1109)
!1166 = !DILocation(line: 171, column: 13, scope: !1109)
!1167 = !DILocation(line: 171, column: 50, scope: !1109)
!1168 = !DILocation(line: 171, column: 48, scope: !1109)
!1169 = !DILocation(line: 171, column: 55, scope: !1109)
!1170 = !DILocation(line: 171, column: 53, scope: !1109)
!1171 = !DILocation(line: 171, column: 2, scope: !1109)
!1172 = !DILocation(line: 172, column: 13, scope: !1109)
!1173 = !DILocation(line: 172, column: 50, scope: !1109)
!1174 = !DILocation(line: 172, column: 48, scope: !1109)
!1175 = !DILocation(line: 172, column: 2, scope: !1109)
!1176 = !DILocation(line: 173, column: 13, scope: !1109)
!1177 = !DILocation(line: 173, column: 50, scope: !1109)
!1178 = !DILocation(line: 173, column: 48, scope: !1109)
!1179 = !DILocation(line: 173, column: 2, scope: !1109)
!1180 = !DILocation(line: 174, column: 13, scope: !1109)
!1181 = !DILocation(line: 174, column: 50, scope: !1109)
!1182 = !DILocation(line: 174, column: 48, scope: !1109)
!1183 = !DILocation(line: 174, column: 2, scope: !1109)
!1184 = !DILocation(line: 175, column: 13, scope: !1109)
!1185 = !DILocation(line: 175, column: 50, scope: !1109)
!1186 = !DILocation(line: 175, column: 48, scope: !1109)
!1187 = !DILocation(line: 175, column: 2, scope: !1109)
!1188 = !DILocation(line: 176, column: 13, scope: !1109)
!1189 = !DILocation(line: 176, column: 20, scope: !1109)
!1190 = !DILocation(line: 176, column: 43, scope: !1109)
!1191 = !DILocation(line: 176, column: 41, scope: !1109)
!1192 = !DILocation(line: 176, column: 48, scope: !1109)
!1193 = !DILocation(line: 176, column: 46, scope: !1109)
!1194 = !DILocation(line: 176, column: 2, scope: !1109)
!1195 = !DILocation(line: 177, column: 13, scope: !1109)
!1196 = !DILocation(line: 177, column: 20, scope: !1109)
!1197 = !DILocation(line: 177, column: 43, scope: !1109)
!1198 = !DILocation(line: 177, column: 41, scope: !1109)
!1199 = !DILocation(line: 177, column: 2, scope: !1109)
!1200 = !DILocation(line: 178, column: 13, scope: !1109)
!1201 = !DILocation(line: 178, column: 20, scope: !1109)
!1202 = !DILocation(line: 178, column: 43, scope: !1109)
!1203 = !DILocation(line: 178, column: 41, scope: !1109)
!1204 = !DILocation(line: 178, column: 2, scope: !1109)
!1205 = !DILocation(line: 179, column: 13, scope: !1109)
!1206 = !DILocation(line: 179, column: 20, scope: !1109)
!1207 = !DILocation(line: 179, column: 43, scope: !1109)
!1208 = !DILocation(line: 179, column: 41, scope: !1109)
!1209 = !DILocation(line: 179, column: 2, scope: !1109)
!1210 = !DILocation(line: 180, column: 13, scope: !1109)
!1211 = !DILocation(line: 180, column: 20, scope: !1109)
!1212 = !DILocation(line: 180, column: 43, scope: !1109)
!1213 = !DILocation(line: 180, column: 41, scope: !1109)
