; ModuleID = 'hotspot.cu'
source_filename = "hotspot.cu"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }
%struct.dim3 = type { i32, i32, i32 }
%struct.CUstream_st = type opaque

@t_chip = local_unnamed_addr global float 0x3F40624DE0000000, align 4, !dbg !0
@chip_height = local_unnamed_addr global float 0x3F90624DE0000000, align 4, !dbg !37
@chip_width = local_unnamed_addr global float 0x3F90624DE0000000, align 4, !dbg !39
@amb_temp = local_unnamed_addr global float 8.000000e+01, align 4, !dbg !41
@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [11 x i8] c"error: %s\0A\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"%d\09%g\0A\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.5 = private unnamed_addr constant [25 x i8] c"not enough lines in file\00", align 1
@.str.6 = private unnamed_addr constant [3 x i8] c"%f\00", align 1

!244 = !DISubprogram(name: "atan2", scope: !236, file: !236, line: 60, type: !245, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!245 = !DISubroutineType(types: !246)
!246 = !{!27, !27, !27}
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !248, line: 180)
!248 = !DISubprogram(name: "ceil", scope: !236, file: !236, line: 178, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !250, line: 199)
!250 = !DISubprogram(name: "cos", scope: !236, file: !236, line: 63, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!251 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !252, line: 218)
!252 = !DISubprogram(name: "cosh", scope: !236, file: !236, line: 72, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !254, line: 237)
!254 = !DISubprogram(name: "exp", scope: !236, file: !236, line: 100, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !256, line: 256)
!256 = !DISubprogram(name: "fabs", scope: !236, file: !236, line: 181, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!257 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !258, line: 275)
!258 = !DISubprogram(name: "floor", scope: !236, file: !236, line: 184, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !260, line: 294)
!260 = !DISubprogram(name: "fmod", scope: !236, file: !236, line: 187, type: !245, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!261 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !262, line: 315)
!262 = !DISubprogram(name: "frexp", scope: !236, file: !236, line: 103, type: !263, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!263 = !DISubroutineType(types: !264)
!264 = !{!27, !27, !113}
!265 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !266, line: 334)
!266 = !DISubprogram(name: "ldexp", scope: !236, file: !236, line: 106, type: !267, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!267 = !DISubroutineType(types: !268)
!268 = !{!27, !27, !32}
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !270, line: 353)
!270 = !DISubprogram(name: "log", scope: !236, file: !236, line: 109, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !272, line: 372)
!272 = !DISubprogram(name: "log10", scope: !236, file: !236, line: 112, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !274, line: 391)
!274 = !DISubprogram(name: "modf", scope: !236, file: !236, line: 115, type: !275, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!275 = !DISubroutineType(types: !276)
!276 = !{!27, !27, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !279, line: 403)
!279 = !DISubprogram(name: "pow", scope: !236, file: !236, line: 153, type: !245, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !281, line: 440)
!281 = !DISubprogram(name: "sin", scope: !236, file: !236, line: 65, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !283, line: 459)
!283 = !DISubprogram(name: "sinh", scope: !236, file: !236, line: 74, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !285, line: 478)
!285 = !DISubprogram(name: "sqrt", scope: !236, file: !236, line: 156, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!286 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !287, line: 497)
!287 = !DISubprogram(name: "tan", scope: !236, file: !236, line: 67, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !289, line: 516)
!289 = !DISubprogram(name: "tanh", scope: !236, file: !236, line: 76, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !291, line: 118)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !292, line: 101, baseType: !293)
!292 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!293 = !DICompositeType(tag: DW_TAG_structure_type, file: !292, line: 97, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!294 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !295, line: 119)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !292, line: 109, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !292, line: 105, size: 128, elements: !297, identifier: "_ZTS6ldiv_t")
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !296, file: !292, line: 107, baseType: !147, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !296, file: !292, line: 108, baseType: !147, size: 64, offset: 64)
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !301, line: 121)
!301 = !DISubprogram(name: "abort", scope: !292, file: !292, line: 515, type: !302, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!302 = !DISubroutineType(types: !303)
!303 = !{null}
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !305, line: 122)
!305 = !DISubprogram(name: "abs", scope: !292, file: !292, line: 775, type: !306, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!306 = !DISubroutineType(types: !307)
!307 = !{!32, !32}
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !309, line: 123)
!309 = !DISubprogram(name: "atexit", scope: !292, file: !292, line: 519, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!310 = !DISubroutineType(types: !311)
!311 = !{!32, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !314, line: 129)
!314 = !DISubprogram(name: "atof", scope: !315, file: !315, line: 26, type: !184, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!315 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !317, line: 130)
!317 = distinct !DISubprogram(name: "atoi", scope: !292, file: !292, line: 278, type: !318, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !320)
!318 = !DISubroutineType(types: !319)
!319 = !{!32, !186}
!320 = !{!321}
!321 = !DILocalVariable(name: "__nptr", arg: 1, scope: !317, file: !292, line: 278, type: !186)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !323, line: 131)
!323 = !DISubprogram(name: "atol", scope: !292, file: !292, line: 283, type: !324, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!324 = !DISubroutineType(types: !325)
!325 = !{!147, !186}
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !327, line: 132)
!327 = !DISubprogram(name: "bsearch", scope: !328, file: !328, line: 20, type: !329, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!329 = !DISubroutineType(types: !330)
!330 = !{!31, !331, !331, !333, !333, !336}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !334, line: 62, baseType: !335)
!334 = !DIFile(filename: "/home/dshen/llvm/build/bin/../lib/clang/5.0.0/include/stddef.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!335 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !292, line: 742, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!32, !331, !331}
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !341, line: 133)
!341 = !DISubprogram(name: "calloc", scope: !292, file: !292, line: 468, type: !342, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!342 = !DISubroutineType(types: !343)
!343 = !{!31, !333, !333}
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !345, line: 134)
!345 = !DISubprogram(name: "div", scope: !292, file: !292, line: 789, type: !346, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!346 = !DISubroutineType(types: !347)
!347 = !{!291, !32, !32}
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !349, line: 135)
!349 = !DISubprogram(name: "exit", scope: !292, file: !292, line: 543, type: !350, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !32}
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !353, line: 136)
!353 = !DISubprogram(name: "free", scope: !292, file: !292, line: 483, type: !354, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !31}
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !357, line: 137)
!357 = !DISubprogram(name: "getenv", scope: !292, file: !292, line: 564, type: !358, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!358 = !DISubroutineType(types: !359)
!359 = !{!34, !186}
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !361, line: 138)
!361 = !DISubprogram(name: "labs", scope: !292, file: !292, line: 776, type: !145, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !363, line: 139)
!363 = !DISubprogram(name: "ldiv", scope: !292, file: !292, line: 791, type: !364, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!364 = !DISubroutineType(types: !365)
!365 = !{!295, !147, !147}
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !367, line: 140)
!367 = !DISubprogram(name: "malloc", scope: !292, file: !292, line: 466, type: !368, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!368 = !DISubroutineType(types: !369)
!369 = !{!31, !333}
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !371, line: 142)
!371 = !DISubprogram(name: "mblen", scope: !292, file: !292, line: 863, type: !372, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!372 = !DISubroutineType(types: !373)
!373 = !{!32, !186, !333}
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !375, line: 143)
!375 = !DISubprogram(name: "mbstowcs", scope: !292, file: !292, line: 874, type: !376, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!376 = !DISubroutineType(types: !377)
!377 = !{!333, !378, !381, !333}
!378 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!381 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !186)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !383, line: 144)
!383 = !DISubprogram(name: "mbtowc", scope: !292, file: !292, line: 866, type: !384, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!384 = !DISubroutineType(types: !385)
!385 = !{!32, !378, !381, !333}
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !387, line: 146)
!387 = !DISubprogram(name: "qsort", scope: !292, file: !292, line: 765, type: !388, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !31, !333, !333, !336}
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !391, line: 152)
!391 = !DISubprogram(name: "rand", scope: !292, file: !292, line: 374, type: !392, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!392 = !DISubroutineType(types: !393)
!393 = !{!32}
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !395, line: 153)
!395 = !DISubprogram(name: "realloc", scope: !292, file: !292, line: 480, type: !396, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!396 = !DISubroutineType(types: !397)
!397 = !{!31, !31, !333}
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !399, line: 154)
!399 = !DISubprogram(name: "srand", scope: !292, file: !292, line: 376, type: !400, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !402}
!402 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !404, line: 155)
!404 = !DISubprogram(name: "strtod", scope: !292, file: !292, line: 164, type: !405, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!405 = !DISubroutineType(types: !406)
!406 = !{!27, !381, !407}
!407 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !33)
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !409, line: 156)
!409 = !DISubprogram(name: "strtol", scope: !292, file: !292, line: 183, type: !410, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!410 = !DISubroutineType(types: !411)
!411 = !{!147, !381, !407, !32}
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !413, line: 157)
!413 = !DISubprogram(name: "strtoul", scope: !292, file: !292, line: 187, type: !414, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!414 = !DISubroutineType(types: !415)
!415 = !{!335, !381, !407, !32}
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !417, line: 158)
!417 = !DISubprogram(name: "system", scope: !292, file: !292, line: 717, type: !318, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !419, line: 160)
!419 = !DISubprogram(name: "wcstombs", scope: !292, file: !292, line: 877, type: !420, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!420 = !DISubroutineType(types: !421)
!421 = !{!333, !422, !423, !333}
!422 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !34)
!423 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !427, line: 161)
!427 = !DISubprogram(name: "wctomb", scope: !292, file: !292, line: 870, type: !428, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!428 = !DISubroutineType(types: !429)
!429 = !{!32, !34, !380}
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !431, entity: !433, line: 201)
!431 = !DINamespace(name: "__gnu_cxx", scope: null, file: !432, line: 68)
!432 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/bits/cpp_type_traits.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !292, line: 121, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !292, line: 117, size: 128, elements: !435, identifier: "_ZTS7lldiv_t")
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !434, file: !292, line: 119, baseType: !50, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !434, file: !292, line: 120, baseType: !50, size: 64, offset: 64)
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !431, entity: !439, line: 207)
!439 = !DISubprogram(name: "_Exit", scope: !292, file: !292, line: 557, type: !350, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !431, entity: !441, line: 211)
!441 = !DISubprogram(name: "llabs", scope: !292, file: !292, line: 780, type: !48, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !431, entity: !443, line: 217)
!443 = !DISubprogram(name: "lldiv", scope: !292, file: !292, line: 797, type: !444, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!444 = !DISubroutineType(types: !445)
!445 = !{!433, !50, !50}
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !431, entity: !447, line: 228)
!447 = !DISubprogram(name: "atoll", scope: !292, file: !292, line: 292, type: !448, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!448 = !DISubroutineType(types: !449)
!449 = !{!50, !186}
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !431, entity: !451, line: 229)
!451 = !DISubprogram(name: "strtoll", scope: !292, file: !292, line: 209, type: !452, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!452 = !DISubroutineType(types: !453)
!453 = !{!50, !381, !407, !32}
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !431, entity: !455, line: 230)
!455 = !DISubprogram(name: "strtoull", scope: !292, file: !292, line: 214, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!456 = !DISubroutineType(types: !457)
!457 = !{!458, !381, !407, !32}
!458 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !431, entity: !460, line: 232)
!460 = !DISubprogram(name: "strtof", scope: !292, file: !292, line: 172, type: !461, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!461 = !DISubroutineType(types: !462)
!462 = !{!29, !381, !407}
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !431, entity: !464, line: 233)
!464 = !DISubprogram(name: "strtold", scope: !292, file: !292, line: 175, type: !465, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!465 = !DISubroutineType(types: !466)
!466 = !{!467, !381, !407}
!467 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !433, line: 241)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !439, line: 243)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !441, line: 245)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !472, line: 246)
!472 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !431, file: !473, line: 214, type: !444, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!473 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/cstdlib", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !443, line: 247)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !447, line: 249)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !460, line: 250)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !451, line: 251)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !455, line: 252)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !464, line: 253)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !481, line: 418)
!481 = !DISubprogram(name: "acosf", linkageName: "_ZL5acosff", scope: !482, file: !482, line: 1126, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!482 = !DIFile(filename: "/usr/local/cuda/include/math_functions.hpp", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !484, line: 419)
!484 = !DISubprogram(name: "acoshf", linkageName: "_ZL6acoshff", scope: !482, file: !482, line: 1154, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !486, line: 420)
!486 = !DISubprogram(name: "asinf", linkageName: "_ZL5asinff", scope: !482, file: !482, line: 1121, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !488, line: 421)
!488 = !DISubprogram(name: "asinhf", linkageName: "_ZL6asinhff", scope: !482, file: !482, line: 1159, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !490, line: 422)
!490 = !DISubprogram(name: "atan2f", linkageName: "_ZL6atan2fff", scope: !482, file: !482, line: 1111, type: !65, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !492, line: 423)
!492 = !DISubprogram(name: "atanf", linkageName: "_ZL5atanff", scope: !482, file: !482, line: 1116, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !494, line: 424)
!494 = !DISubprogram(name: "atanhf", linkageName: "_ZL6atanhff", scope: !482, file: !482, line: 1164, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !496, line: 425)
!496 = !DISubprogram(name: "cbrtf", linkageName: "_ZL5cbrtff", scope: !482, file: !482, line: 1199, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !498, line: 426)
!498 = !DISubprogram(name: "ceilf", linkageName: "_ZL5ceilff", scope: !499, file: !499, line: 647, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!499 = !DIFile(filename: "/usr/local/cuda/include/device_functions.hpp", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !501, line: 427)
!501 = !DISubprogram(name: "copysignf", linkageName: "_ZL9copysignfff", scope: !482, file: !482, line: 973, type: !65, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !503, line: 428)
!503 = !DISubprogram(name: "cosf", linkageName: "_ZL4cosff", scope: !482, file: !482, line: 1027, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !505, line: 429)
!505 = !DISubprogram(name: "coshf", linkageName: "_ZL5coshff", scope: !482, file: !482, line: 1096, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !507, line: 430)
!507 = !DISubprogram(name: "erfcf", linkageName: "_ZL5erfcff", scope: !482, file: !482, line: 1259, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !509, line: 431)
!509 = !DISubprogram(name: "erff", linkageName: "_ZL4erfff", scope: !482, file: !482, line: 1249, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !511, line: 432)
!511 = !DISubprogram(name: "exp2f", linkageName: "_ZL5exp2ff", scope: !499, file: !499, line: 637, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !513, line: 433)
!513 = !DISubprogram(name: "expf", linkageName: "_ZL4expff", scope: !482, file: !482, line: 1078, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !515, line: 434)
!515 = !DISubprogram(name: "expm1f", linkageName: "_ZL6expm1ff", scope: !482, file: !482, line: 1169, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !517, line: 435)
!517 = !DISubprogram(name: "fabsf", linkageName: "_ZL5fabsff", scope: !499, file: !499, line: 582, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !519, line: 436)
!519 = !DISubprogram(name: "fdimf", linkageName: "_ZL5fdimfff", scope: !482, file: !482, line: 1385, type: !65, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !521, line: 437)
!521 = !DISubprogram(name: "floorf", linkageName: "_ZL6floorff", scope: !499, file: !499, line: 572, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !523, line: 438)
!523 = !DISubprogram(name: "fmaf", linkageName: "_ZL4fmaffff", scope: !482, file: !482, line: 1337, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !525, line: 439)
!525 = !DISubprogram(name: "fmaxf", linkageName: "_ZL5fmaxfff", scope: !499, file: !499, line: 602, type: !65, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !527, line: 440)
!527 = !DISubprogram(name: "fminf", linkageName: "_ZL5fminfff", scope: !499, file: !499, line: 597, type: !65, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !529, line: 441)
!529 = !DISubprogram(name: "fmodf", linkageName: "_ZL5fmodfff", scope: !482, file: !482, line: 1322, type: !65, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !531, line: 442)
!531 = !DISubprogram(name: "frexpf", linkageName: "_ZL6frexpffPi", scope: !482, file: !482, line: 1312, type: !111, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !533, line: 443)
!533 = !DISubprogram(name: "hypotf", linkageName: "_ZL6hypotfff", scope: !482, file: !482, line: 1174, type: !65, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !535, line: 444)
!535 = !DISubprogram(name: "ilogbf", linkageName: "_ZL6ilogbff", scope: !482, file: !482, line: 1390, type: !107, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !537, line: 445)
!537 = !DISubprogram(name: "ldexpf", linkageName: "_ZL6ldexpffi", scope: !482, file: !482, line: 1289, type: !150, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !539, line: 446)
!539 = !DISubprogram(name: "lgammaf", linkageName: "_ZL7lgammaff", scope: !482, file: !482, line: 1284, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !541, line: 447)
!541 = !DISubprogram(name: "llrintf", linkageName: "_ZL7llrintff", scope: !482, file: !482, line: 933, type: !158, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !543, line: 448)
!543 = !DISubprogram(name: "llroundf", linkageName: "_ZL8llroundff", scope: !482, file: !482, line: 1371, type: !158, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !545, line: 449)
!545 = !DISubprogram(name: "log10f", linkageName: "_ZL6log10ff", scope: !482, file: !482, line: 1140, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !547, line: 450)
!547 = !DISubprogram(name: "log1pf", linkageName: "_ZL6log1pff", scope: !482, file: !482, line: 1149, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !549, line: 451)
!549 = !DISubprogram(name: "log2f", linkageName: "_ZL5log2ff", scope: !482, file: !482, line: 1069, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !551, line: 452)
!551 = !DISubprogram(name: "logbf", linkageName: "_ZL5logbff", scope: !482, file: !482, line: 1395, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !553, line: 453)
!553 = !DISubprogram(name: "logf", linkageName: "_ZL4logff", scope: !482, file: !482, line: 1131, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !555, line: 454)
!555 = !DISubprogram(name: "lrintf", linkageName: "_ZL6lrintff", scope: !482, file: !482, line: 924, type: !172, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !557, line: 455)
!557 = !DISubprogram(name: "lroundf", linkageName: "_ZL7lroundff", scope: !482, file: !482, line: 1376, type: !172, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !559, line: 456)
!559 = !DISubprogram(name: "modff", linkageName: "_ZL5modfffPf", scope: !482, file: !482, line: 1317, type: !180, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !561, line: 457)
!561 = !DISubprogram(name: "nearbyintf", linkageName: "_ZL10nearbyintff", scope: !482, file: !482, line: 938, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !563, line: 458)
!563 = !DISubprogram(name: "nextafterf", linkageName: "_ZL10nextafterfff", scope: !482, file: !482, line: 1002, type: !65, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !565, line: 459)
!565 = !DISubprogram(name: "nexttowardf", scope: !236, file: !236, line: 284, type: !566, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!566 = !DISubroutineType(types: !567)
!567 = !{!29, !29, !467}
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !565, line: 460)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !570, line: 461)
!570 = !DISubprogram(name: "powf", linkageName: "_ZL4powfff", scope: !482, file: !482, line: 1352, type: !65, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !572, line: 462)
!572 = !DISubprogram(name: "remainderf", linkageName: "_ZL10remainderfff", scope: !482, file: !482, line: 1327, type: !65, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !574, line: 463)
!574 = !DISubprogram(name: "remquof", linkageName: "_ZL7remquofffPi", scope: !482, file: !482, line: 1332, type: !206, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !576, line: 464)
!576 = !DISubprogram(name: "rintf", linkageName: "_ZL5rintff", scope: !482, file: !482, line: 919, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !578, line: 465)
!578 = !DISubprogram(name: "roundf", linkageName: "_ZL6roundff", scope: !482, file: !482, line: 1366, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !580, line: 466)
!580 = !DISubprogram(name: "scalblnf", linkageName: "_ZL8scalblnffl", scope: !482, file: !482, line: 1299, type: !214, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !582, line: 467)
!582 = !DISubprogram(name: "scalbnf", linkageName: "_ZL7scalbnffi", scope: !482, file: !482, line: 1294, type: !150, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !584, line: 468)
!584 = !DISubprogram(name: "sinf", linkageName: "_ZL4sinff", scope: !482, file: !482, line: 1018, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !586, line: 469)
!586 = !DISubprogram(name: "sinhf", linkageName: "_ZL5sinhff", scope: !482, file: !482, line: 1101, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !588, line: 470)
!588 = !DISubprogram(name: "sqrtf", linkageName: "_ZL5sqrtff", scope: !499, file: !499, line: 887, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !590, line: 471)
!590 = !DISubprogram(name: "tanf", linkageName: "_ZL4tanff", scope: !482, file: !482, line: 1060, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !592, line: 472)
!592 = !DISubprogram(name: "tanhf", linkageName: "_ZL5tanhff", scope: !482, file: !482, line: 1106, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !594, line: 473)
!594 = !DISubprogram(name: "tgammaf", linkageName: "_ZL7tgammaff", scope: !482, file: !482, line: 1361, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !45, entity: !596, line: 474)
!596 = !DISubprogram(name: "truncf", linkageName: "_ZL6truncff", scope: !499, file: !499, line: 642, type: !53, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!597 = !{i32 2, !"Dwarf Version", i32 4}
!598 = !{i32 2, !"Debug Info Version", i32 3}
!599 = !{!"clang version 5.0.0 (trunk 294196)"}
!600 = distinct !DISubprogram(name: "get_time", linkageName: "_Z8get_timev", scope: !3, file: !3, line: 43, type: !601, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{!27}
!603 = !{!604}
!604 = !DILocalVariable(name: "time", scope: !600, file: !3, line: 44, type: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !606, line: 30, size: 128, elements: !607, identifier: "_ZTS7timeval")
!606 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!607 = !{!608, !611}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !605, file: !606, line: 32, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !610, line: 139, baseType: !147)
!610 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !605, file: !606, line: 33, baseType: !612, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !610, line: 141, baseType: !147)
!613 = !DILocation(line: 44, column: 5, scope: !600)
!614 = !DIExpression(DW_OP_deref)
!615 = !DILocation(line: 44, column: 20, scope: !600)
!616 = !DILocation(line: 45, column: 9, scope: !617)
!617 = distinct !DILexicalBlock(scope: !600, file: !3, line: 45, column: 9)
!618 = !DILocation(line: 45, column: 9, scope: !600)
!619 = !DILocation(line: 49, column: 25, scope: !600)
!620 = !{!621, !622, i64 0}
!621 = !{!"_ZTS7timeval", !622, i64 0, !622, i64 8}
!622 = !{!"long", !623, i64 0}
!623 = !{!"omnipotent char", !624, i64 0}
!624 = !{!"Simple C++ TBAA"}
!625 = !DILocation(line: 49, column: 20, scope: !600)
!626 = !DILocation(line: 49, column: 47, scope: !600)
!627 = !{!621, !622, i64 8}
!628 = !DILocation(line: 49, column: 42, scope: !600)
!629 = !DILocation(line: 49, column: 55, scope: !600)
!630 = !DILocation(line: 49, column: 32, scope: !600)
!631 = !DILocation(line: 49, column: 5, scope: !600)
!632 = !DILocation(line: 50, column: 1, scope: !600)
!633 = distinct !DISubprogram(name: "fatal", linkageName: "_Z5fatalPc", scope: !3, file: !3, line: 53, type: !634, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !636)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !34}
!636 = !{!637}
!637 = !DILocalVariable(name: "s", arg: 1, scope: !633, file: !3, line: 53, type: !34)
!638 = !DIExpression()
!639 = !DILocation(line: 53, column: 13, scope: !633)
!640 = !DILocation(line: 55, column: 10, scope: !633)
!641 = !{!642, !642, i64 0}
!642 = !{!"any pointer", !623, i64 0}
!643 = !DILocation(line: 55, column: 2, scope: !633)
!644 = !DILocation(line: 57, column: 1, scope: !633)
!645 = distinct !DISubprogram(name: "writeoutput", linkageName: "_Z11writeoutputPfiiPc", scope: !3, file: !3, line: 59, type: !646, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !648)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !28, !32, !32, !34}
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !707}
!649 = !DILocalVariable(name: "vect", arg: 1, scope: !645, file: !3, line: 59, type: !28)
!650 = !DILocalVariable(name: "grid_rows", arg: 2, scope: !645, file: !3, line: 59, type: !32)
!651 = !DILocalVariable(name: "grid_cols", arg: 3, scope: !645, file: !3, line: 59, type: !32)
!652 = !DILocalVariable(name: "file", arg: 4, scope: !645, file: !3, line: 59, type: !34)
!653 = !DILocalVariable(name: "i", scope: !645, file: !3, line: 61, type: !32)
!654 = !DILocalVariable(name: "j", scope: !645, file: !3, line: 61, type: !32)
!655 = !DILocalVariable(name: "index", scope: !645, file: !3, line: 61, type: !32)
!656 = !DILocalVariable(name: "fp", scope: !645, file: !3, line: 62, type: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !659, line: 48, baseType: !660)
!659 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !661, line: 245, size: 1728, elements: !662, identifier: "_ZTS8_IO_FILE")
!661 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !678, !680, !681, !682, !684, !686, !688, !692, !695, !697, !698, !699, !700, !701, !702, !703}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !660, file: !661, line: 246, baseType: !32, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !660, file: !661, line: 251, baseType: !34, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !660, file: !661, line: 252, baseType: !34, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !660, file: !661, line: 253, baseType: !34, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !660, file: !661, line: 254, baseType: !34, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !660, file: !661, line: 255, baseType: !34, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !660, file: !661, line: 256, baseType: !34, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !660, file: !661, line: 257, baseType: !34, size: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !660, file: !661, line: 258, baseType: !34, size: 64, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !660, file: !661, line: 260, baseType: !34, size: 64, offset: 576)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !660, file: !661, line: 261, baseType: !34, size: 64, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !660, file: !661, line: 262, baseType: !34, size: 64, offset: 704)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !660, file: !661, line: 264, baseType: !676, size: 64, offset: 768)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !661, line: 160, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !660, file: !661, line: 266, baseType: !679, size: 64, offset: 832)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !660, file: !661, line: 268, baseType: !32, size: 32, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !660, file: !661, line: 272, baseType: !32, size: 32, offset: 928)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !660, file: !661, line: 274, baseType: !683, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !610, line: 131, baseType: !147)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !660, file: !661, line: 278, baseType: !685, size: 16, offset: 1024)
!685 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !660, file: !661, line: 279, baseType: !687, size: 8, offset: 1040)
!687 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !660, file: !661, line: 280, baseType: !689, size: 8, offset: 1048)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 1)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !660, file: !661, line: 284, baseType: !693, size: 64, offset: 1088)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !661, line: 154, baseType: null)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !660, file: !661, line: 293, baseType: !696, size: 64, offset: 1152)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !610, line: 132, baseType: !147)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !660, file: !661, line: 302, baseType: !31, size: 64, offset: 1216)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !660, file: !661, line: 303, baseType: !31, size: 64, offset: 1280)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !660, file: !661, line: 304, baseType: !31, size: 64, offset: 1344)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !660, file: !661, line: 305, baseType: !31, size: 64, offset: 1408)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !660, file: !661, line: 306, baseType: !333, size: 64, offset: 1472)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !660, file: !661, line: 308, baseType: !32, size: 32, offset: 1536)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !660, file: !661, line: 310, baseType: !704, size: 160, offset: 1568)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 20)
!707 = !DILocalVariable(name: "str", scope: !645, file: !3, line: 63, type: !708)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 256)
!711 = !DILocation(line: 59, column: 25, scope: !645)
!712 = !DILocation(line: 59, column: 35, scope: !645)
!713 = !DILocation(line: 59, column: 50, scope: !645)
!714 = !DILocation(line: 59, column: 67, scope: !645)
!715 = !DILocation(line: 61, column: 11, scope: !645)
!716 = !DILocation(line: 63, column: 2, scope: !645)
!717 = !DILocation(line: 63, column: 7, scope: !645)
!718 = !DILocation(line: 65, column: 12, scope: !719)
!719 = distinct !DILexicalBlock(scope: !645, file: !3, line: 65, column: 6)
!720 = !DILocation(line: 62, column: 8, scope: !645)
!721 = !DILocation(line: 65, column: 31, scope: !719)
!722 = !DILocation(line: 65, column: 6, scope: !645)
!723 = !DILocation(line: 66, column: 11, scope: !719)
!724 = !DILocation(line: 61, column: 6, scope: !645)
!725 = !DILocation(line: 69, column: 14, scope: !726)
!726 = !DILexicalBlockFile(scope: !727, file: !3, discriminator: 1)
!727 = distinct !DILexicalBlock(scope: !728, file: !3, line: 69, column: 2)
!728 = distinct !DILexicalBlock(scope: !645, file: !3, line: 69, column: 2)
!729 = !DILocation(line: 69, column: 2, scope: !730)
!730 = !DILexicalBlockFile(scope: !728, file: !3, discriminator: 1)
!731 = !DILocation(line: 61, column: 8, scope: !645)
!732 = !DILocation(line: 70, column: 3, scope: !733)
!733 = !DILexicalBlockFile(scope: !734, file: !3, discriminator: 1)
!734 = distinct !DILexicalBlock(scope: !727, file: !3, line: 70, column: 3)
!735 = !DILocation(line: 73, column: 52, scope: !736)
!736 = distinct !DILexicalBlock(scope: !737, file: !3, line: 71, column: 3)
!737 = distinct !DILexicalBlock(scope: !734, file: !3, line: 70, column: 3)
!738 = !DILocation(line: 73, column: 36, scope: !736)
!739 = !{!740, !740, i64 0}
!740 = !{!"float", !623, i64 0}
!741 = !DILocation(line: 73, column: 4, scope: !736)
!742 = !DILocation(line: 74, column: 4, scope: !736)
!743 = !DILocation(line: 75, column: 9, scope: !736)
!744 = !DILocation(line: 70, column: 29, scope: !745)
!745 = !DILexicalBlockFile(scope: !737, file: !3, discriminator: 2)
!746 = !DILocation(line: 70, column: 15, scope: !747)
!747 = !DILexicalBlockFile(scope: !737, file: !3, discriminator: 1)
!748 = distinct !{!748, !749, !750}
!749 = !DILocation(line: 70, column: 3, scope: !734)
!750 = !DILocation(line: 76, column: 3, scope: !734)
!751 = !DILocation(line: 69, column: 28, scope: !752)
!752 = !DILexicalBlockFile(scope: !727, file: !3, discriminator: 2)
!753 = distinct !{!753, !754, !755}
!754 = !DILocation(line: 69, column: 2, scope: !728)
!755 = !DILocation(line: 76, column: 3, scope: !728)
!756 = !DILocation(line: 78, column: 7, scope: !645)
!757 = !DILocation(line: 79, column: 1, scope: !645)
!758 = distinct !DISubprogram(name: "readinput", linkageName: "_Z9readinputPfiiPc", scope: !3, file: !3, line: 82, type: !646, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768}
!760 = !DILocalVariable(name: "vect", arg: 1, scope: !758, file: !3, line: 82, type: !28)
!761 = !DILocalVariable(name: "grid_rows", arg: 2, scope: !758, file: !3, line: 82, type: !32)
!762 = !DILocalVariable(name: "grid_cols", arg: 3, scope: !758, file: !3, line: 82, type: !32)
!763 = !DILocalVariable(name: "file", arg: 4, scope: !758, file: !3, line: 82, type: !34)
!764 = !DILocalVariable(name: "i", scope: !758, file: !3, line: 84, type: !32)
!765 = !DILocalVariable(name: "j", scope: !758, file: !3, line: 84, type: !32)
!766 = !DILocalVariable(name: "fp", scope: !758, file: !3, line: 85, type: !657)
!767 = !DILocalVariable(name: "str", scope: !758, file: !3, line: 86, type: !708)
!768 = !DILocalVariable(name: "val", scope: !758, file: !3, line: 87, type: !29)
!769 = !DILocation(line: 82, column: 23, scope: !758)
!770 = !DILocation(line: 82, column: 33, scope: !758)
!771 = !DILocation(line: 82, column: 48, scope: !758)
!772 = !DILocation(line: 82, column: 65, scope: !758)
!773 = !DILocation(line: 86, column: 2, scope: !758)
!774 = !DILocation(line: 86, column: 7, scope: !758)
!775 = !DILocation(line: 87, column: 2, scope: !758)
!776 = !DILocation(line: 89, column: 13, scope: !777)
!777 = distinct !DILexicalBlock(scope: !758, file: !3, line: 89, column: 6)
!778 = !DILocation(line: 85, column: 8, scope: !758)
!779 = !DILocation(line: 89, column: 32, scope: !777)
!780 = !DILocation(line: 89, column: 6, scope: !758)
!781 = !DILocation(line: 90, column: 13, scope: !777)
!782 = !DILocation(line: 84, column: 8, scope: !758)
!783 = !DILocation(line: 93, column: 14, scope: !784)
!784 = !DILexicalBlockFile(scope: !785, file: !3, discriminator: 1)
!785 = distinct !DILexicalBlock(scope: !786, file: !3, line: 93, column: 2)
!786 = distinct !DILexicalBlock(scope: !758, file: !3, line: 93, column: 2)
!787 = !DILocation(line: 93, column: 2, scope: !788)
!788 = !DILexicalBlockFile(scope: !786, file: !3, discriminator: 1)
!789 = !DILocation(line: 84, column: 10, scope: !758)
!790 = !DILocation(line: 94, column: 3, scope: !791)
!791 = !DILexicalBlockFile(scope: !792, file: !3, discriminator: 1)
!792 = distinct !DILexicalBlock(scope: !785, file: !3, line: 94, column: 3)
!793 = !DILocation(line: 96, column: 3, scope: !794)
!794 = distinct !DILexicalBlock(scope: !795, file: !3, line: 95, column: 3)
!795 = distinct !DILexicalBlock(scope: !792, file: !3, line: 94, column: 3)
!796 = !DILocation(line: 97, column: 7, scope: !797)
!797 = distinct !DILexicalBlock(scope: !794, file: !3, line: 97, column: 7)
!798 = !DILocation(line: 97, column: 7, scope: !794)
!799 = !DILocation(line: 53, column: 13, scope: !633, inlinedAt: !800)
!800 = distinct !DILocation(line: 98, column: 4, scope: !797)
!801 = !DILocation(line: 55, column: 10, scope: !633, inlinedAt: !800)
!802 = !DILocation(line: 55, column: 2, scope: !633, inlinedAt: !800)
!803 = !DILocation(line: 98, column: 4, scope: !797)
!804 = !DILocation(line: 87, column: 8, scope: !758)
!805 = !DILocation(line: 100, column: 8, scope: !806)
!806 = distinct !DILexicalBlock(scope: !794, file: !3, line: 100, column: 7)
!807 = !DILocation(line: 100, column: 32, scope: !806)
!808 = !DILocation(line: 100, column: 7, scope: !794)
!809 = !DILocation(line: 53, column: 13, scope: !633, inlinedAt: !810)
!810 = distinct !DILocation(line: 101, column: 4, scope: !806)
!811 = !DILocation(line: 55, column: 10, scope: !633, inlinedAt: !810)
!812 = !DILocation(line: 55, column: 2, scope: !633, inlinedAt: !810)
!813 = !DILocation(line: 101, column: 4, scope: !806)
!814 = !DILocation(line: 102, column: 25, scope: !794)
!815 = !DILocation(line: 102, column: 19, scope: !794)
!816 = !DILocation(line: 102, column: 3, scope: !794)
!817 = !DILocation(line: 102, column: 23, scope: !794)
!818 = !DILocation(line: 94, column: 32, scope: !819)
!819 = !DILexicalBlockFile(scope: !795, file: !3, discriminator: 2)
!820 = !DILocation(line: 94, column: 15, scope: !821)
!821 = !DILexicalBlockFile(scope: !795, file: !3, discriminator: 1)
!822 = distinct !{!822, !823, !824}
!823 = !DILocation(line: 94, column: 3, scope: !792)
!824 = !DILocation(line: 103, column: 2, scope: !792)
!825 = !DILocation(line: 93, column: 31, scope: !826)
!826 = !DILexicalBlockFile(scope: !785, file: !3, discriminator: 2)
!827 = distinct !{!827, !828, !829}
!828 = !DILocation(line: 93, column: 2, scope: !786)
!829 = !DILocation(line: 103, column: 2, scope: !786)
!830 = !DILocation(line: 105, column: 2, scope: !758)
!831 = !DILocation(line: 107, column: 1, scope: !758)
!832 = distinct !DISubprogram(name: "calculate_temp", linkageName: "_Z14calculate_tempiPfS_S_iiiiffffff", scope: !3, file: !3, line: 113, type: !833, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !835)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !32, !28, !28, !28, !32, !32, !32, !32, !29, !29, !29, !29, !29, !29}
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849}
!836 = !DILocalVariable(name: "iteration", arg: 1, scope: !832, file: !3, line: 113, type: !32)
!837 = !DILocalVariable(name: "power", arg: 2, scope: !832, file: !3, line: 114, type: !28)
!838 = !DILocalVariable(name: "temp_src", arg: 3, scope: !832, file: !3, line: 115, type: !28)
!839 = !DILocalVariable(name: "temp_dst", arg: 4, scope: !832, file: !3, line: 116, type: !28)
!840 = !DILocalVariable(name: "grid_cols", arg: 5, scope: !832, file: !3, line: 117, type: !32)
!841 = !DILocalVariable(name: "grid_rows", arg: 6, scope: !832, file: !3, line: 118, type: !32)
!842 = !DILocalVariable(name: "border_cols", arg: 7, scope: !832, file: !3, line: 119, type: !32)
!843 = !DILocalVariable(name: "border_rows", arg: 8, scope: !832, file: !3, line: 120, type: !32)
!844 = !DILocalVariable(name: "Cap", arg: 9, scope: !832, file: !3, line: 121, type: !29)
!845 = !DILocalVariable(name: "Rx", arg: 10, scope: !832, file: !3, line: 122, type: !29)
!846 = !DILocalVariable(name: "Ry", arg: 11, scope: !832, file: !3, line: 123, type: !29)
!847 = !DILocalVariable(name: "Rz", arg: 12, scope: !832, file: !3, line: 124, type: !29)
!848 = !DILocalVariable(name: "step", arg: 13, scope: !832, file: !3, line: 125, type: !29)
!849 = !DILocalVariable(name: "time_elapsed", arg: 14, scope: !832, file: !3, line: 126, type: !29)
!850 = !DILocation(line: 113, column: 36, scope: !832)
!851 = !{!852, !852, i64 0}
!852 = !{!"int", !623, i64 0}
!853 = !DILocation(line: 114, column: 39, scope: !832)
!854 = !DILocation(line: 115, column: 39, scope: !832)
!855 = !DILocation(line: 116, column: 39, scope: !832)
!856 = !DILocation(line: 117, column: 36, scope: !832)
!857 = !DILocation(line: 118, column: 36, scope: !832)
!858 = !DILocation(line: 119, column: 15, scope: !832)
!859 = !DILocation(line: 120, column: 15, scope: !832)
!860 = !DILocation(line: 121, column: 38, scope: !832)
!861 = !DILocation(line: 122, column: 38, scope: !832)
!862 = !DILocation(line: 123, column: 38, scope: !832)
!863 = !DILocation(line: 124, column: 38, scope: !832)
!864 = !DILocation(line: 125, column: 38, scope: !832)
!865 = !DILocation(line: 126, column: 38, scope: !832)
!866 = !DILocation(line: 126, column: 51, scope: !832)
!867 = !DILocation(line: 126, column: 51, scope: !868)
!868 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 1)
!869 = !DILocation(line: 126, column: 51, scope: !870)
!870 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 2)
!871 = !DILocation(line: 126, column: 51, scope: !872)
!872 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 3)
!873 = !DILocation(line: 126, column: 51, scope: !874)
!874 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 4)
!875 = !DILocation(line: 126, column: 51, scope: !876)
!876 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 5)
!877 = !DILocation(line: 126, column: 51, scope: !878)
!878 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 6)
!879 = !DILocation(line: 126, column: 51, scope: !880)
!880 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 7)
!881 = !DILocation(line: 126, column: 51, scope: !882)
!882 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 8)
!883 = !DILocation(line: 126, column: 51, scope: !884)
!884 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 9)
!885 = !DILocation(line: 126, column: 51, scope: !886)
!886 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 10)
!887 = !DILocation(line: 126, column: 51, scope: !888)
!888 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 11)
!889 = !DILocation(line: 126, column: 51, scope: !890)
!890 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 12)
!891 = !DILocation(line: 126, column: 51, scope: !892)
!892 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 13)
!893 = !DILocation(line: 126, column: 51, scope: !894)
!894 = !DILexicalBlockFile(scope: !832, file: !3, discriminator: 14)
!895 = !DILocation(line: 224, column: 1, scope: !832)
!896 = distinct !DISubprogram(name: "compute_tran_temp", linkageName: "_Z17compute_tran_tempPfPS_iiiiiiii", scope: !3, file: !3, line: 230, type: !897, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !900)
!897 = !DISubroutineType(types: !898)
!898 = !{!32, !28, !899, !32, !32, !32, !32, !32, !32, !32, !32}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !953}
!901 = !DILocalVariable(name: "MatrixPower", arg: 1, scope: !896, file: !3, line: 230, type: !28)
!902 = !DILocalVariable(name: "MatrixTemp", arg: 2, scope: !896, file: !3, line: 230, type: !899)
!903 = !DILocalVariable(name: "col", arg: 3, scope: !896, file: !3, line: 230, type: !32)
!904 = !DILocalVariable(name: "row", arg: 4, scope: !896, file: !3, line: 230, type: !32)
!905 = !DILocalVariable(name: "total_iterations", arg: 5, scope: !896, file: !3, line: 231, type: !32)
!906 = !DILocalVariable(name: "num_iterations", arg: 6, scope: !896, file: !3, line: 231, type: !32)
!907 = !DILocalVariable(name: "blockCols", arg: 7, scope: !896, file: !3, line: 231, type: !32)
!908 = !DILocalVariable(name: "blockRows", arg: 8, scope: !896, file: !3, line: 231, type: !32)
!909 = !DILocalVariable(name: "borderCols", arg: 9, scope: !896, file: !3, line: 231, type: !32)
!910 = !DILocalVariable(name: "borderRows", arg: 10, scope: !896, file: !3, line: 231, type: !32)
!911 = !DILocalVariable(name: "dimBlock", scope: !896, file: !3, line: 233, type: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "dim3", file: !913, line: 427, baseType: !914)
!913 = !DIFile(filename: "/usr/local/cuda/include/vector_types.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/hotspotllvm")
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dim3", file: !913, line: 417, size: 96, elements: !915, identifier: "_ZTS4dim3")
!915 = !{!916, !917, !918, !919, !923, !932}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !914, file: !913, line: 419, baseType: !402, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !914, file: !913, line: 419, baseType: !402, size: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !914, file: !913, line: 419, baseType: !402, size: 32, offset: 64)
!919 = !DISubprogram(name: "dim3", scope: !914, file: !913, line: 421, type: !920, isLocal: false, isDefinition: false, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !922, !402, !402, !402}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!923 = !DISubprogram(name: "dim3", scope: !914, file: !913, line: 422, type: !924, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !922, !926}
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !913, line: 383, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uint3", file: !913, line: 190, size: 96, elements: !928, identifier: "_ZTS5uint3")
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !927, file: !913, line: 192, baseType: !402, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !927, file: !913, line: 192, baseType: !402, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !927, file: !913, line: 192, baseType: !402, size: 32, offset: 64)
!932 = !DISubprogram(name: "operator uint3", linkageName: "_ZN4dim3cv5uint3Ev", scope: !914, file: !913, line: 423, type: !933, isLocal: false, isDefinition: false, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true)
!933 = !DISubroutineType(types: !934)
!934 = !{!926, !922}
!935 = !DILocalVariable(name: "dimGrid", scope: !896, file: !3, line: 234, type: !912)
!936 = !DILocalVariable(name: "grid_height", scope: !896, file: !3, line: 236, type: !29)
!937 = !DILocalVariable(name: "grid_width", scope: !896, file: !3, line: 237, type: !29)
!938 = !DILocalVariable(name: "Cap", scope: !896, file: !3, line: 239, type: !29)
!939 = !DILocalVariable(name: "Rx", scope: !896, file: !3, line: 240, type: !29)
!940 = !DILocalVariable(name: "Ry", scope: !896, file: !3, line: 241, type: !29)
!941 = !DILocalVariable(name: "Rz", scope: !896, file: !3, line: 242, type: !29)
!942 = !DILocalVariable(name: "max_slope", scope: !896, file: !3, line: 244, type: !29)
!943 = !DILocalVariable(name: "step", scope: !896, file: !3, line: 245, type: !29)
!944 = !DILocalVariable(name: "t", scope: !896, file: !3, line: 246, type: !29)
!945 = !DILocalVariable(name: "time_elapsed", scope: !896, file: !3, line: 247, type: !29)
!946 = !DILocalVariable(name: "src", scope: !896, file: !3, line: 250, type: !32)
!947 = !DILocalVariable(name: "dst", scope: !896, file: !3, line: 250, type: !32)
!948 = !DILocalVariable(name: "time0", scope: !896, file: !3, line: 257, type: !27)
!949 = !DILocalVariable(name: "temp", scope: !950, file: !3, line: 259, type: !32)
!950 = distinct !DILexicalBlock(scope: !951, file: !3, line: 258, column: 55)
!951 = distinct !DILexicalBlock(scope: !952, file: !3, line: 258, column: 2)
!952 = distinct !DILexicalBlock(scope: !896, file: !3, line: 258, column: 2)
!953 = !DILocalVariable(name: "time1", scope: !896, file: !3, line: 267, type: !27)
!954 = !DILocation(line: 230, column: 30, scope: !896)
!955 = !DILocation(line: 230, column: 49, scope: !896)
!956 = !DILocation(line: 230, column: 68, scope: !896)
!957 = !DILocation(line: 230, column: 77, scope: !896)
!958 = !DILocation(line: 231, column: 7, scope: !896)
!959 = !DILocation(line: 231, column: 29, scope: !896)
!960 = !DILocation(line: 231, column: 49, scope: !896)
!961 = !DILocation(line: 231, column: 64, scope: !896)
!962 = !DILocation(line: 231, column: 79, scope: !896)
!963 = !DILocation(line: 231, column: 95, scope: !896)
!964 = !DILocation(line: 233, column: 14, scope: !896)
!965 = !DILocation(line: 234, column: 14, scope: !896)
!966 = !DILocation(line: 236, column: 22, scope: !896)
!967 = !DILocation(line: 236, column: 36, scope: !896)
!968 = !DILocation(line: 236, column: 34, scope: !896)
!969 = !DILocation(line: 236, column: 8, scope: !896)
!970 = !DILocation(line: 237, column: 21, scope: !896)
!971 = !DILocation(line: 237, column: 34, scope: !896)
!972 = !DILocation(line: 237, column: 32, scope: !896)
!973 = !DILocation(line: 237, column: 8, scope: !896)
!974 = !DILocation(line: 239, column: 43, scope: !896)
!975 = !DILocation(line: 239, column: 41, scope: !896)
!976 = !DILocation(line: 239, column: 52, scope: !896)
!977 = !DILocation(line: 239, column: 50, scope: !896)
!978 = !DILocation(line: 239, column: 65, scope: !896)
!979 = !DILocation(line: 239, column: 63, scope: !896)
!980 = !DILocation(line: 239, column: 14, scope: !896)
!981 = !DILocation(line: 239, column: 8, scope: !896)
!982 = !DILocation(line: 240, column: 38, scope: !896)
!983 = !DILocation(line: 240, column: 47, scope: !896)
!984 = !DILocation(line: 240, column: 24, scope: !896)
!985 = !DILocation(line: 240, column: 13, scope: !896)
!986 = !DILocation(line: 240, column: 8, scope: !896)
!987 = !DILocation(line: 241, column: 48, scope: !896)
!988 = !DILocation(line: 241, column: 25, scope: !896)
!989 = !DILocation(line: 241, column: 13, scope: !896)
!990 = !DILocation(line: 241, column: 8, scope: !896)
