; ModuleID = 'syr2k.cu'
source_filename = "syr2k.cu"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timezone = type { i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.cudaDeviceProp = type { [256 x i8], i64, i64, i32, i32, i64, i32, [3 x i32], [3 x i32], i32, i64, i32, i32, i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [2 x i32], [3 x i32], [2 x i32], [3 x i32], [3 x i32], i32, [2 x i32], [3 x i32], [2 x i32], i32, [2 x i32], [3 x i32], [2 x i32], [3 x i32], i32, [2 x i32], i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32 }
%struct.dim3 = type { i32, i32, i32 }
%struct.CUstream_st = type opaque

@.str = private unnamed_addr constant [35 x i8] c"Error return from gettimeofday: %d\00", align 1
@.str.1 = private unnamed_addr constant [74 x i8] c"Non-Matching CPU-GPU Outputs Beyond Error Threshold of %4.2f Percent: %d\0A\00", align 1
@.str.2 = private unnamed_addr constant [32 x i8] c"setting device %d with name %s\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!225 = !DISubprogram(name: "atan2", scope: !217, file: !217, line: 60, type: !226, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!226 = !DISubroutineType(types: !227)
!227 = !{!165, !165, !165}
!228 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !229, line: 180)
!229 = !DISubprogram(name: "ceil", scope: !217, file: !217, line: 178, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !231, line: 199)
!231 = !DISubprogram(name: "cos", scope: !217, file: !217, line: 63, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !233, line: 218)
!233 = !DISubprogram(name: "cosh", scope: !217, file: !217, line: 72, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !235, line: 237)
!235 = !DISubprogram(name: "exp", scope: !217, file: !217, line: 100, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !237, line: 256)
!237 = !DISubprogram(name: "fabs", scope: !217, file: !217, line: 181, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !239, line: 275)
!239 = !DISubprogram(name: "floor", scope: !217, file: !217, line: 184, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !241, line: 294)
!241 = !DISubprogram(name: "fmod", scope: !217, file: !217, line: 187, type: !226, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !243, line: 315)
!243 = !DISubprogram(name: "frexp", scope: !217, file: !217, line: 103, type: !244, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!244 = !DISubroutineType(types: !245)
!245 = !{!165, !165, !91}
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !247, line: 334)
!247 = !DISubprogram(name: "ldexp", scope: !217, file: !217, line: 106, type: !248, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!248 = !DISubroutineType(types: !249)
!249 = !{!165, !165, !86}
!250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !251, line: 353)
!251 = !DISubprogram(name: "log", scope: !217, file: !217, line: 109, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !253, line: 372)
!253 = !DISubprogram(name: "log10", scope: !217, file: !217, line: 112, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !255, line: 391)
!255 = !DISubprogram(name: "modf", scope: !217, file: !217, line: 115, type: !256, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!256 = !DISubroutineType(types: !257)
!257 = !{!165, !165, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !260, line: 403)
!260 = !DISubprogram(name: "pow", scope: !217, file: !217, line: 153, type: !226, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!261 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !262, line: 440)
!262 = !DISubprogram(name: "sin", scope: !217, file: !217, line: 65, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!263 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !264, line: 459)
!264 = !DISubprogram(name: "sinh", scope: !217, file: !217, line: 74, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!265 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !266, line: 478)
!266 = !DISubprogram(name: "sqrt", scope: !217, file: !217, line: 156, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !268, line: 497)
!268 = !DISubprogram(name: "tan", scope: !217, file: !217, line: 67, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !270, line: 516)
!270 = !DISubprogram(name: "tanh", scope: !217, file: !217, line: 76, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !272, line: 118)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !273, line: 101, baseType: !274)
!273 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!274 = !DICompositeType(tag: DW_TAG_structure_type, file: !273, line: 97, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!275 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !276, line: 119)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !273, line: 109, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !273, line: 105, size: 128, elements: !278, identifier: "_ZTS6ldiv_t")
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !277, file: !273, line: 107, baseType: !125, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !277, file: !273, line: 108, baseType: !125, size: 64, offset: 64)
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !282, line: 121)
!282 = !DISubprogram(name: "abort", scope: !273, file: !273, line: 515, type: !283, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!283 = !DISubroutineType(types: !284)
!284 = !{null}
!285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !286, line: 122)
!286 = !DISubprogram(name: "abs", scope: !273, file: !273, line: 775, type: !287, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{!86, !86}
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !290, line: 123)
!290 = !DISubprogram(name: "atexit", scope: !273, file: !273, line: 519, type: !291, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!291 = !DISubroutineType(types: !292)
!292 = !{!86, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!294 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !295, line: 129)
!295 = !DISubprogram(name: "atof", scope: !296, file: !296, line: 26, type: !163, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!296 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !298, line: 130)
!298 = !DISubprogram(name: "atoi", scope: !273, file: !273, line: 278, type: !299, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!299 = !DISubroutineType(types: !300)
!300 = !{!86, !166}
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !302, line: 131)
!302 = !DISubprogram(name: "atol", scope: !273, file: !273, line: 283, type: !303, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!303 = !DISubroutineType(types: !304)
!304 = !{!125, !166}
!305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !306, line: 132)
!306 = !DISubprogram(name: "bsearch", scope: !307, file: !307, line: 20, type: !308, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!307 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!308 = !DISubroutineType(types: !309)
!309 = !{!15, !310, !310, !16, !16, !312}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !273, line: 742, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!86, !310, !310}
!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !317, line: 133)
!317 = !DISubprogram(name: "calloc", scope: !273, file: !273, line: 468, type: !318, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!318 = !DISubroutineType(types: !319)
!319 = !{!15, !16, !16}
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !321, line: 134)
!321 = !DISubprogram(name: "div", scope: !273, file: !273, line: 789, type: !322, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!322 = !DISubroutineType(types: !323)
!323 = !{!272, !86, !86}
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !325, line: 135)
!325 = !DISubprogram(name: "exit", scope: !273, file: !273, line: 543, type: !326, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !86}
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !329, line: 136)
!329 = !DISubprogram(name: "free", scope: !273, file: !273, line: 483, type: !330, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !15}
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !333, line: 137)
!333 = !DISubprogram(name: "getenv", scope: !273, file: !273, line: 564, type: !334, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!334 = !DISubroutineType(types: !335)
!335 = !{!336, !166}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !338, line: 138)
!338 = !DISubprogram(name: "labs", scope: !273, file: !273, line: 776, type: !123, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !340, line: 139)
!340 = !DISubprogram(name: "ldiv", scope: !273, file: !273, line: 791, type: !341, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!341 = !DISubroutineType(types: !342)
!342 = !{!276, !125, !125}
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !344, line: 140)
!344 = !DISubprogram(name: "malloc", scope: !273, file: !273, line: 466, type: !345, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{!15, !16}
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !348, line: 142)
!348 = !DISubprogram(name: "mblen", scope: !273, file: !273, line: 863, type: !349, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!349 = !DISubroutineType(types: !350)
!350 = !{!86, !166, !16}
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !352, line: 143)
!352 = !DISubprogram(name: "mbstowcs", scope: !273, file: !273, line: 874, type: !353, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{!16, !355, !358, !16}
!355 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !166)
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !360, line: 144)
!360 = !DISubprogram(name: "mbtowc", scope: !273, file: !273, line: 866, type: !361, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!361 = !DISubroutineType(types: !362)
!362 = !{!86, !355, !358, !16}
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !364, line: 146)
!364 = !DISubprogram(name: "qsort", scope: !273, file: !273, line: 765, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !15, !16, !16, !312}
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !368, line: 152)
!368 = !DISubprogram(name: "rand", scope: !273, file: !273, line: 374, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!369 = !DISubroutineType(types: !370)
!370 = !{!86}
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !372, line: 153)
!372 = !DISubprogram(name: "realloc", scope: !273, file: !273, line: 480, type: !373, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{!15, !15, !16}
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !376, line: 154)
!376 = !DISubprogram(name: "srand", scope: !273, file: !273, line: 376, type: !377, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !379}
!379 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !381, line: 155)
!381 = !DISubprogram(name: "strtod", scope: !273, file: !273, line: 164, type: !382, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{!165, !358, !384}
!384 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !387, line: 156)
!387 = !DISubprogram(name: "strtol", scope: !273, file: !273, line: 183, type: !388, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!388 = !DISubroutineType(types: !389)
!389 = !{!125, !358, !384, !86}
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !391, line: 157)
!391 = !DISubprogram(name: "strtoul", scope: !273, file: !273, line: 187, type: !392, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!392 = !DISubroutineType(types: !393)
!393 = !{!18, !358, !384, !86}
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !395, line: 158)
!395 = !DISubprogram(name: "system", scope: !273, file: !273, line: 717, type: !299, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !397, line: 160)
!397 = !DISubprogram(name: "wcstombs", scope: !273, file: !273, line: 877, type: !398, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!398 = !DISubroutineType(types: !399)
!399 = !{!16, !400, !401, !16}
!400 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !336)
!401 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !405, line: 161)
!405 = !DISubprogram(name: "wctomb", scope: !273, file: !273, line: 870, type: !406, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!406 = !DISubroutineType(types: !407)
!407 = !{!86, !336, !357}
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !409, entity: !411, line: 201)
!409 = !DINamespace(name: "__gnu_cxx", scope: null, file: !410, line: 68)
!410 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/bits/cpp_type_traits.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !273, line: 121, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !273, line: 117, size: 128, elements: !413, identifier: "_ZTS7lldiv_t")
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !412, file: !273, line: 119, baseType: !27, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !412, file: !273, line: 120, baseType: !27, size: 64, offset: 64)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !409, entity: !417, line: 207)
!417 = !DISubprogram(name: "_Exit", scope: !273, file: !273, line: 557, type: !326, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !409, entity: !419, line: 211)
!419 = !DISubprogram(name: "llabs", scope: !273, file: !273, line: 780, type: !25, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !409, entity: !421, line: 217)
!421 = !DISubprogram(name: "lldiv", scope: !273, file: !273, line: 797, type: !422, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!422 = !DISubroutineType(types: !423)
!423 = !{!411, !27, !27}
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !409, entity: !425, line: 228)
!425 = !DISubprogram(name: "atoll", scope: !273, file: !273, line: 292, type: !426, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!426 = !DISubroutineType(types: !427)
!427 = !{!27, !166}
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !409, entity: !429, line: 229)
!429 = !DISubprogram(name: "strtoll", scope: !273, file: !273, line: 209, type: !430, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!430 = !DISubroutineType(types: !431)
!431 = !{!27, !358, !384, !86}
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !409, entity: !433, line: 230)
!433 = !DISubprogram(name: "strtoull", scope: !273, file: !273, line: 214, type: !434, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !358, !384, !86}
!436 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !409, entity: !438, line: 232)
!438 = !DISubprogram(name: "strtof", scope: !273, file: !273, line: 172, type: !439, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!439 = !DISubroutineType(types: !440)
!440 = !{!13, !358, !384}
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !409, entity: !442, line: 233)
!442 = !DISubprogram(name: "strtold", scope: !273, file: !273, line: 175, type: !443, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!443 = !DISubroutineType(types: !444)
!444 = !{!445, !358, !384}
!445 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !411, line: 241)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !417, line: 243)
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !419, line: 245)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !450, line: 246)
!450 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !409, file: !451, line: 214, type: !422, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!451 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/4.8/../../../../include/c++/4.8/cstdlib", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !421, line: 247)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !425, line: 249)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !438, line: 250)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !429, line: 251)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !433, line: 252)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !442, line: 253)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !459, line: 418)
!459 = !DISubprogram(name: "acosf", linkageName: "_ZL5acosff", scope: !460, file: !460, line: 1126, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!460 = !DIFile(filename: "/usr/local/cuda/include/math_functions.hpp", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !462, line: 419)
!462 = !DISubprogram(name: "acoshf", linkageName: "_ZL6acoshff", scope: !460, file: !460, line: 1154, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !464, line: 420)
!464 = !DISubprogram(name: "asinf", linkageName: "_ZL5asinff", scope: !460, file: !460, line: 1121, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !466, line: 421)
!466 = !DISubprogram(name: "asinhf", linkageName: "_ZL6asinhff", scope: !460, file: !460, line: 1159, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !468, line: 422)
!468 = !DISubprogram(name: "atan2f", linkageName: "_ZL6atan2fff", scope: !460, file: !460, line: 1111, type: !42, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !470, line: 423)
!470 = !DISubprogram(name: "atanf", linkageName: "_ZL5atanff", scope: !460, file: !460, line: 1116, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !472, line: 424)
!472 = !DISubprogram(name: "atanhf", linkageName: "_ZL6atanhff", scope: !460, file: !460, line: 1164, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !474, line: 425)
!474 = !DISubprogram(name: "cbrtf", linkageName: "_ZL5cbrtff", scope: !460, file: !460, line: 1199, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !476, line: 426)
!476 = !DISubprogram(name: "ceilf", linkageName: "_ZL5ceilff", scope: !477, file: !477, line: 647, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!477 = !DIFile(filename: "/usr/local/cuda/include/device_functions.hpp", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !479, line: 427)
!479 = !DISubprogram(name: "copysignf", linkageName: "_ZL9copysignfff", scope: !460, file: !460, line: 973, type: !42, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !481, line: 428)
!481 = !DISubprogram(name: "cosf", linkageName: "_ZL4cosff", scope: !460, file: !460, line: 1027, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !483, line: 429)
!483 = !DISubprogram(name: "coshf", linkageName: "_ZL5coshff", scope: !460, file: !460, line: 1096, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !485, line: 430)
!485 = !DISubprogram(name: "erfcf", linkageName: "_ZL5erfcff", scope: !460, file: !460, line: 1259, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !487, line: 431)
!487 = !DISubprogram(name: "erff", linkageName: "_ZL4erfff", scope: !460, file: !460, line: 1249, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !489, line: 432)
!489 = !DISubprogram(name: "exp2f", linkageName: "_ZL5exp2ff", scope: !477, file: !477, line: 637, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !491, line: 433)
!491 = !DISubprogram(name: "expf", linkageName: "_ZL4expff", scope: !460, file: !460, line: 1078, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !493, line: 434)
!493 = !DISubprogram(name: "expm1f", linkageName: "_ZL6expm1ff", scope: !460, file: !460, line: 1169, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !495, line: 435)
!495 = !DISubprogram(name: "fabsf", linkageName: "_ZL5fabsff", scope: !477, file: !477, line: 582, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !497, line: 436)
!497 = !DISubprogram(name: "fdimf", linkageName: "_ZL5fdimfff", scope: !460, file: !460, line: 1385, type: !42, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !499, line: 437)
!499 = !DISubprogram(name: "floorf", linkageName: "_ZL6floorff", scope: !477, file: !477, line: 572, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !501, line: 438)
!501 = !DISubprogram(name: "fmaf", linkageName: "_ZL4fmaffff", scope: !460, file: !460, line: 1337, type: !74, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !503, line: 439)
!503 = !DISubprogram(name: "fmaxf", linkageName: "_ZL5fmaxfff", scope: !477, file: !477, line: 602, type: !42, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !505, line: 440)
!505 = !DISubprogram(name: "fminf", linkageName: "_ZL5fminfff", scope: !477, file: !477, line: 597, type: !42, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !507, line: 441)
!507 = !DISubprogram(name: "fmodf", linkageName: "_ZL5fmodfff", scope: !460, file: !460, line: 1322, type: !42, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !509, line: 442)
!509 = !DISubprogram(name: "frexpf", linkageName: "_ZL6frexpffPi", scope: !460, file: !460, line: 1312, type: !89, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !511, line: 443)
!511 = !DISubprogram(name: "hypotf", linkageName: "_ZL6hypotfff", scope: !460, file: !460, line: 1174, type: !42, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !513, line: 444)
!513 = !DISubprogram(name: "ilogbf", linkageName: "_ZL6ilogbff", scope: !460, file: !460, line: 1390, type: !84, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !515, line: 445)
!515 = !DISubprogram(name: "ldexpf", linkageName: "_ZL6ldexpffi", scope: !460, file: !460, line: 1289, type: !128, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !517, line: 446)
!517 = !DISubprogram(name: "lgammaf", linkageName: "_ZL7lgammaff", scope: !460, file: !460, line: 1284, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !519, line: 447)
!519 = !DISubprogram(name: "llrintf", linkageName: "_ZL7llrintff", scope: !460, file: !460, line: 933, type: !136, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !521, line: 448)
!521 = !DISubprogram(name: "llroundf", linkageName: "_ZL8llroundff", scope: !460, file: !460, line: 1371, type: !136, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !523, line: 449)
!523 = !DISubprogram(name: "log10f", linkageName: "_ZL6log10ff", scope: !460, file: !460, line: 1140, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !525, line: 450)
!525 = !DISubprogram(name: "log1pf", linkageName: "_ZL6log1pff", scope: !460, file: !460, line: 1149, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !527, line: 451)
!527 = !DISubprogram(name: "log2f", linkageName: "_ZL5log2ff", scope: !460, file: !460, line: 1069, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !529, line: 452)
!529 = !DISubprogram(name: "logbf", linkageName: "_ZL5logbff", scope: !460, file: !460, line: 1395, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !531, line: 453)
!531 = !DISubprogram(name: "logf", linkageName: "_ZL4logff", scope: !460, file: !460, line: 1131, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !533, line: 454)
!533 = !DISubprogram(name: "lrintf", linkageName: "_ZL6lrintff", scope: !460, file: !460, line: 924, type: !150, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !535, line: 455)
!535 = !DISubprogram(name: "lroundf", linkageName: "_ZL7lroundff", scope: !460, file: !460, line: 1376, type: !150, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !537, line: 456)
!537 = !DISubprogram(name: "modff", linkageName: "_ZL5modfffPf", scope: !460, file: !460, line: 1317, type: !158, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !539, line: 457)
!539 = !DISubprogram(name: "nearbyintf", linkageName: "_ZL10nearbyintff", scope: !460, file: !460, line: 938, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !541, line: 458)
!541 = !DISubprogram(name: "nextafterf", linkageName: "_ZL10nextafterfff", scope: !460, file: !460, line: 1002, type: !42, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !543, line: 459)
!543 = !DISubprogram(name: "nexttowardf", scope: !217, file: !217, line: 284, type: !544, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!544 = !DISubroutineType(types: !545)
!545 = !{!13, !13, !445}
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !543, line: 460)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !548, line: 461)
!548 = !DISubprogram(name: "powf", linkageName: "_ZL4powfff", scope: !460, file: !460, line: 1352, type: !42, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !550, line: 462)
!550 = !DISubprogram(name: "remainderf", linkageName: "_ZL10remainderfff", scope: !460, file: !460, line: 1327, type: !42, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !552, line: 463)
!552 = !DISubprogram(name: "remquof", linkageName: "_ZL7remquofffPi", scope: !460, file: !460, line: 1332, type: !187, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !554, line: 464)
!554 = !DISubprogram(name: "rintf", linkageName: "_ZL5rintff", scope: !460, file: !460, line: 919, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !556, line: 465)
!556 = !DISubprogram(name: "roundf", linkageName: "_ZL6roundff", scope: !460, file: !460, line: 1366, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !558, line: 466)
!558 = !DISubprogram(name: "scalblnf", linkageName: "_ZL8scalblnffl", scope: !460, file: !460, line: 1299, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !560, line: 467)
!560 = !DISubprogram(name: "scalbnf", linkageName: "_ZL7scalbnffi", scope: !460, file: !460, line: 1294, type: !128, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !562, line: 468)
!562 = !DISubprogram(name: "sinf", linkageName: "_ZL4sinff", scope: !460, file: !460, line: 1018, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !564, line: 469)
!564 = !DISubprogram(name: "sinhf", linkageName: "_ZL5sinhff", scope: !460, file: !460, line: 1101, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !566, line: 470)
!566 = !DISubprogram(name: "sqrtf", linkageName: "_ZL5sqrtff", scope: !477, file: !477, line: 887, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !568, line: 471)
!568 = !DISubprogram(name: "tanf", linkageName: "_ZL4tanff", scope: !460, file: !460, line: 1060, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !570, line: 472)
!570 = !DISubprogram(name: "tanhf", linkageName: "_ZL5tanhff", scope: !460, file: !460, line: 1106, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !572, line: 473)
!572 = !DISubprogram(name: "tgammaf", linkageName: "_ZL7tgammaff", scope: !460, file: !460, line: 1361, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !574, line: 474)
!574 = !DISubprogram(name: "truncf", linkageName: "_ZL6truncff", scope: !477, file: !477, line: 642, type: !30, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!575 = !{i32 2, !"Dwarf Version", i32 4}
!576 = !{i32 2, !"Debug Info Version", i32 3}
!577 = !{!"clang version 5.0.0 (trunk 294196)"}
!578 = distinct !DISubprogram(name: "rtclock", linkageName: "_Z7rtclockv", scope: !579, file: !579, line: 11, type: !580, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !582)
!579 = !DIFile(filename: "./../../common/polybenchUtilFuncts.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!580 = !DISubroutineType(types: !581)
!581 = !{!165}
!582 = !{!583, !589, !598}
!583 = !DILocalVariable(name: "Tzp", scope: !578, file: !579, line: 13, type: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !585, line: 55, size: 64, elements: !586, identifier: "_ZTS8timezone")
!585 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/time.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !584, file: !585, line: 57, baseType: !86, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !584, file: !585, line: 58, baseType: !86, size: 32, offset: 32)
!589 = !DILocalVariable(name: "Tp", scope: !578, file: !579, line: 14, type: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !591, line: 30, size: 128, elements: !592, identifier: "_ZTS7timeval")
!591 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!592 = !{!593, !596}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !590, file: !591, line: 32, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !595, line: 139, baseType: !125)
!595 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !590, file: !591, line: 33, baseType: !597, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !595, line: 141, baseType: !125)
!598 = !DILocalVariable(name: "stat", scope: !578, file: !579, line: 15, type: !86)
!599 = !DILocation(line: 13, column: 5, scope: !578)
!600 = !DILocation(line: 14, column: 5, scope: !578)
!601 = !DIExpression(DW_OP_deref)
!602 = !DILocation(line: 13, column: 21, scope: !578)
!603 = !DILocation(line: 14, column: 20, scope: !578)
!604 = !DILocation(line: 16, column: 12, scope: !578)
!605 = !DIExpression()
!606 = !DILocation(line: 15, column: 9, scope: !578)
!607 = !DILocation(line: 17, column: 14, scope: !608)
!608 = distinct !DILexicalBlock(scope: !578, file: !579, line: 17, column: 9)
!609 = !DILocation(line: 17, column: 9, scope: !578)
!610 = !DILocation(line: 17, column: 20, scope: !611)
!611 = !DILexicalBlockFile(scope: !608, file: !579, discriminator: 1)
!612 = !DILocation(line: 18, column: 15, scope: !578)
!613 = !{!614, !615, i64 0}
!614 = !{!"_ZTS7timeval", !615, i64 0, !615, i64 8}
!615 = !{!"long", !616, i64 0}
!616 = !{!"omnipotent char", !617, i64 0}
!617 = !{!"Simple C++ TBAA"}
!618 = !DILocation(line: 18, column: 12, scope: !578)
!619 = !DILocation(line: 18, column: 27, scope: !578)
!620 = !{!614, !615, i64 8}
!621 = !DILocation(line: 18, column: 24, scope: !578)
!622 = !DILocation(line: 18, column: 34, scope: !578)
!623 = !DILocation(line: 18, column: 22, scope: !578)
!624 = !DILocation(line: 19, column: 1, scope: !578)
!625 = !DILocation(line: 18, column: 5, scope: !578)
!626 = distinct !DISubprogram(name: "absVal", linkageName: "_Z6absValf", scope: !579, file: !579, line: 22, type: !30, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !627)
!627 = !{!628}
!628 = !DILocalVariable(name: "a", arg: 1, scope: !626, file: !579, line: 22, type: !13)
!629 = !DILocation(line: 22, column: 20, scope: !626)
!630 = !DILocation(line: 24, column: 7, scope: !631)
!631 = distinct !DILexicalBlock(scope: !626, file: !579, line: 24, column: 5)
!632 = !DILocation(line: 26, column: 13, scope: !633)
!633 = distinct !DILexicalBlock(scope: !631, file: !579, line: 25, column: 2)
!634 = !DILocation(line: 24, column: 5, scope: !626)
!635 = !DILocation(line: 32, column: 1, scope: !626)
!636 = distinct !DISubprogram(name: "percentDiff", linkageName: "_Z11percentDiffdd", scope: !579, file: !579, line: 36, type: !637, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{!13, !165, !165}
!639 = !{!640, !641}
!640 = !DILocalVariable(name: "val1", arg: 1, scope: !636, file: !579, line: 36, type: !165)
!641 = !DILocalVariable(name: "val2", arg: 2, scope: !636, file: !579, line: 36, type: !165)
!642 = !DILocation(line: 36, column: 26, scope: !636)
!643 = !DILocation(line: 36, column: 39, scope: !636)
!644 = !DILocation(line: 38, column: 14, scope: !645)
!645 = distinct !DILexicalBlock(scope: !636, file: !579, line: 38, column: 6)
!646 = !DILocation(line: 22, column: 20, scope: !626, inlinedAt: !647)
!647 = distinct !DILocation(line: 38, column: 7, scope: !645)
!648 = !DILocation(line: 24, column: 7, scope: !631, inlinedAt: !647)
!649 = !DILocation(line: 26, column: 13, scope: !633, inlinedAt: !647)
!650 = !DILocation(line: 24, column: 5, scope: !626, inlinedAt: !647)
!651 = !DILocation(line: 38, column: 7, scope: !645)
!652 = !DILocation(line: 38, column: 20, scope: !645)
!653 = !DILocation(line: 38, column: 28, scope: !645)
!654 = !DILocation(line: 38, column: 39, scope: !655)
!655 = !DILexicalBlockFile(scope: !645, file: !579, discriminator: 1)
!656 = !DILocation(line: 22, column: 20, scope: !626, inlinedAt: !657)
!657 = distinct !DILocation(line: 38, column: 32, scope: !655)
!658 = !DILocation(line: 24, column: 7, scope: !631, inlinedAt: !657)
!659 = !DILocation(line: 26, column: 13, scope: !633, inlinedAt: !657)
!660 = !DILocation(line: 24, column: 5, scope: !626, inlinedAt: !657)
!661 = !DILocation(line: 38, column: 32, scope: !655)
!662 = !DILocation(line: 38, column: 45, scope: !655)
!663 = !DILocation(line: 38, column: 6, scope: !664)
!664 = !DILexicalBlockFile(scope: !636, file: !579, discriminator: 1)
!665 = !DILocation(line: 45, column: 43, scope: !666)
!666 = distinct !DILexicalBlock(scope: !645, file: !579, line: 44, column: 2)
!667 = !DILocation(line: 45, column: 38, scope: !666)
!668 = !DILocation(line: 22, column: 20, scope: !626, inlinedAt: !669)
!669 = distinct !DILocation(line: 45, column: 31, scope: !666)
!670 = !DILocation(line: 24, column: 7, scope: !631, inlinedAt: !669)
!671 = !DILocation(line: 26, column: 13, scope: !633, inlinedAt: !669)
!672 = !DILocation(line: 24, column: 5, scope: !626, inlinedAt: !669)
!673 = !DILocation(line: 45, column: 65, scope: !666)
!674 = !DILocation(line: 45, column: 60, scope: !666)
!675 = !DILocation(line: 22, column: 20, scope: !626, inlinedAt: !676)
!676 = distinct !DILocation(line: 45, column: 53, scope: !677)
!677 = !DILexicalBlockFile(scope: !666, file: !579, discriminator: 1)
!678 = !DILocation(line: 24, column: 7, scope: !631, inlinedAt: !676)
!679 = !DILocation(line: 26, column: 13, scope: !633, inlinedAt: !676)
!680 = !DILocation(line: 24, column: 5, scope: !626, inlinedAt: !676)
!681 = !DILocation(line: 45, column: 51, scope: !666)
!682 = !DILocation(line: 22, column: 20, scope: !626, inlinedAt: !683)
!683 = distinct !DILocation(line: 45, column: 24, scope: !684)
!684 = !DILexicalBlockFile(scope: !666, file: !579, discriminator: 2)
!685 = !DILocation(line: 24, column: 7, scope: !631, inlinedAt: !683)
!686 = !DILocation(line: 26, column: 13, scope: !633, inlinedAt: !683)
!687 = !DILocation(line: 24, column: 5, scope: !626, inlinedAt: !683)
!688 = !DILocation(line: 45, column: 21, scope: !666)
!689 = !DILocation(line: 45, column: 7, scope: !666)
!690 = !DILocation(line: 47, column: 1, scope: !636)
!691 = distinct !DISubprogram(name: "init_arrays", linkageName: "_Z11init_arraysPfS_S_", scope: !1, file: !1, line: 42, type: !692, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !694)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !19, !19, !19}
!694 = !{!695, !696, !697, !698, !699}
!695 = !DILocalVariable(name: "A", arg: 1, scope: !691, file: !1, line: 42, type: !19)
!696 = !DILocalVariable(name: "B", arg: 2, scope: !691, file: !1, line: 42, type: !19)
!697 = !DILocalVariable(name: "C", arg: 3, scope: !691, file: !1, line: 42, type: !19)
!698 = !DILocalVariable(name: "i", scope: !691, file: !1, line: 44, type: !86)
!699 = !DILocalVariable(name: "j", scope: !691, file: !1, line: 44, type: !86)
!700 = !DILocation(line: 42, column: 29, scope: !691)
!701 = !DILocation(line: 42, column: 43, scope: !691)
!702 = !DILocation(line: 42, column: 57, scope: !691)
!703 = !DILocation(line: 44, column: 6, scope: !691)
!704 = !DILocation(line: 46, column: 2, scope: !705)
!705 = !DILexicalBlockFile(scope: !706, file: !1, discriminator: 1)
!706 = distinct !DILexicalBlock(scope: !691, file: !1, line: 46, column: 2)
!707 = !DILocation(line: 44, column: 9, scope: !691)
!708 = !DILocation(line: 48, column: 7, scope: !709)
!709 = !DILexicalBlockFile(scope: !710, file: !1, discriminator: 1)
!710 = distinct !DILexicalBlock(scope: !711, file: !1, line: 48, column: 7)
!711 = distinct !DILexicalBlock(scope: !712, file: !1, line: 47, column: 6)
!712 = distinct !DILexicalBlock(scope: !706, file: !1, line: 46, column: 2)
!713 = !DILocation(line: 50, column: 31, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !1, line: 49, column: 3)
!715 = distinct !DILexicalBlock(scope: !710, file: !1, line: 48, column: 7)
!716 = !DILocation(line: 50, column: 34, scope: !714)
!717 = !DILocation(line: 50, column: 39, scope: !714)
!718 = !DILocation(line: 50, column: 4, scope: !714)
!719 = !DILocation(line: 50, column: 15, scope: !714)
!720 = !{!721, !721, i64 0}
!721 = !{!"float", !616, i64 0}
!722 = !DILocation(line: 50, column: 10, scope: !714)
!723 = !DILocation(line: 55, column: 34, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !1, line: 54, column: 3)
!725 = distinct !DILexicalBlock(scope: !726, file: !1, line: 53, column: 3)
!726 = distinct !DILexicalBlock(scope: !711, file: !1, line: 53, column: 3)
!727 = !DILocation(line: 55, column: 33, scope: !724)
!728 = !DILocation(line: 55, column: 37, scope: !724)
!729 = !DILocation(line: 55, column: 6, scope: !724)
!730 = !DILocation(line: 55, column: 17, scope: !724)
!731 = !{!732}
!732 = distinct !{!732, !733}
!733 = distinct !{!733, !"LVerDomain"}
!734 = !{!735}
!735 = distinct !{!735, !733}
!736 = !DILocation(line: 56, column: 36, scope: !724)
!737 = !DILocation(line: 56, column: 41, scope: !724)
!738 = !DILocation(line: 56, column: 6, scope: !724)
!739 = !DILocation(line: 56, column: 17, scope: !724)
!740 = !DILocation(line: 55, column: 12, scope: !724)
!741 = !DILocation(line: 46, column: 22, scope: !742)
!742 = !DILexicalBlockFile(scope: !712, file: !1, discriminator: 2)
!743 = !DILocation(line: 53, column: 23, scope: !744)
!744 = !DILexicalBlockFile(scope: !725, file: !1, discriminator: 2)
!745 = !DILocation(line: 53, column: 17, scope: !746)
!746 = !DILexicalBlockFile(scope: !725, file: !1, discriminator: 1)
!747 = !DILocation(line: 53, column: 3, scope: !748)
!748 = !DILexicalBlockFile(scope: !726, file: !1, discriminator: 1)
!749 = distinct !{!749, !750, !751, !752, !753}
!750 = !DILocation(line: 53, column: 3, scope: !726)
!751 = !DILocation(line: 57, column: 3, scope: !726)
!752 = !{!"llvm.loop.vectorize.width", i32 1}
!753 = !{!"llvm.loop.interleave.count", i32 1}
!754 = !DILocation(line: 46, column: 16, scope: !755)
!755 = !DILexicalBlockFile(scope: !712, file: !1, discriminator: 1)
!756 = distinct !{!756, !757, !758}
!757 = !DILocation(line: 46, column: 2, scope: !706)
!758 = !DILocation(line: 58, column: 6, scope: !706)
!759 = !DILocation(line: 59, column: 1, scope: !691)
!760 = distinct !DISubprogram(name: "syr2k", linkageName: "_Z5syr2kPfS_S_", scope: !1, file: !1, line: 62, type: !692, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !761)
!761 = !{!762, !763, !764, !765, !766, !767}
!762 = !DILocalVariable(name: "A", arg: 1, scope: !760, file: !1, line: 62, type: !19)
!763 = !DILocalVariable(name: "B", arg: 2, scope: !760, file: !1, line: 62, type: !19)
!764 = !DILocalVariable(name: "C", arg: 3, scope: !760, file: !1, line: 62, type: !19)
!765 = !DILocalVariable(name: "i", scope: !760, file: !1, line: 64, type: !86)
!766 = !DILocalVariable(name: "j", scope: !760, file: !1, line: 64, type: !86)
!767 = !DILocalVariable(name: "k", scope: !760, file: !1, line: 64, type: !86)
!768 = !DILocation(line: 62, column: 23, scope: !760)
!769 = !DILocation(line: 62, column: 37, scope: !760)
!770 = !DILocation(line: 62, column: 51, scope: !760)
!771 = !DILocation(line: 64, column: 6, scope: !760)
!772 = !DILocation(line: 66, column: 4, scope: !773)
!773 = !DILexicalBlockFile(scope: !774, file: !1, discriminator: 1)
!774 = distinct !DILexicalBlock(scope: !760, file: !1, line: 66, column: 4)
!775 = !DILocation(line: 64, column: 9, scope: !760)
!776 = !DILocation(line: 68, column: 6, scope: !777)
!777 = !DILexicalBlockFile(scope: !778, file: !1, discriminator: 1)
!778 = distinct !DILexicalBlock(scope: !779, file: !1, line: 68, column: 6)
!779 = distinct !DILexicalBlock(scope: !780, file: !1, line: 67, column: 2)
!780 = distinct !DILexicalBlock(scope: !774, file: !1, line: 66, column: 4)
!781 = !DILocation(line: 70, column: 9, scope: !782)
!782 = distinct !DILexicalBlock(scope: !783, file: !1, line: 69, column: 3)
!783 = distinct !DILexicalBlock(scope: !778, file: !1, line: 68, column: 6)
!784 = !DILocation(line: 70, column: 20, scope: !782)
!785 = !DILocation(line: 70, column: 15, scope: !782)
!786 = !DILocation(line: 66, column: 24, scope: !787)
!787 = !DILexicalBlockFile(scope: !780, file: !1, discriminator: 2)
!788 = !DILocation(line: 66, column: 18, scope: !789)
!789 = !DILexicalBlockFile(scope: !780, file: !1, discriminator: 1)
!790 = distinct !{!790, !791, !792}
!791 = !DILocation(line: 66, column: 4, scope: !774)
!792 = !DILocation(line: 72, column: 2, scope: !774)
!793 = !DILocation(line: 76, column: 6, scope: !794)
!794 = !DILexicalBlockFile(scope: !795, file: !1, discriminator: 1)
!795 = distinct !DILexicalBlock(scope: !796, file: !1, line: 76, column: 6)
!796 = distinct !DILexicalBlock(scope: !797, file: !1, line: 75, column: 2)
!797 = distinct !DILexicalBlock(scope: !798, file: !1, line: 74, column: 4)
!798 = distinct !DILexicalBlock(scope: !760, file: !1, line: 74, column: 4)
!799 = !DILocation(line: 64, column: 12, scope: !760)
!800 = !DILocation(line: 78, column: 10, scope: !801)
!801 = !DILexicalBlockFile(scope: !802, file: !1, discriminator: 1)
!802 = distinct !DILexicalBlock(scope: !803, file: !1, line: 78, column: 10)
!803 = distinct !DILexicalBlock(scope: !804, file: !1, line: 77, column: 3)
!804 = distinct !DILexicalBlock(scope: !795, file: !1, line: 76, column: 6)
!805 = !DILocation(line: 80, column: 18, scope: !806)
!806 = distinct !DILexicalBlock(scope: !807, file: !1, line: 79, column: 4)
!807 = distinct !DILexicalBlock(scope: !802, file: !1, line: 78, column: 10)
!808 = !DILocation(line: 80, column: 35, scope: !806)
!809 = !DILocation(line: 80, column: 29, scope: !806)
!810 = !DILocation(line: 80, column: 27, scope: !806)
!811 = !DILocation(line: 80, column: 48, scope: !806)
!812 = !DILocation(line: 80, column: 42, scope: !806)
!813 = !DILocation(line: 80, column: 40, scope: !806)
!814 = !DILocation(line: 81, column: 29, scope: !806)
!815 = !DILocation(line: 81, column: 27, scope: !806)
!816 = !DILocation(line: 81, column: 42, scope: !806)
!817 = !DILocation(line: 81, column: 40, scope: !806)
!818 = !DILocation(line: 81, column: 18, scope: !806)
!819 = !DILocation(line: 78, column: 30, scope: !820)
!820 = !DILexicalBlockFile(scope: !807, file: !1, discriminator: 2)
!821 = !DILocation(line: 78, column: 24, scope: !822)
!822 = !DILexicalBlockFile(scope: !807, file: !1, discriminator: 1)
!823 = distinct !{!823, !824, !825}
!824 = !DILocation(line: 78, column: 10, scope: !802)
!825 = !DILocation(line: 82, column: 4, scope: !802)
!826 = !DILocation(line: 76, column: 26, scope: !827)
!827 = !DILexicalBlockFile(scope: !804, file: !1, discriminator: 2)
!828 = !DILocation(line: 76, column: 20, scope: !829)
!829 = !DILexicalBlockFile(scope: !804, file: !1, discriminator: 1)
!830 = distinct !{!830, !831, !832}
!831 = !DILocation(line: 76, column: 6, scope: !795)
!832 = !DILocation(line: 83, column: 3, scope: !795)
!833 = !DILocation(line: 74, column: 24, scope: !834)
!834 = !DILexicalBlockFile(scope: !797, file: !1, discriminator: 2)
!835 = !DILocation(line: 74, column: 18, scope: !836)
!836 = !DILexicalBlockFile(scope: !797, file: !1, discriminator: 1)
!837 = !DILocation(line: 74, column: 4, scope: !838)
!838 = !DILexicalBlockFile(scope: !798, file: !1, discriminator: 1)
!839 = distinct !{!839, !840, !841}
!840 = !DILocation(line: 74, column: 4, scope: !798)
!841 = !DILocation(line: 84, column: 2, scope: !798)
!842 = !DILocation(line: 85, column: 1, scope: !760)
!843 = distinct !DISubprogram(name: "compareResults", linkageName: "_Z14compareResultsPfS_", scope: !1, file: !1, line: 88, type: !844, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !846)
!844 = !DISubroutineType(types: !845)
!845 = !{null, !19, !19}
!846 = !{!847, !848, !849, !850, !851}
!847 = !DILocalVariable(name: "C", arg: 1, scope: !843, file: !1, line: 88, type: !19)
!848 = !DILocalVariable(name: "C_outputFromGpu", arg: 2, scope: !843, file: !1, line: 88, type: !19)
!849 = !DILocalVariable(name: "i", scope: !843, file: !1, line: 90, type: !86)
!850 = !DILocalVariable(name: "j", scope: !843, file: !1, line: 90, type: !86)
!851 = !DILocalVariable(name: "fail", scope: !843, file: !1, line: 90, type: !86)
!852 = !DILocation(line: 88, column: 32, scope: !843)
!853 = !DILocation(line: 88, column: 46, scope: !843)
!854 = !DILocation(line: 90, column: 10, scope: !843)
!855 = !DILocation(line: 90, column: 6, scope: !843)
!856 = !DILocation(line: 94, column: 2, scope: !857)
!857 = !DILexicalBlockFile(scope: !858, file: !1, discriminator: 1)
!858 = distinct !DILexicalBlock(scope: !843, file: !1, line: 94, column: 2)
!859 = !DILocation(line: 90, column: 8, scope: !843)
!860 = !DILocation(line: 96, column: 3, scope: !861)
!861 = !DILexicalBlockFile(scope: !862, file: !1, discriminator: 1)
!862 = distinct !DILexicalBlock(scope: !863, file: !1, line: 96, column: 3)
!863 = distinct !DILexicalBlock(scope: !864, file: !1, line: 95, column: 2)
!864 = distinct !DILexicalBlock(scope: !858, file: !1, line: 94, column: 2)
!865 = !DILocation(line: 96, column: 19, scope: !866)
!866 = !DILexicalBlockFile(scope: !867, file: !1, discriminator: 2)
!867 = distinct !DILexicalBlock(scope: !862, file: !1, line: 96, column: 3)
!868 = !DILocation(line: 98, column: 26, scope: !869)
!869 = distinct !DILexicalBlock(scope: !870, file: !1, line: 98, column: 8)
!870 = distinct !DILexicalBlock(scope: !867, file: !1, line: 97, column: 3)
!871 = !DILocation(line: 98, column: 20, scope: !869)
!872 = !DILocation(line: 98, column: 32, scope: !869)
!873 = !DILocation(line: 24, column: 7, scope: !631, inlinedAt: !874)
!874 = distinct !DILocation(line: 38, column: 7, scope: !645, inlinedAt: !875)
!875 = distinct !DILocation(line: 98, column: 8, scope: !869)
!876 = !DILocation(line: 26, column: 13, scope: !633, inlinedAt: !874)
!877 = !DILocation(line: 24, column: 5, scope: !626, inlinedAt: !874)
!878 = !DILocation(line: 38, column: 7, scope: !645, inlinedAt: !875)
!879 = !DILocation(line: 38, column: 20, scope: !645, inlinedAt: !875)
!880 = !DILocation(line: 24, column: 7, scope: !631, inlinedAt: !881)
!881 = distinct !DILocation(line: 38, column: 32, scope: !655, inlinedAt: !875)
!882 = !DILocation(line: 26, column: 13, scope: !633, inlinedAt: !881)
!883 = !DILocation(line: 24, column: 5, scope: !626, inlinedAt: !881)
!884 = !DILocation(line: 38, column: 32, scope: !655, inlinedAt: !875)
!885 = !DILocation(line: 38, column: 45, scope: !655, inlinedAt: !875)
!886 = !DILocation(line: 45, column: 38, scope: !666, inlinedAt: !875)
!887 = !DILocation(line: 24, column: 7, scope: !631, inlinedAt: !888)
!888 = distinct !DILocation(line: 45, column: 31, scope: !666, inlinedAt: !875)
!889 = !DILocation(line: 26, column: 13, scope: !633, inlinedAt: !888)
!890 = !DILocation(line: 24, column: 5, scope: !626, inlinedAt: !888)
!891 = !DILocation(line: 45, column: 60, scope: !666, inlinedAt: !875)
!892 = !DILocation(line: 24, column: 7, scope: !631, inlinedAt: !893)
!893 = distinct !DILocation(line: 45, column: 53, scope: !677, inlinedAt: !875)
!894 = !DILocation(line: 26, column: 13, scope: !633, inlinedAt: !893)
!895 = !DILocation(line: 24, column: 5, scope: !626, inlinedAt: !893)
!896 = !DILocation(line: 45, column: 51, scope: !666, inlinedAt: !875)
!897 = !DILocation(line: 24, column: 7, scope: !631, inlinedAt: !898)
!898 = distinct !DILocation(line: 45, column: 24, scope: !684, inlinedAt: !875)
!899 = !DILocation(line: 26, column: 13, scope: !633, inlinedAt: !898)
!900 = !DILocation(line: 24, column: 5, scope: !626, inlinedAt: !898)
!901 = !DILocation(line: 45, column: 21, scope: !666, inlinedAt: !875)
!902 = !DILocation(line: 98, column: 8, scope: !869)
!903 = !DILocation(line: 98, column: 58, scope: !869)
!904 = !DILocation(line: 98, column: 8, scope: !870)
!905 = distinct !{!905, !906, !907, !752, !753}
!906 = !DILocation(line: 96, column: 3, scope: !862)
!907 = !DILocation(line: 102, column: 3, scope: !862)
!908 = !DILocation(line: 94, column: 18, scope: !909)
!909 = !DILexicalBlockFile(scope: !864, file: !1, discriminator: 2)
!910 = !DILocation(line: 94, column: 13, scope: !911)
!911 = !DILexicalBlockFile(scope: !864, file: !1, discriminator: 1)
!912 = distinct !{!912, !913, !914}
!913 = !DILocation(line: 94, column: 2, scope: !858)
!914 = !DILocation(line: 103, column: 2, scope: !858)
!915 = !DILocation(line: 106, column: 2, scope: !843)
!916 = !DILocation(line: 107, column: 1, scope: !843)
!917 = distinct !DISubprogram(name: "GPU_argv_init", linkageName: "_Z13GPU_argv_initv", scope: !1, file: !1, line: 110, type: !283, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !918)
!918 = !{!919}
!919 = !DILocalVariable(name: "deviceProp", scope: !917, file: !1, line: 112, type: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cudaDeviceProp", file: !4, line: 1257, size: 5056, elements: !921, identifier: "_ZTS14cudaDeviceProp")
!921 = !{!922, !926, !927, !928, !929, !930, !931, !932, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !920, file: !4, line: 1259, baseType: !923, size: 2048)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 2048, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "totalGlobalMem", scope: !920, file: !4, line: 1260, baseType: !16, size: 64, offset: 2048)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerBlock", scope: !920, file: !4, line: 1261, baseType: !16, size: 64, offset: 2112)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerBlock", scope: !920, file: !4, line: 1262, baseType: !86, size: 32, offset: 2176)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "warpSize", scope: !920, file: !4, line: 1263, baseType: !86, size: 32, offset: 2208)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "memPitch", scope: !920, file: !4, line: 1264, baseType: !16, size: 64, offset: 2240)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerBlock", scope: !920, file: !4, line: 1265, baseType: !86, size: 32, offset: 2304)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsDim", scope: !920, file: !4, line: 1266, baseType: !933, size: 96, offset: 2336)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 96, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 3)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "maxGridSize", scope: !920, file: !4, line: 1267, baseType: !933, size: 96, offset: 2432)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "clockRate", scope: !920, file: !4, line: 1268, baseType: !86, size: 32, offset: 2528)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "totalConstMem", scope: !920, file: !4, line: 1269, baseType: !16, size: 64, offset: 2560)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !920, file: !4, line: 1270, baseType: !86, size: 32, offset: 2624)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !920, file: !4, line: 1271, baseType: !86, size: 32, offset: 2656)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "textureAlignment", scope: !920, file: !4, line: 1272, baseType: !16, size: 64, offset: 2688)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "texturePitchAlignment", scope: !920, file: !4, line: 1273, baseType: !16, size: 64, offset: 2752)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "deviceOverlap", scope: !920, file: !4, line: 1274, baseType: !86, size: 32, offset: 2816)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "multiProcessorCount", scope: !920, file: !4, line: 1275, baseType: !86, size: 32, offset: 2848)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "kernelExecTimeoutEnabled", scope: !920, file: !4, line: 1276, baseType: !86, size: 32, offset: 2880)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "integrated", scope: !920, file: !4, line: 1277, baseType: !86, size: 32, offset: 2912)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "canMapHostMemory", scope: !920, file: !4, line: 1278, baseType: !86, size: 32, offset: 2944)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "computeMode", scope: !920, file: !4, line: 1279, baseType: !86, size: 32, offset: 2976)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1D", scope: !920, file: !4, line: 1280, baseType: !86, size: 32, offset: 3008)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DMipmap", scope: !920, file: !4, line: 1281, baseType: !86, size: 32, offset: 3040)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLinear", scope: !920, file: !4, line: 1282, baseType: !86, size: 32, offset: 3072)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2D", scope: !920, file: !4, line: 1283, baseType: !953, size: 64, offset: 3104)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 64, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 2)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DMipmap", scope: !920, file: !4, line: 1284, baseType: !953, size: 64, offset: 3168)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLinear", scope: !920, file: !4, line: 1285, baseType: !933, size: 96, offset: 3232)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DGather", scope: !920, file: !4, line: 1286, baseType: !953, size: 64, offset: 3328)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3D", scope: !920, file: !4, line: 1287, baseType: !933, size: 96, offset: 3392)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3DAlt", scope: !920, file: !4, line: 1288, baseType: !933, size: 96, offset: 3488)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemap", scope: !920, file: !4, line: 1289, baseType: !86, size: 32, offset: 3584)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLayered", scope: !920, file: !4, line: 1290, baseType: !953, size: 64, offset: 3616)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLayered", scope: !920, file: !4, line: 1291, baseType: !933, size: 96, offset: 3680)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemapLayered", scope: !920, file: !4, line: 1292, baseType: !953, size: 64, offset: 3776)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1D", scope: !920, file: !4, line: 1293, baseType: !86, size: 32, offset: 3840)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2D", scope: !920, file: !4, line: 1294, baseType: !953, size: 64, offset: 3872)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface3D", scope: !920, file: !4, line: 1295, baseType: !933, size: 96, offset: 3936)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1DLayered", scope: !920, file: !4, line: 1296, baseType: !953, size: 64, offset: 4032)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2DLayered", scope: !920, file: !4, line: 1297, baseType: !933, size: 96, offset: 4096)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemap", scope: !920, file: !4, line: 1298, baseType: !86, size: 32, offset: 4192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemapLayered", scope: !920, file: !4, line: 1299, baseType: !953, size: 64, offset: 4224)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceAlignment", scope: !920, file: !4, line: 1300, baseType: !16, size: 64, offset: 4288)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "concurrentKernels", scope: !920, file: !4, line: 1301, baseType: !86, size: 32, offset: 4352)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ECCEnabled", scope: !920, file: !4, line: 1302, baseType: !86, size: 32, offset: 4384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "pciBusID", scope: !920, file: !4, line: 1303, baseType: !86, size: 32, offset: 4416)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "pciDeviceID", scope: !920, file: !4, line: 1304, baseType: !86, size: 32, offset: 4448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "pciDomainID", scope: !920, file: !4, line: 1305, baseType: !86, size: 32, offset: 4480)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "tccDriver", scope: !920, file: !4, line: 1306, baseType: !86, size: 32, offset: 4512)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "asyncEngineCount", scope: !920, file: !4, line: 1307, baseType: !86, size: 32, offset: 4544)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "unifiedAddressing", scope: !920, file: !4, line: 1308, baseType: !86, size: 32, offset: 4576)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "memoryClockRate", scope: !920, file: !4, line: 1309, baseType: !86, size: 32, offset: 4608)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "memoryBusWidth", scope: !920, file: !4, line: 1310, baseType: !86, size: 32, offset: 4640)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "l2CacheSize", scope: !920, file: !4, line: 1311, baseType: !86, size: 32, offset: 4672)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerMultiProcessor", scope: !920, file: !4, line: 1312, baseType: !86, size: 32, offset: 4704)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "streamPrioritiesSupported", scope: !920, file: !4, line: 1313, baseType: !86, size: 32, offset: 4736)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "globalL1CacheSupported", scope: !920, file: !4, line: 1314, baseType: !86, size: 32, offset: 4768)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "localL1CacheSupported", scope: !920, file: !4, line: 1315, baseType: !86, size: 32, offset: 4800)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerMultiprocessor", scope: !920, file: !4, line: 1316, baseType: !16, size: 64, offset: 4864)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerMultiprocessor", scope: !920, file: !4, line: 1317, baseType: !86, size: 32, offset: 4928)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "managedMemory", scope: !920, file: !4, line: 1318, baseType: !86, size: 32, offset: 4960)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "isMultiGpuBoard", scope: !920, file: !4, line: 1319, baseType: !86, size: 32, offset: 4992)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "multiGpuBoardGroupID", scope: !920, file: !4, line: 1320, baseType: !86, size: 32, offset: 5024)
!993 = !DILocation(line: 112, column: 2, scope: !917)
!994 = !DILocation(line: 112, column: 17, scope: !917)
!995 = !DILocation(line: 113, column: 2, scope: !917)
!996 = !DILocation(line: 114, column: 2, scope: !917)
!997 = !DILocation(line: 115, column: 2, scope: !917)
!998 = !DILocation(line: 116, column: 1, scope: !917)
!999 = distinct !DISubprogram(name: "syr2k_kernel", linkageName: "_Z12syr2k_kernelPfS_S_", scope: !1, file: !1, line: 119, type: !692, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DILocalVariable(name: "a", arg: 1, scope: !999, file: !1, line: 119, type: !19)
!1002 = !DILocalVariable(name: "b", arg: 2, scope: !999, file: !1, line: 119, type: !19)
!1003 = !DILocalVariable(name: "c", arg: 3, scope: !999, file: !1, line: 119, type: !19)
!1004 = !DILocation(line: 119, column: 41, scope: !999)
!1005 = !{!1006, !1006, i64 0}
!1006 = !{!"any pointer", !616, i64 0}
!1007 = !DILocation(line: 119, column: 55, scope: !999)
!1008 = !DILocation(line: 119, column: 69, scope: !999)
!1009 = !DILocation(line: 120, column: 1, scope: !999)
!1010 = !DILocation(line: 120, column: 1, scope: !1011)
!1011 = !DILexicalBlockFile(scope: !999, file: !1, discriminator: 1)
!1012 = !DILocation(line: 120, column: 1, scope: !1013)
!1013 = !DILexicalBlockFile(scope: !999, file: !1, discriminator: 2)
!1014 = !DILocation(line: 120, column: 1, scope: !1015)
!1015 = !DILexicalBlockFile(scope: !999, file: !1, discriminator: 3)
!1016 = !DILocation(line: 134, column: 1, scope: !999)
!1017 = distinct !DISubprogram(name: "syr2kCuda", linkageName: "_Z9syr2kCudaPfS_S_S_", scope: !1, file: !1, line: 137, type: !1018, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1020)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{null, !19, !19, !19, !19}
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1054}
!1021 = !DILocalVariable(name: "A", arg: 1, scope: !1017, file: !1, line: 137, type: !19)
!1022 = !DILocalVariable(name: "B", arg: 2, scope: !1017, file: !1, line: 137, type: !19)
!1023 = !DILocalVariable(name: "C", arg: 3, scope: !1017, file: !1, line: 137, type: !19)
!1024 = !DILocalVariable(name: "C_outputFromGpu", arg: 4, scope: !1017, file: !1, line: 137, type: !19)
!1025 = !DILocalVariable(name: "t_start", scope: !1017, file: !1, line: 139, type: !165)
!1026 = !DILocalVariable(name: "t_end", scope: !1017, file: !1, line: 139, type: !165)
!1027 = !DILocalVariable(name: "A_gpu", scope: !1017, file: !1, line: 141, type: !19)
!1028 = !DILocalVariable(name: "B_gpu", scope: !1017, file: !1, line: 142, type: !19)
!1029 = !DILocalVariable(name: "C_gpu", scope: !1017, file: !1, line: 143, type: !19)
!1030 = !DILocalVariable(name: "block", scope: !1017, file: !1, line: 152, type: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "dim3", file: !1032, line: 427, baseType: !1033)
!1032 = !DIFile(filename: "/usr/local/cuda/include/vector_types.h", directory: "/home/dshen/llvm/llvm/lib/Transforms/Hello/expr/BD_mode/syr2kllvm")
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dim3", file: !1032, line: 417, size: 96, elements: !1034, identifier: "_ZTS4dim3")
!1034 = !{!1035, !1036, !1037, !1038, !1042, !1051}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1033, file: !1032, line: 419, baseType: !379, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1033, file: !1032, line: 419, baseType: !379, size: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !1033, file: !1032, line: 419, baseType: !379, size: 32, offset: 64)
!1038 = !DISubprogram(name: "dim3", scope: !1033, file: !1032, line: 421, type: !1039, isLocal: false, isDefinition: false, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !1041, !379, !379, !379}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1042 = !DISubprogram(name: "dim3", scope: !1033, file: !1032, line: 422, type: !1043, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{null, !1041, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1032, line: 383, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uint3", file: !1032, line: 190, size: 96, elements: !1047, identifier: "_ZTS5uint3")
!1047 = !{!1048, !1049, !1050}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1046, file: !1032, line: 192, baseType: !379, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1046, file: !1032, line: 192, baseType: !379, size: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !1046, file: !1032, line: 192, baseType: !379, size: 32, offset: 64)
!1051 = !DISubprogram(name: "operator uint3", linkageName: "_ZN4dim3cv5uint3Ev", scope: !1033, file: !1032, line: 423, type: !1052, isLocal: false, isDefinition: false, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!1045, !1041}
!1054 = !DILocalVariable(name: "grid", scope: !1017, file: !1, line: 153, type: !1031)
!1055 = !DILocation(line: 137, column: 27, scope: !1017)
!1056 = !DILocation(line: 137, column: 41, scope: !1017)
!1057 = !DILocation(line: 137, column: 55, scope: !1017)
!1058 = !DILocation(line: 137, column: 69, scope: !1017)
!1059 = !DILocation(line: 141, column: 2, scope: !1017)
!1060 = !DILocation(line: 142, column: 2, scope: !1017)
!1061 = !DILocation(line: 143, column: 2, scope: !1017)
!1062 = !DILocation(line: 145, column: 13, scope: !1017)
!1063 = !DILocation(line: 145, column: 2, scope: !1017)
!1064 = !DILocation(line: 146, column: 13, scope: !1017)
!1065 = !DILocation(line: 146, column: 2, scope: !1017)
!1066 = !DILocation(line: 147, column: 13, scope: !1017)
!1067 = !DILocation(line: 147, column: 2, scope: !1017)
!1068 = !DILocation(line: 148, column: 13, scope: !1017)
!1069 = !DILocation(line: 148, column: 20, scope: !1017)
!1070 = !DILocation(line: 148, column: 2, scope: !1017)
!1071 = !DILocation(line: 149, column: 13, scope: !1017)
!1072 = !DILocation(line: 149, column: 20, scope: !1017)
!1073 = !DILocation(line: 149, column: 2, scope: !1017)
!1074 = !DILocation(line: 150, column: 13, scope: !1017)
!1075 = !DILocation(line: 150, column: 20, scope: !1017)
!1076 = !DILocation(line: 150, column: 2, scope: !1017)
!1077 = !DILocation(line: 152, column: 7, scope: !1017)
!1078 = !DILocation(line: 153, column: 7, scope: !1017)
!1079 = !DILocation(line: 13, column: 5, scope: !578, inlinedAt: !1080)
!1080 = distinct !DILocation(line: 159, column: 12, scope: !1017)
!1081 = !DILocation(line: 14, column: 5, scope: !578, inlinedAt: !1080)
!1082 = !DILocation(line: 13, column: 21, scope: !578, inlinedAt: !1080)
!1083 = !DILocation(line: 14, column: 20, scope: !578, inlinedAt: !1080)
!1084 = !DILocation(line: 16, column: 12, scope: !578, inlinedAt: !1080)
!1085 = !DILocation(line: 15, column: 9, scope: !578, inlinedAt: !1080)
!1086 = !DILocation(line: 17, column: 14, scope: !608, inlinedAt: !1080)
!1087 = !DILocation(line: 17, column: 9, scope: !578, inlinedAt: !1080)
!1088 = !DILocation(line: 17, column: 20, scope: !611, inlinedAt: !1080)
!1089 = !DILocation(line: 18, column: 15, scope: !578, inlinedAt: !1080)
!1090 = !DILocation(line: 18, column: 12, scope: !578, inlinedAt: !1080)
!1091 = !DILocation(line: 18, column: 27, scope: !578, inlinedAt: !1080)
!1092 = !DILocation(line: 18, column: 24, scope: !578, inlinedAt: !1080)
!1093 = !DILocation(line: 18, column: 34, scope: !578, inlinedAt: !1080)
!1094 = !DILocation(line: 18, column: 22, scope: !578, inlinedAt: !1080)
!1095 = !DILocation(line: 19, column: 1, scope: !578, inlinedAt: !1080)
!1096 = !DILocation(line: 139, column: 9, scope: !1017)
!1097 = !DILocation(line: 160, column: 14, scope: !1017)
!1098 = !DILocation(line: 160, column: 2, scope: !1017)
!1099 = !DILocation(line: 160, column: 31, scope: !1100)
!1100 = !DILexicalBlockFile(scope: !1017, file: !1, discriminator: 1)
!1101 = !DILocation(line: 160, column: 37, scope: !1100)
!1102 = !DILocation(line: 160, column: 43, scope: !1100)
!1103 = !DILocation(line: 119, column: 41, scope: !999, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 160, column: 2, scope: !1100)
!1105 = !DILocation(line: 120, column: 1, scope: !999, inlinedAt: !1104)
!1106 = !DILocation(line: 120, column: 1, scope: !1011, inlinedAt: !1104)
!1107 = !DILocation(line: 120, column: 1, scope: !1013, inlinedAt: !1104)
!1108 = !DILocation(line: 120, column: 1, scope: !1015, inlinedAt: !1104)
!1109 = !DILocation(line: 134, column: 1, scope: !999, inlinedAt: !1104)
